konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/m33.inc
#
# Derived from Raspberry Pi Pico SDK
#
# Copyright (c) 2024 Raspberry Pi Ltd.
#
# Redistribution and use permitted under BSD 3-Clause terms.
# See full license in THIRD_PARTY_LICENSES/PICO_SDK_LICENSE.txt
#
# =============================================================================
# Register block : M33
# Version        : 1
# Bus type       : apb
# Description    : TEAL registers accessible through the debug interface
# =============================================================================
.ifndef	_HARDWARE_REGS_M33_H
.set	_HARDWARE_REGS_M33_H, 1
# =============================================================================
# Register    : M33_ITM_STIM0
# Description : Provides the interface for generating Instrumentation packets
.equ	M33_ITM_STIM0_OFFSET, 0x00000000
.equ	M33_ITM_STIM0_BITS, 0xffffffff
.equ	M33_ITM_STIM0_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_ITM_STIM0_STIMULUS
# Description : Data to write to the Stimulus Port FIFO, for forwarding as an
#               Instrumentation packet. The size of write access determines the
#               type of Instrumentation packet generated.
.equ	M33_ITM_STIM0_STIMULUS_RESET, 0x00000000
.equ	M33_ITM_STIM0_STIMULUS_BITS, 0xffffffff
.equ	M33_ITM_STIM0_STIMULUS_MSB, 31
.equ	M33_ITM_STIM0_STIMULUS_LSB, 0
# =============================================================================
# Register    : M33_ITM_STIM1
# Description : Provides the interface for generating Instrumentation packets
.equ	M33_ITM_STIM1_OFFSET, 0x00000004
.equ	M33_ITM_STIM1_BITS, 0xffffffff
.equ	M33_ITM_STIM1_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_ITM_STIM1_STIMULUS
# Description : Data to write to the Stimulus Port FIFO, for forwarding as an
#               Instrumentation packet. The size of write access determines the
#               type of Instrumentation packet generated.
.equ	M33_ITM_STIM1_STIMULUS_RESET, 0x00000000
.equ	M33_ITM_STIM1_STIMULUS_BITS, 0xffffffff
.equ	M33_ITM_STIM1_STIMULUS_MSB, 31
.equ	M33_ITM_STIM1_STIMULUS_LSB, 0
# =============================================================================
# Register    : M33_ITM_STIM2
# Description : Provides the interface for generating Instrumentation packets
.equ	M33_ITM_STIM2_OFFSET, 0x00000008
.equ	M33_ITM_STIM2_BITS, 0xffffffff
.equ	M33_ITM_STIM2_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_ITM_STIM2_STIMULUS
# Description : Data to write to the Stimulus Port FIFO, for forwarding as an
#               Instrumentation packet. The size of write access determines the
#               type of Instrumentation packet generated.
.equ	M33_ITM_STIM2_STIMULUS_RESET, 0x00000000
.equ	M33_ITM_STIM2_STIMULUS_BITS, 0xffffffff
.equ	M33_ITM_STIM2_STIMULUS_MSB, 31
.equ	M33_ITM_STIM2_STIMULUS_LSB, 0
# =============================================================================
# Register    : M33_ITM_STIM3
# Description : Provides the interface for generating Instrumentation packets
.equ	M33_ITM_STIM3_OFFSET, 0x0000000c
.equ	M33_ITM_STIM3_BITS, 0xffffffff
.equ	M33_ITM_STIM3_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_ITM_STIM3_STIMULUS
# Description : Data to write to the Stimulus Port FIFO, for forwarding as an
#               Instrumentation packet. The size of write access determines the
#               type of Instrumentation packet generated.
.equ	M33_ITM_STIM3_STIMULUS_RESET, 0x00000000
.equ	M33_ITM_STIM3_STIMULUS_BITS, 0xffffffff
.equ	M33_ITM_STIM3_STIMULUS_MSB, 31
.equ	M33_ITM_STIM3_STIMULUS_LSB, 0
# =============================================================================
# Register    : M33_ITM_STIM4
# Description : Provides the interface for generating Instrumentation packets
.equ	M33_ITM_STIM4_OFFSET, 0x00000010
.equ	M33_ITM_STIM4_BITS, 0xffffffff
.equ	M33_ITM_STIM4_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_ITM_STIM4_STIMULUS
# Description : Data to write to the Stimulus Port FIFO, for forwarding as an
#               Instrumentation packet. The size of write access determines the
#               type of Instrumentation packet generated.
.equ	M33_ITM_STIM4_STIMULUS_RESET, 0x00000000
.equ	M33_ITM_STIM4_STIMULUS_BITS, 0xffffffff
.equ	M33_ITM_STIM4_STIMULUS_MSB, 31
.equ	M33_ITM_STIM4_STIMULUS_LSB, 0
# =============================================================================
# Register    : M33_ITM_STIM5
# Description : Provides the interface for generating Instrumentation packets
.equ	M33_ITM_STIM5_OFFSET, 0x00000014
.equ	M33_ITM_STIM5_BITS, 0xffffffff
.equ	M33_ITM_STIM5_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_ITM_STIM5_STIMULUS
# Description : Data to write to the Stimulus Port FIFO, for forwarding as an
#               Instrumentation packet. The size of write access determines the
#               type of Instrumentation packet generated.
.equ	M33_ITM_STIM5_STIMULUS_RESET, 0x00000000
.equ	M33_ITM_STIM5_STIMULUS_BITS, 0xffffffff
.equ	M33_ITM_STIM5_STIMULUS_MSB, 31
.equ	M33_ITM_STIM5_STIMULUS_LSB, 0
# =============================================================================
# Register    : M33_ITM_STIM6
# Description : Provides the interface for generating Instrumentation packets
.equ	M33_ITM_STIM6_OFFSET, 0x00000018
.equ	M33_ITM_STIM6_BITS, 0xffffffff
.equ	M33_ITM_STIM6_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_ITM_STIM6_STIMULUS
# Description : Data to write to the Stimulus Port FIFO, for forwarding as an
#               Instrumentation packet. The size of write access determines the
#               type of Instrumentation packet generated.
.equ	M33_ITM_STIM6_STIMULUS_RESET, 0x00000000
.equ	M33_ITM_STIM6_STIMULUS_BITS, 0xffffffff
.equ	M33_ITM_STIM6_STIMULUS_MSB, 31
.equ	M33_ITM_STIM6_STIMULUS_LSB, 0
# =============================================================================
# Register    : M33_ITM_STIM7
# Description : Provides the interface for generating Instrumentation packets
.equ	M33_ITM_STIM7_OFFSET, 0x0000001c
.equ	M33_ITM_STIM7_BITS, 0xffffffff
.equ	M33_ITM_STIM7_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_ITM_STIM7_STIMULUS
# Description : Data to write to the Stimulus Port FIFO, for forwarding as an
#               Instrumentation packet. The size of write access determines the
#               type of Instrumentation packet generated.
.equ	M33_ITM_STIM7_STIMULUS_RESET, 0x00000000
.equ	M33_ITM_STIM7_STIMULUS_BITS, 0xffffffff
.equ	M33_ITM_STIM7_STIMULUS_MSB, 31
.equ	M33_ITM_STIM7_STIMULUS_LSB, 0
# =============================================================================
# Register    : M33_ITM_STIM8
# Description : Provides the interface for generating Instrumentation packets
.equ	M33_ITM_STIM8_OFFSET, 0x00000020
.equ	M33_ITM_STIM8_BITS, 0xffffffff
.equ	M33_ITM_STIM8_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_ITM_STIM8_STIMULUS
# Description : Data to write to the Stimulus Port FIFO, for forwarding as an
#               Instrumentation packet. The size of write access determines the
#               type of Instrumentation packet generated.
.equ	M33_ITM_STIM8_STIMULUS_RESET, 0x00000000
.equ	M33_ITM_STIM8_STIMULUS_BITS, 0xffffffff
.equ	M33_ITM_STIM8_STIMULUS_MSB, 31
.equ	M33_ITM_STIM8_STIMULUS_LSB, 0
# =============================================================================
# Register    : M33_ITM_STIM9
# Description : Provides the interface for generating Instrumentation packets
.equ	M33_ITM_STIM9_OFFSET, 0x00000024
.equ	M33_ITM_STIM9_BITS, 0xffffffff
.equ	M33_ITM_STIM9_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_ITM_STIM9_STIMULUS
# Description : Data to write to the Stimulus Port FIFO, for forwarding as an
#               Instrumentation packet. The size of write access determines the
#               type of Instrumentation packet generated.
.equ	M33_ITM_STIM9_STIMULUS_RESET, 0x00000000
.equ	M33_ITM_STIM9_STIMULUS_BITS, 0xffffffff
.equ	M33_ITM_STIM9_STIMULUS_MSB, 31
.equ	M33_ITM_STIM9_STIMULUS_LSB, 0
# =============================================================================
# Register    : M33_ITM_STIM10
# Description : Provides the interface for generating Instrumentation packets
.equ	M33_ITM_STIM10_OFFSET, 0x00000028
.equ	M33_ITM_STIM10_BITS, 0xffffffff
.equ	M33_ITM_STIM10_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_ITM_STIM10_STIMULUS
# Description : Data to write to the Stimulus Port FIFO, for forwarding as an
#               Instrumentation packet. The size of write access determines the
#               type of Instrumentation packet generated.
.equ	M33_ITM_STIM10_STIMULUS_RESET, 0x00000000
.equ	M33_ITM_STIM10_STIMULUS_BITS, 0xffffffff
.equ	M33_ITM_STIM10_STIMULUS_MSB, 31
.equ	M33_ITM_STIM10_STIMULUS_LSB, 0
# =============================================================================
# Register    : M33_ITM_STIM11
# Description : Provides the interface for generating Instrumentation packets
.equ	M33_ITM_STIM11_OFFSET, 0x0000002c
.equ	M33_ITM_STIM11_BITS, 0xffffffff
.equ	M33_ITM_STIM11_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_ITM_STIM11_STIMULUS
# Description : Data to write to the Stimulus Port FIFO, for forwarding as an
#               Instrumentation packet. The size of write access determines the
#               type of Instrumentation packet generated.
.equ	M33_ITM_STIM11_STIMULUS_RESET, 0x00000000
.equ	M33_ITM_STIM11_STIMULUS_BITS, 0xffffffff
.equ	M33_ITM_STIM11_STIMULUS_MSB, 31
.equ	M33_ITM_STIM11_STIMULUS_LSB, 0
# =============================================================================
# Register    : M33_ITM_STIM12
# Description : Provides the interface for generating Instrumentation packets
.equ	M33_ITM_STIM12_OFFSET, 0x00000030
.equ	M33_ITM_STIM12_BITS, 0xffffffff
.equ	M33_ITM_STIM12_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_ITM_STIM12_STIMULUS
# Description : Data to write to the Stimulus Port FIFO, for forwarding as an
#               Instrumentation packet. The size of write access determines the
#               type of Instrumentation packet generated.
.equ	M33_ITM_STIM12_STIMULUS_RESET, 0x00000000
.equ	M33_ITM_STIM12_STIMULUS_BITS, 0xffffffff
.equ	M33_ITM_STIM12_STIMULUS_MSB, 31
.equ	M33_ITM_STIM12_STIMULUS_LSB, 0
# =============================================================================
# Register    : M33_ITM_STIM13
# Description : Provides the interface for generating Instrumentation packets
.equ	M33_ITM_STIM13_OFFSET, 0x00000034
.equ	M33_ITM_STIM13_BITS, 0xffffffff
.equ	M33_ITM_STIM13_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_ITM_STIM13_STIMULUS
# Description : Data to write to the Stimulus Port FIFO, for forwarding as an
#               Instrumentation packet. The size of write access determines the
#               type of Instrumentation packet generated.
.equ	M33_ITM_STIM13_STIMULUS_RESET, 0x00000000
.equ	M33_ITM_STIM13_STIMULUS_BITS, 0xffffffff
.equ	M33_ITM_STIM13_STIMULUS_MSB, 31
.equ	M33_ITM_STIM13_STIMULUS_LSB, 0
# =============================================================================
# Register    : M33_ITM_STIM14
# Description : Provides the interface for generating Instrumentation packets
.equ	M33_ITM_STIM14_OFFSET, 0x00000038
.equ	M33_ITM_STIM14_BITS, 0xffffffff
.equ	M33_ITM_STIM14_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_ITM_STIM14_STIMULUS
# Description : Data to write to the Stimulus Port FIFO, for forwarding as an
#               Instrumentation packet. The size of write access determines the
#               type of Instrumentation packet generated.
.equ	M33_ITM_STIM14_STIMULUS_RESET, 0x00000000
.equ	M33_ITM_STIM14_STIMULUS_BITS, 0xffffffff
.equ	M33_ITM_STIM14_STIMULUS_MSB, 31
.equ	M33_ITM_STIM14_STIMULUS_LSB, 0
# =============================================================================
# Register    : M33_ITM_STIM15
# Description : Provides the interface for generating Instrumentation packets
.equ	M33_ITM_STIM15_OFFSET, 0x0000003c
.equ	M33_ITM_STIM15_BITS, 0xffffffff
.equ	M33_ITM_STIM15_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_ITM_STIM15_STIMULUS
# Description : Data to write to the Stimulus Port FIFO, for forwarding as an
#               Instrumentation packet. The size of write access determines the
#               type of Instrumentation packet generated.
.equ	M33_ITM_STIM15_STIMULUS_RESET, 0x00000000
.equ	M33_ITM_STIM15_STIMULUS_BITS, 0xffffffff
.equ	M33_ITM_STIM15_STIMULUS_MSB, 31
.equ	M33_ITM_STIM15_STIMULUS_LSB, 0
# =============================================================================
# Register    : M33_ITM_STIM16
# Description : Provides the interface for generating Instrumentation packets
.equ	M33_ITM_STIM16_OFFSET, 0x00000040
.equ	M33_ITM_STIM16_BITS, 0xffffffff
.equ	M33_ITM_STIM16_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_ITM_STIM16_STIMULUS
# Description : Data to write to the Stimulus Port FIFO, for forwarding as an
#               Instrumentation packet. The size of write access determines the
#               type of Instrumentation packet generated.
.equ	M33_ITM_STIM16_STIMULUS_RESET, 0x00000000
.equ	M33_ITM_STIM16_STIMULUS_BITS, 0xffffffff
.equ	M33_ITM_STIM16_STIMULUS_MSB, 31
.equ	M33_ITM_STIM16_STIMULUS_LSB, 0
# =============================================================================
# Register    : M33_ITM_STIM17
# Description : Provides the interface for generating Instrumentation packets
.equ	M33_ITM_STIM17_OFFSET, 0x00000044
.equ	M33_ITM_STIM17_BITS, 0xffffffff
.equ	M33_ITM_STIM17_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_ITM_STIM17_STIMULUS
# Description : Data to write to the Stimulus Port FIFO, for forwarding as an
#               Instrumentation packet. The size of write access determines the
#               type of Instrumentation packet generated.
.equ	M33_ITM_STIM17_STIMULUS_RESET, 0x00000000
.equ	M33_ITM_STIM17_STIMULUS_BITS, 0xffffffff
.equ	M33_ITM_STIM17_STIMULUS_MSB, 31
.equ	M33_ITM_STIM17_STIMULUS_LSB, 0
# =============================================================================
# Register    : M33_ITM_STIM18
# Description : Provides the interface for generating Instrumentation packets
.equ	M33_ITM_STIM18_OFFSET, 0x00000048
.equ	M33_ITM_STIM18_BITS, 0xffffffff
.equ	M33_ITM_STIM18_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_ITM_STIM18_STIMULUS
# Description : Data to write to the Stimulus Port FIFO, for forwarding as an
#               Instrumentation packet. The size of write access determines the
#               type of Instrumentation packet generated.
.equ	M33_ITM_STIM18_STIMULUS_RESET, 0x00000000
.equ	M33_ITM_STIM18_STIMULUS_BITS, 0xffffffff
.equ	M33_ITM_STIM18_STIMULUS_MSB, 31
.equ	M33_ITM_STIM18_STIMULUS_LSB, 0
# =============================================================================
# Register    : M33_ITM_STIM19
# Description : Provides the interface for generating Instrumentation packets
.equ	M33_ITM_STIM19_OFFSET, 0x0000004c
.equ	M33_ITM_STIM19_BITS, 0xffffffff
.equ	M33_ITM_STIM19_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_ITM_STIM19_STIMULUS
# Description : Data to write to the Stimulus Port FIFO, for forwarding as an
#               Instrumentation packet. The size of write access determines the
#               type of Instrumentation packet generated.
.equ	M33_ITM_STIM19_STIMULUS_RESET, 0x00000000
.equ	M33_ITM_STIM19_STIMULUS_BITS, 0xffffffff
.equ	M33_ITM_STIM19_STIMULUS_MSB, 31
.equ	M33_ITM_STIM19_STIMULUS_LSB, 0
# =============================================================================
# Register    : M33_ITM_STIM20
# Description : Provides the interface for generating Instrumentation packets
.equ	M33_ITM_STIM20_OFFSET, 0x00000050
.equ	M33_ITM_STIM20_BITS, 0xffffffff
.equ	M33_ITM_STIM20_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_ITM_STIM20_STIMULUS
# Description : Data to write to the Stimulus Port FIFO, for forwarding as an
#               Instrumentation packet. The size of write access determines the
#               type of Instrumentation packet generated.
.equ	M33_ITM_STIM20_STIMULUS_RESET, 0x00000000
.equ	M33_ITM_STIM20_STIMULUS_BITS, 0xffffffff
.equ	M33_ITM_STIM20_STIMULUS_MSB, 31
.equ	M33_ITM_STIM20_STIMULUS_LSB, 0
# =============================================================================
# Register    : M33_ITM_STIM21
# Description : Provides the interface for generating Instrumentation packets
.equ	M33_ITM_STIM21_OFFSET, 0x00000054
.equ	M33_ITM_STIM21_BITS, 0xffffffff
.equ	M33_ITM_STIM21_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_ITM_STIM21_STIMULUS
# Description : Data to write to the Stimulus Port FIFO, for forwarding as an
#               Instrumentation packet. The size of write access determines the
#               type of Instrumentation packet generated.
.equ	M33_ITM_STIM21_STIMULUS_RESET, 0x00000000
.equ	M33_ITM_STIM21_STIMULUS_BITS, 0xffffffff
.equ	M33_ITM_STIM21_STIMULUS_MSB, 31
.equ	M33_ITM_STIM21_STIMULUS_LSB, 0
# =============================================================================
# Register    : M33_ITM_STIM22
# Description : Provides the interface for generating Instrumentation packets
.equ	M33_ITM_STIM22_OFFSET, 0x00000058
.equ	M33_ITM_STIM22_BITS, 0xffffffff
.equ	M33_ITM_STIM22_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_ITM_STIM22_STIMULUS
# Description : Data to write to the Stimulus Port FIFO, for forwarding as an
#               Instrumentation packet. The size of write access determines the
#               type of Instrumentation packet generated.
.equ	M33_ITM_STIM22_STIMULUS_RESET, 0x00000000
.equ	M33_ITM_STIM22_STIMULUS_BITS, 0xffffffff
.equ	M33_ITM_STIM22_STIMULUS_MSB, 31
.equ	M33_ITM_STIM22_STIMULUS_LSB, 0
# =============================================================================
# Register    : M33_ITM_STIM23
# Description : Provides the interface for generating Instrumentation packets
.equ	M33_ITM_STIM23_OFFSET, 0x0000005c
.equ	M33_ITM_STIM23_BITS, 0xffffffff
.equ	M33_ITM_STIM23_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_ITM_STIM23_STIMULUS
# Description : Data to write to the Stimulus Port FIFO, for forwarding as an
#               Instrumentation packet. The size of write access determines the
#               type of Instrumentation packet generated.
.equ	M33_ITM_STIM23_STIMULUS_RESET, 0x00000000
.equ	M33_ITM_STIM23_STIMULUS_BITS, 0xffffffff
.equ	M33_ITM_STIM23_STIMULUS_MSB, 31
.equ	M33_ITM_STIM23_STIMULUS_LSB, 0
# =============================================================================
# Register    : M33_ITM_STIM24
# Description : Provides the interface for generating Instrumentation packets
.equ	M33_ITM_STIM24_OFFSET, 0x00000060
.equ	M33_ITM_STIM24_BITS, 0xffffffff
.equ	M33_ITM_STIM24_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_ITM_STIM24_STIMULUS
# Description : Data to write to the Stimulus Port FIFO, for forwarding as an
#               Instrumentation packet. The size of write access determines the
#               type of Instrumentation packet generated.
.equ	M33_ITM_STIM24_STIMULUS_RESET, 0x00000000
.equ	M33_ITM_STIM24_STIMULUS_BITS, 0xffffffff
.equ	M33_ITM_STIM24_STIMULUS_MSB, 31
.equ	M33_ITM_STIM24_STIMULUS_LSB, 0
# =============================================================================
# Register    : M33_ITM_STIM25
# Description : Provides the interface for generating Instrumentation packets
.equ	M33_ITM_STIM25_OFFSET, 0x00000064
.equ	M33_ITM_STIM25_BITS, 0xffffffff
.equ	M33_ITM_STIM25_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_ITM_STIM25_STIMULUS
# Description : Data to write to the Stimulus Port FIFO, for forwarding as an
#               Instrumentation packet. The size of write access determines the
#               type of Instrumentation packet generated.
.equ	M33_ITM_STIM25_STIMULUS_RESET, 0x00000000
.equ	M33_ITM_STIM25_STIMULUS_BITS, 0xffffffff
.equ	M33_ITM_STIM25_STIMULUS_MSB, 31
.equ	M33_ITM_STIM25_STIMULUS_LSB, 0
# =============================================================================
# Register    : M33_ITM_STIM26
# Description : Provides the interface for generating Instrumentation packets
.equ	M33_ITM_STIM26_OFFSET, 0x00000068
.equ	M33_ITM_STIM26_BITS, 0xffffffff
.equ	M33_ITM_STIM26_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_ITM_STIM26_STIMULUS
# Description : Data to write to the Stimulus Port FIFO, for forwarding as an
#               Instrumentation packet. The size of write access determines the
#               type of Instrumentation packet generated.
.equ	M33_ITM_STIM26_STIMULUS_RESET, 0x00000000
.equ	M33_ITM_STIM26_STIMULUS_BITS, 0xffffffff
.equ	M33_ITM_STIM26_STIMULUS_MSB, 31
.equ	M33_ITM_STIM26_STIMULUS_LSB, 0
# =============================================================================
# Register    : M33_ITM_STIM27
# Description : Provides the interface for generating Instrumentation packets
.equ	M33_ITM_STIM27_OFFSET, 0x0000006c
.equ	M33_ITM_STIM27_BITS, 0xffffffff
.equ	M33_ITM_STIM27_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_ITM_STIM27_STIMULUS
# Description : Data to write to the Stimulus Port FIFO, for forwarding as an
#               Instrumentation packet. The size of write access determines the
#               type of Instrumentation packet generated.
.equ	M33_ITM_STIM27_STIMULUS_RESET, 0x00000000
.equ	M33_ITM_STIM27_STIMULUS_BITS, 0xffffffff
.equ	M33_ITM_STIM27_STIMULUS_MSB, 31
.equ	M33_ITM_STIM27_STIMULUS_LSB, 0
# =============================================================================
# Register    : M33_ITM_STIM28
# Description : Provides the interface for generating Instrumentation packets
.equ	M33_ITM_STIM28_OFFSET, 0x00000070
.equ	M33_ITM_STIM28_BITS, 0xffffffff
.equ	M33_ITM_STIM28_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_ITM_STIM28_STIMULUS
# Description : Data to write to the Stimulus Port FIFO, for forwarding as an
#               Instrumentation packet. The size of write access determines the
#               type of Instrumentation packet generated.
.equ	M33_ITM_STIM28_STIMULUS_RESET, 0x00000000
.equ	M33_ITM_STIM28_STIMULUS_BITS, 0xffffffff
.equ	M33_ITM_STIM28_STIMULUS_MSB, 31
.equ	M33_ITM_STIM28_STIMULUS_LSB, 0
# =============================================================================
# Register    : M33_ITM_STIM29
