konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/m33.inc
# Description : Provides the interface for generating Instrumentation packets
.equ	M33_ITM_STIM29_OFFSET, 0x00000074
.equ	M33_ITM_STIM29_BITS, 0xffffffff
.equ	M33_ITM_STIM29_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_ITM_STIM29_STIMULUS
# Description : Data to write to the Stimulus Port FIFO, for forwarding as an
#               Instrumentation packet. The size of write access determines the
#               type of Instrumentation packet generated.
.equ	M33_ITM_STIM29_STIMULUS_RESET, 0x00000000
.equ	M33_ITM_STIM29_STIMULUS_BITS, 0xffffffff
.equ	M33_ITM_STIM29_STIMULUS_MSB, 31
.equ	M33_ITM_STIM29_STIMULUS_LSB, 0
# =============================================================================
# Register    : M33_ITM_STIM30
# Description : Provides the interface for generating Instrumentation packets
.equ	M33_ITM_STIM30_OFFSET, 0x00000078
.equ	M33_ITM_STIM30_BITS, 0xffffffff
.equ	M33_ITM_STIM30_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_ITM_STIM30_STIMULUS
# Description : Data to write to the Stimulus Port FIFO, for forwarding as an
#               Instrumentation packet. The size of write access determines the
#               type of Instrumentation packet generated.
.equ	M33_ITM_STIM30_STIMULUS_RESET, 0x00000000
.equ	M33_ITM_STIM30_STIMULUS_BITS, 0xffffffff
.equ	M33_ITM_STIM30_STIMULUS_MSB, 31
.equ	M33_ITM_STIM30_STIMULUS_LSB, 0
# =============================================================================
# Register    : M33_ITM_STIM31
# Description : Provides the interface for generating Instrumentation packets
.equ	M33_ITM_STIM31_OFFSET, 0x0000007c
.equ	M33_ITM_STIM31_BITS, 0xffffffff
.equ	M33_ITM_STIM31_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_ITM_STIM31_STIMULUS
# Description : Data to write to the Stimulus Port FIFO, for forwarding as an
#               Instrumentation packet. The size of write access determines the
#               type of Instrumentation packet generated.
.equ	M33_ITM_STIM31_STIMULUS_RESET, 0x00000000
.equ	M33_ITM_STIM31_STIMULUS_BITS, 0xffffffff
.equ	M33_ITM_STIM31_STIMULUS_MSB, 31
.equ	M33_ITM_STIM31_STIMULUS_LSB, 0
# =============================================================================
# Register    : M33_ITM_TER0
# Description : Provide an individual enable bit for each ITM_STIM register
.equ	M33_ITM_TER0_OFFSET, 0x00000e00
.equ	M33_ITM_TER0_BITS, 0xffffffff
.equ	M33_ITM_TER0_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_ITM_TER0_STIMENA
# Description : For STIMENA[m] in ITM_TER*n, controls whether ITM_STIM(32*n +
#               m) is enabled
.equ	M33_ITM_TER0_STIMENA_RESET, 0x00000000
.equ	M33_ITM_TER0_STIMENA_BITS, 0xffffffff
.equ	M33_ITM_TER0_STIMENA_MSB, 31
.equ	M33_ITM_TER0_STIMENA_LSB, 0
# =============================================================================
# Register    : M33_ITM_TPR
# Description : Controls which stimulus ports can be accessed by unprivileged
#               code
.equ	M33_ITM_TPR_OFFSET, 0x00000e40
.equ	M33_ITM_TPR_BITS, 0x0000000f
.equ	M33_ITM_TPR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_ITM_TPR_PRIVMASK
# Description : Bit mask to enable tracing on ITM stimulus ports
.equ	M33_ITM_TPR_PRIVMASK_RESET, 0x0
.equ	M33_ITM_TPR_PRIVMASK_BITS, 0x0000000f
.equ	M33_ITM_TPR_PRIVMASK_MSB, 3
.equ	M33_ITM_TPR_PRIVMASK_LSB, 0
# =============================================================================
# Register    : M33_ITM_TCR
# Description : Configures and controls transfers through the ITM interface
.equ	M33_ITM_TCR_OFFSET, 0x00000e80
.equ	M33_ITM_TCR_BITS, 0x00ff0f3f
.equ	M33_ITM_TCR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_ITM_TCR_BUSY
# Description : Indicates whether the ITM is currently processing events
.equ	M33_ITM_TCR_BUSY_RESET, 0x0
.equ	M33_ITM_TCR_BUSY_BITS, 0x00800000
.equ	M33_ITM_TCR_BUSY_MSB, 23
.equ	M33_ITM_TCR_BUSY_LSB, 23
# -----------------------------------------------------------------------------
# Field       : M33_ITM_TCR_TRACEBUSID
# Description : Identifier for multi-source trace stream formatting. If multi-
#               source trace is in use, the debugger must write a unique non-
#               zero trace ID value to this field
.equ	M33_ITM_TCR_TRACEBUSID_RESET, 0x00
.equ	M33_ITM_TCR_TRACEBUSID_BITS, 0x007f0000
.equ	M33_ITM_TCR_TRACEBUSID_MSB, 22
.equ	M33_ITM_TCR_TRACEBUSID_LSB, 16
# -----------------------------------------------------------------------------
# Field       : M33_ITM_TCR_GTSFREQ
# Description : Defines how often the ITM generates a global timestamp, based
#               on the global timestamp clock frequency, or disables generation
#               of global timestamps
.equ	M33_ITM_TCR_GTSFREQ_RESET, 0x0
.equ	M33_ITM_TCR_GTSFREQ_BITS, 0x00000c00
.equ	M33_ITM_TCR_GTSFREQ_MSB, 11
.equ	M33_ITM_TCR_GTSFREQ_LSB, 10
# -----------------------------------------------------------------------------
# Field       : M33_ITM_TCR_TSPRESCALE
# Description : Local timestamp prescaler, used with the trace packet reference
#               clock
.equ	M33_ITM_TCR_TSPRESCALE_RESET, 0x0
.equ	M33_ITM_TCR_TSPRESCALE_BITS, 0x00000300
.equ	M33_ITM_TCR_TSPRESCALE_MSB, 9
.equ	M33_ITM_TCR_TSPRESCALE_LSB, 8
# -----------------------------------------------------------------------------
# Field       : M33_ITM_TCR_STALLENA
# Description : Stall the PE to guarantee delivery of Data Trace packets.
.equ	M33_ITM_TCR_STALLENA_RESET, 0x0
.equ	M33_ITM_TCR_STALLENA_BITS, 0x00000020
.equ	M33_ITM_TCR_STALLENA_MSB, 5
.equ	M33_ITM_TCR_STALLENA_LSB, 5
# -----------------------------------------------------------------------------
# Field       : M33_ITM_TCR_SWOENA
# Description : Enables asynchronous clocking of the timestamp counter
.equ	M33_ITM_TCR_SWOENA_RESET, 0x0
.equ	M33_ITM_TCR_SWOENA_BITS, 0x00000010
.equ	M33_ITM_TCR_SWOENA_MSB, 4
.equ	M33_ITM_TCR_SWOENA_LSB, 4
# -----------------------------------------------------------------------------
# Field       : M33_ITM_TCR_TXENA
# Description : Enables forwarding of hardware event packet from the DWT unit
#               to the ITM for output to the TPIU
.equ	M33_ITM_TCR_TXENA_RESET, 0x0
.equ	M33_ITM_TCR_TXENA_BITS, 0x00000008
.equ	M33_ITM_TCR_TXENA_MSB, 3
.equ	M33_ITM_TCR_TXENA_LSB, 3
# -----------------------------------------------------------------------------
# Field       : M33_ITM_TCR_SYNCENA
# Description : Enables Synchronization packet transmission for a synchronous
#               TPIU
.equ	M33_ITM_TCR_SYNCENA_RESET, 0x0
.equ	M33_ITM_TCR_SYNCENA_BITS, 0x00000004
.equ	M33_ITM_TCR_SYNCENA_MSB, 2
.equ	M33_ITM_TCR_SYNCENA_LSB, 2
# -----------------------------------------------------------------------------
# Field       : M33_ITM_TCR_TSENA
# Description : Enables Local timestamp generation
.equ	M33_ITM_TCR_TSENA_RESET, 0x0
.equ	M33_ITM_TCR_TSENA_BITS, 0x00000002
.equ	M33_ITM_TCR_TSENA_MSB, 1
.equ	M33_ITM_TCR_TSENA_LSB, 1
# -----------------------------------------------------------------------------
# Field       : M33_ITM_TCR_ITMENA
# Description : Enables the ITM
.equ	M33_ITM_TCR_ITMENA_RESET, 0x0
.equ	M33_ITM_TCR_ITMENA_BITS, 0x00000001
.equ	M33_ITM_TCR_ITMENA_MSB, 0
.equ	M33_ITM_TCR_ITMENA_LSB, 0
# =============================================================================
# Register    : M33_INT_ATREADY
# Description : Integration Mode: Read ATB Ready
.equ	M33_INT_ATREADY_OFFSET, 0x00000ef0
.equ	M33_INT_ATREADY_BITS, 0x00000003
.equ	M33_INT_ATREADY_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_INT_ATREADY_AFVALID
# Description : A read of this bit returns the value of AFVALID
.equ	M33_INT_ATREADY_AFVALID_RESET, 0x0
.equ	M33_INT_ATREADY_AFVALID_BITS, 0x00000002
.equ	M33_INT_ATREADY_AFVALID_MSB, 1
.equ	M33_INT_ATREADY_AFVALID_LSB, 1
# -----------------------------------------------------------------------------
# Field       : M33_INT_ATREADY_ATREADY
# Description : A read of this bit returns the value of ATREADY
.equ	M33_INT_ATREADY_ATREADY_RESET, 0x0
.equ	M33_INT_ATREADY_ATREADY_BITS, 0x00000001
.equ	M33_INT_ATREADY_ATREADY_MSB, 0
.equ	M33_INT_ATREADY_ATREADY_LSB, 0
# =============================================================================
# Register    : M33_INT_ATVALID
# Description : Integration Mode: Write ATB Valid
.equ	M33_INT_ATVALID_OFFSET, 0x00000ef8
.equ	M33_INT_ATVALID_BITS, 0x00000003
.equ	M33_INT_ATVALID_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_INT_ATVALID_AFREADY
# Description : A write to this bit gives the value of AFREADY
.equ	M33_INT_ATVALID_AFREADY_RESET, 0x0
.equ	M33_INT_ATVALID_AFREADY_BITS, 0x00000002
.equ	M33_INT_ATVALID_AFREADY_MSB, 1
.equ	M33_INT_ATVALID_AFREADY_LSB, 1
# -----------------------------------------------------------------------------
# Field       : M33_INT_ATVALID_ATREADY
# Description : A write to this bit gives the value of ATVALID
.equ	M33_INT_ATVALID_ATREADY_RESET, 0x0
.equ	M33_INT_ATVALID_ATREADY_BITS, 0x00000001
.equ	M33_INT_ATVALID_ATREADY_MSB, 0
.equ	M33_INT_ATVALID_ATREADY_LSB, 0
# =============================================================================
# Register    : M33_ITM_ITCTRL
# Description : Integration Mode Control Register
.equ	M33_ITM_ITCTRL_OFFSET, 0x00000f00
.equ	M33_ITM_ITCTRL_BITS, 0x00000001
.equ	M33_ITM_ITCTRL_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_ITM_ITCTRL_IME
# Description : Integration mode enable bit - The possible values are:  0 - The
#               trace unit is not in integration mode. 1 - The trace unit is in
#               integration mode. This mode enables: A debug agent to perform
#               topology detection. SoC test software to perform integration
#               testing.
.equ	M33_ITM_ITCTRL_IME_RESET, 0x0
.equ	M33_ITM_ITCTRL_IME_BITS, 0x00000001
.equ	M33_ITM_ITCTRL_IME_MSB, 0
.equ	M33_ITM_ITCTRL_IME_LSB, 0
# =============================================================================
# Register    : M33_ITM_DEVARCH
# Description : Provides CoreSight discovery information for the ITM
.equ	M33_ITM_DEVARCH_OFFSET, 0x00000fbc
.equ	M33_ITM_DEVARCH_BITS, 0xffffffff
.equ	M33_ITM_DEVARCH_RESET, 0x47701a01
# -----------------------------------------------------------------------------
# Field       : M33_ITM_DEVARCH_ARCHITECT
# Description : Defines the architect of the component. Bits [31:28] are the
#               JEP106 continuation code (JEP106 bank ID, minus 1) and bits
#               [27:21] are the JEP106 ID code.
.equ	M33_ITM_DEVARCH_ARCHITECT_RESET, 0x23b
.equ	M33_ITM_DEVARCH_ARCHITECT_BITS, 0xffe00000
.equ	M33_ITM_DEVARCH_ARCHITECT_MSB, 31
.equ	M33_ITM_DEVARCH_ARCHITECT_LSB, 21
# -----------------------------------------------------------------------------
# Field       : M33_ITM_DEVARCH_PRESENT
# Description : Defines that the DEVARCH register is present
.equ	M33_ITM_DEVARCH_PRESENT_RESET, 0x1
.equ	M33_ITM_DEVARCH_PRESENT_BITS, 0x00100000
.equ	M33_ITM_DEVARCH_PRESENT_MSB, 20
.equ	M33_ITM_DEVARCH_PRESENT_LSB, 20
# -----------------------------------------------------------------------------
# Field       : M33_ITM_DEVARCH_REVISION
# Description : Defines the architecture revision of the component
.equ	M33_ITM_DEVARCH_REVISION_RESET, 0x0
.equ	M33_ITM_DEVARCH_REVISION_BITS, 0x000f0000
.equ	M33_ITM_DEVARCH_REVISION_MSB, 19
.equ	M33_ITM_DEVARCH_REVISION_LSB, 16
# -----------------------------------------------------------------------------
# Field       : M33_ITM_DEVARCH_ARCHVER
# Description : Defines the architecture version of the component
.equ	M33_ITM_DEVARCH_ARCHVER_RESET, 0x1
.equ	M33_ITM_DEVARCH_ARCHVER_BITS, 0x0000f000
.equ	M33_ITM_DEVARCH_ARCHVER_MSB, 15
.equ	M33_ITM_DEVARCH_ARCHVER_LSB, 12
# -----------------------------------------------------------------------------
# Field       : M33_ITM_DEVARCH_ARCHPART
# Description : Defines the architecture of the component
.equ	M33_ITM_DEVARCH_ARCHPART_RESET, 0xa01
.equ	M33_ITM_DEVARCH_ARCHPART_BITS, 0x00000fff
.equ	M33_ITM_DEVARCH_ARCHPART_MSB, 11
.equ	M33_ITM_DEVARCH_ARCHPART_LSB, 0
# =============================================================================
# Register    : M33_ITM_DEVTYPE
# Description : Provides CoreSight discovery information for the ITM
.equ	M33_ITM_DEVTYPE_OFFSET, 0x00000fcc
.equ	M33_ITM_DEVTYPE_BITS, 0x000000ff
.equ	M33_ITM_DEVTYPE_RESET, 0x00000043
# -----------------------------------------------------------------------------
# Field       : M33_ITM_DEVTYPE_SUB
# Description : Component sub-type
.equ	M33_ITM_DEVTYPE_SUB_RESET, 0x4
.equ	M33_ITM_DEVTYPE_SUB_BITS, 0x000000f0
.equ	M33_ITM_DEVTYPE_SUB_MSB, 7
.equ	M33_ITM_DEVTYPE_SUB_LSB, 4
# -----------------------------------------------------------------------------
# Field       : M33_ITM_DEVTYPE_MAJOR
# Description : Component major type
.equ	M33_ITM_DEVTYPE_MAJOR_RESET, 0x3
.equ	M33_ITM_DEVTYPE_MAJOR_BITS, 0x0000000f
.equ	M33_ITM_DEVTYPE_MAJOR_MSB, 3
.equ	M33_ITM_DEVTYPE_MAJOR_LSB, 0
# =============================================================================
# Register    : M33_ITM_PIDR4
# Description : Provides CoreSight discovery information for the ITM
.equ	M33_ITM_PIDR4_OFFSET, 0x00000fd0
.equ	M33_ITM_PIDR4_BITS, 0x000000ff
.equ	M33_ITM_PIDR4_RESET, 0x00000004
# -----------------------------------------------------------------------------
# Field       : M33_ITM_PIDR4_SIZE
# Description : See CoreSight Architecture Specification
.equ	M33_ITM_PIDR4_SIZE_RESET, 0x0
.equ	M33_ITM_PIDR4_SIZE_BITS, 0x000000f0
.equ	M33_ITM_PIDR4_SIZE_MSB, 7
.equ	M33_ITM_PIDR4_SIZE_LSB, 4
# -----------------------------------------------------------------------------
# Field       : M33_ITM_PIDR4_DES_2
# Description : See CoreSight Architecture Specification
.equ	M33_ITM_PIDR4_DES_2_RESET, 0x4
.equ	M33_ITM_PIDR4_DES_2_BITS, 0x0000000f
.equ	M33_ITM_PIDR4_DES_2_MSB, 3
.equ	M33_ITM_PIDR4_DES_2_LSB, 0
# =============================================================================
# Register    : M33_ITM_PIDR5
# Description : Provides CoreSight discovery information for the ITM
.equ	M33_ITM_PIDR5_OFFSET, 0x00000fd4
.equ	M33_ITM_PIDR5_BITS, 0x00000000
.equ	M33_ITM_PIDR5_RESET, 0x00000000
.equ	M33_ITM_PIDR5_MSB, 31
.equ	M33_ITM_PIDR5_LSB, 0
# =============================================================================
# Register    : M33_ITM_PIDR6
# Description : Provides CoreSight discovery information for the ITM
.equ	M33_ITM_PIDR6_OFFSET, 0x00000fd8
.equ	M33_ITM_PIDR6_BITS, 0x00000000
.equ	M33_ITM_PIDR6_RESET, 0x00000000
.equ	M33_ITM_PIDR6_MSB, 31
.equ	M33_ITM_PIDR6_LSB, 0
# =============================================================================
# Register    : M33_ITM_PIDR7
# Description : Provides CoreSight discovery information for the ITM
.equ	M33_ITM_PIDR7_OFFSET, 0x00000fdc
.equ	M33_ITM_PIDR7_BITS, 0x00000000
.equ	M33_ITM_PIDR7_RESET, 0x00000000
.equ	M33_ITM_PIDR7_MSB, 31
.equ	M33_ITM_PIDR7_LSB, 0
# =============================================================================
# Register    : M33_ITM_PIDR0
# Description : Provides CoreSight discovery information for the ITM
.equ	M33_ITM_PIDR0_OFFSET, 0x00000fe0
.equ	M33_ITM_PIDR0_BITS, 0x000000ff
.equ	M33_ITM_PIDR0_RESET, 0x00000021
# -----------------------------------------------------------------------------
# Field       : M33_ITM_PIDR0_PART_0
# Description : See CoreSight Architecture Specification
.equ	M33_ITM_PIDR0_PART_0_RESET, 0x21
.equ	M33_ITM_PIDR0_PART_0_BITS, 0x000000ff
.equ	M33_ITM_PIDR0_PART_0_MSB, 7
.equ	M33_ITM_PIDR0_PART_0_LSB, 0
# =============================================================================
# Register    : M33_ITM_PIDR1
# Description : Provides CoreSight discovery information for the ITM
.equ	M33_ITM_PIDR1_OFFSET, 0x00000fe4
.equ	M33_ITM_PIDR1_BITS, 0x000000ff
.equ	M33_ITM_PIDR1_RESET, 0x000000bd
# -----------------------------------------------------------------------------
# Field       : M33_ITM_PIDR1_DES_0
# Description : See CoreSight Architecture Specification
.equ	M33_ITM_PIDR1_DES_0_RESET, 0xb
.equ	M33_ITM_PIDR1_DES_0_BITS, 0x000000f0
.equ	M33_ITM_PIDR1_DES_0_MSB, 7
.equ	M33_ITM_PIDR1_DES_0_LSB, 4
# -----------------------------------------------------------------------------
# Field       : M33_ITM_PIDR1_PART_1
# Description : See CoreSight Architecture Specification
.equ	M33_ITM_PIDR1_PART_1_RESET, 0xd
.equ	M33_ITM_PIDR1_PART_1_BITS, 0x0000000f
.equ	M33_ITM_PIDR1_PART_1_MSB, 3
.equ	M33_ITM_PIDR1_PART_1_LSB, 0
# =============================================================================
# Register    : M33_ITM_PIDR2
# Description : Provides CoreSight discovery information for the ITM
.equ	M33_ITM_PIDR2_OFFSET, 0x00000fe8
.equ	M33_ITM_PIDR2_BITS, 0x000000ff
.equ	M33_ITM_PIDR2_RESET, 0x0000000b
# -----------------------------------------------------------------------------
# Field       : M33_ITM_PIDR2_REVISION
# Description : See CoreSight Architecture Specification
.equ	M33_ITM_PIDR2_REVISION_RESET, 0x0
.equ	M33_ITM_PIDR2_REVISION_BITS, 0x000000f0
.equ	M33_ITM_PIDR2_REVISION_MSB, 7
.equ	M33_ITM_PIDR2_REVISION_LSB, 4
# -----------------------------------------------------------------------------
# Field       : M33_ITM_PIDR2_JEDEC
# Description : See CoreSight Architecture Specification
.equ	M33_ITM_PIDR2_JEDEC_RESET, 0x1
.equ	M33_ITM_PIDR2_JEDEC_BITS, 0x00000008
.equ	M33_ITM_PIDR2_JEDEC_MSB, 3
.equ	M33_ITM_PIDR2_JEDEC_LSB, 3
# -----------------------------------------------------------------------------
# Field       : M33_ITM_PIDR2_DES_1
# Description : See CoreSight Architecture Specification
.equ	M33_ITM_PIDR2_DES_1_RESET, 0x3
.equ	M33_ITM_PIDR2_DES_1_BITS, 0x00000007
.equ	M33_ITM_PIDR2_DES_1_MSB, 2
.equ	M33_ITM_PIDR2_DES_1_LSB, 0
# =============================================================================
# Register    : M33_ITM_PIDR3
# Description : Provides CoreSight discovery information for the ITM
.equ	M33_ITM_PIDR3_OFFSET, 0x00000fec
.equ	M33_ITM_PIDR3_BITS, 0x000000ff
.equ	M33_ITM_PIDR3_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_ITM_PIDR3_REVAND
# Description : See CoreSight Architecture Specification
.equ	M33_ITM_PIDR3_REVAND_RESET, 0x0
.equ	M33_ITM_PIDR3_REVAND_BITS, 0x000000f0
.equ	M33_ITM_PIDR3_REVAND_MSB, 7
.equ	M33_ITM_PIDR3_REVAND_LSB, 4
# -----------------------------------------------------------------------------
# Field       : M33_ITM_PIDR3_CMOD
# Description : See CoreSight Architecture Specification
.equ	M33_ITM_PIDR3_CMOD_RESET, 0x0
.equ	M33_ITM_PIDR3_CMOD_BITS, 0x0000000f
.equ	M33_ITM_PIDR3_CMOD_MSB, 3
.equ	M33_ITM_PIDR3_CMOD_LSB, 0
# =============================================================================
# Register    : M33_ITM_CIDR0
# Description : Provides CoreSight discovery information for the ITM
.equ	M33_ITM_CIDR0_OFFSET, 0x00000ff0
.equ	M33_ITM_CIDR0_BITS, 0x000000ff
.equ	M33_ITM_CIDR0_RESET, 0x0000000d
# -----------------------------------------------------------------------------
# Field       : M33_ITM_CIDR0_PRMBL_0
# Description : See CoreSight Architecture Specification
.equ	M33_ITM_CIDR0_PRMBL_0_RESET, 0x0d
.equ	M33_ITM_CIDR0_PRMBL_0_BITS, 0x000000ff
.equ	M33_ITM_CIDR0_PRMBL_0_MSB, 7
.equ	M33_ITM_CIDR0_PRMBL_0_LSB, 0
# =============================================================================
# Register    : M33_ITM_CIDR1
# Description : Provides CoreSight discovery information for the ITM
.equ	M33_ITM_CIDR1_OFFSET, 0x00000ff4
.equ	M33_ITM_CIDR1_BITS, 0x000000ff
.equ	M33_ITM_CIDR1_RESET, 0x00000090
# -----------------------------------------------------------------------------
# Field       : M33_ITM_CIDR1_CLASS
# Description : See CoreSight Architecture Specification
.equ	M33_ITM_CIDR1_CLASS_RESET, 0x9
.equ	M33_ITM_CIDR1_CLASS_BITS, 0x000000f0
.equ	M33_ITM_CIDR1_CLASS_MSB, 7
.equ	M33_ITM_CIDR1_CLASS_LSB, 4
# -----------------------------------------------------------------------------
# Field       : M33_ITM_CIDR1_PRMBL_1
# Description : See CoreSight Architecture Specification
.equ	M33_ITM_CIDR1_PRMBL_1_RESET, 0x0
.equ	M33_ITM_CIDR1_PRMBL_1_BITS, 0x0000000f
.equ	M33_ITM_CIDR1_PRMBL_1_MSB, 3
.equ	M33_ITM_CIDR1_PRMBL_1_LSB, 0
# =============================================================================
# Register    : M33_ITM_CIDR2
# Description : Provides CoreSight discovery information for the ITM
.equ	M33_ITM_CIDR2_OFFSET, 0x00000ff8
.equ	M33_ITM_CIDR2_BITS, 0x000000ff
.equ	M33_ITM_CIDR2_RESET, 0x00000005
# -----------------------------------------------------------------------------
# Field       : M33_ITM_CIDR2_PRMBL_2
# Description : See CoreSight Architecture Specification
.equ	M33_ITM_CIDR2_PRMBL_2_RESET, 0x05
.equ	M33_ITM_CIDR2_PRMBL_2_BITS, 0x000000ff
.equ	M33_ITM_CIDR2_PRMBL_2_MSB, 7
.equ	M33_ITM_CIDR2_PRMBL_2_LSB, 0
# =============================================================================
# Register    : M33_ITM_CIDR3
# Description : Provides CoreSight discovery information for the ITM
.equ	M33_ITM_CIDR3_OFFSET, 0x00000ffc
.equ	M33_ITM_CIDR3_BITS, 0x000000ff
.equ	M33_ITM_CIDR3_RESET, 0x000000b1
# -----------------------------------------------------------------------------
# Field       : M33_ITM_CIDR3_PRMBL_3
# Description : See CoreSight Architecture Specification
.equ	M33_ITM_CIDR3_PRMBL_3_RESET, 0xb1
.equ	M33_ITM_CIDR3_PRMBL_3_BITS, 0x000000ff
.equ	M33_ITM_CIDR3_PRMBL_3_MSB, 7
.equ	M33_ITM_CIDR3_PRMBL_3_LSB, 0
# =============================================================================
# Register    : M33_DWT_CTRL
# Description : Provides configuration and status information for the DWT unit,
#               and used to control features of the unit
.equ	M33_DWT_CTRL_OFFSET, 0x00001000
.equ	M33_DWT_CTRL_BITS, 0xffff1fff
.equ	M33_DWT_CTRL_RESET, 0x73741824
# -----------------------------------------------------------------------------
# Field       : M33_DWT_CTRL_NUMCOMP
# Description : Number of DWT comparators implemented
.equ	M33_DWT_CTRL_NUMCOMP_RESET, 0x7
.equ	M33_DWT_CTRL_NUMCOMP_BITS, 0xf0000000
.equ	M33_DWT_CTRL_NUMCOMP_MSB, 31
.equ	M33_DWT_CTRL_NUMCOMP_LSB, 28
# -----------------------------------------------------------------------------
# Field       : M33_DWT_CTRL_NOTRCPKT
# Description : Indicates whether the implementation does not support trace
.equ	M33_DWT_CTRL_NOTRCPKT_RESET, 0x0
.equ	M33_DWT_CTRL_NOTRCPKT_BITS, 0x08000000
.equ	M33_DWT_CTRL_NOTRCPKT_MSB, 27
.equ	M33_DWT_CTRL_NOTRCPKT_LSB, 27
# -----------------------------------------------------------------------------
# Field       : M33_DWT_CTRL_NOEXTTRIG
# Description : Reserved, RAZ
.equ	M33_DWT_CTRL_NOEXTTRIG_RESET, 0x0
.equ	M33_DWT_CTRL_NOEXTTRIG_BITS, 0x04000000
.equ	M33_DWT_CTRL_NOEXTTRIG_MSB, 26
.equ	M33_DWT_CTRL_NOEXTTRIG_LSB, 26
# -----------------------------------------------------------------------------
# Field       : M33_DWT_CTRL_NOCYCCNT
# Description : Indicates whether the implementation does not include a cycle
#               counter
.equ	M33_DWT_CTRL_NOCYCCNT_RESET, 0x1
.equ	M33_DWT_CTRL_NOCYCCNT_BITS, 0x02000000
.equ	M33_DWT_CTRL_NOCYCCNT_MSB, 25
.equ	M33_DWT_CTRL_NOCYCCNT_LSB, 25
# -----------------------------------------------------------------------------
# Field       : M33_DWT_CTRL_NOPRFCNT
# Description : Indicates whether the implementation does not include the
#               profiling counters
.equ	M33_DWT_CTRL_NOPRFCNT_RESET, 0x1
.equ	M33_DWT_CTRL_NOPRFCNT_BITS, 0x01000000
.equ	M33_DWT_CTRL_NOPRFCNT_MSB, 24
.equ	M33_DWT_CTRL_NOPRFCNT_LSB, 24
# -----------------------------------------------------------------------------
# Field       : M33_DWT_CTRL_CYCDISS
