konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/m33.inc
# Description : Controls whether the cycle counter is disabled in Secure state
.equ	M33_DWT_CTRL_CYCDISS_RESET, 0x0
.equ	M33_DWT_CTRL_CYCDISS_BITS, 0x00800000
.equ	M33_DWT_CTRL_CYCDISS_MSB, 23
.equ	M33_DWT_CTRL_CYCDISS_LSB, 23
# -----------------------------------------------------------------------------
# Field       : M33_DWT_CTRL_CYCEVTENA
# Description : Enables Event Counter packet generation on POSTCNT underflow
.equ	M33_DWT_CTRL_CYCEVTENA_RESET, 0x1
.equ	M33_DWT_CTRL_CYCEVTENA_BITS, 0x00400000
.equ	M33_DWT_CTRL_CYCEVTENA_MSB, 22
.equ	M33_DWT_CTRL_CYCEVTENA_LSB, 22
# -----------------------------------------------------------------------------
# Field       : M33_DWT_CTRL_FOLDEVTENA
# Description : Enables DWT_FOLDCNT counter
.equ	M33_DWT_CTRL_FOLDEVTENA_RESET, 0x1
.equ	M33_DWT_CTRL_FOLDEVTENA_BITS, 0x00200000
.equ	M33_DWT_CTRL_FOLDEVTENA_MSB, 21
.equ	M33_DWT_CTRL_FOLDEVTENA_LSB, 21
# -----------------------------------------------------------------------------
# Field       : M33_DWT_CTRL_LSUEVTENA
# Description : Enables DWT_LSUCNT counter
.equ	M33_DWT_CTRL_LSUEVTENA_RESET, 0x1
.equ	M33_DWT_CTRL_LSUEVTENA_BITS, 0x00100000
.equ	M33_DWT_CTRL_LSUEVTENA_MSB, 20
.equ	M33_DWT_CTRL_LSUEVTENA_LSB, 20
# -----------------------------------------------------------------------------
# Field       : M33_DWT_CTRL_SLEEPEVTENA
# Description : Enable DWT_SLEEPCNT counter
.equ	M33_DWT_CTRL_SLEEPEVTENA_RESET, 0x0
.equ	M33_DWT_CTRL_SLEEPEVTENA_BITS, 0x00080000
.equ	M33_DWT_CTRL_SLEEPEVTENA_MSB, 19
.equ	M33_DWT_CTRL_SLEEPEVTENA_LSB, 19
# -----------------------------------------------------------------------------
# Field       : M33_DWT_CTRL_EXCEVTENA
# Description : Enables DWT_EXCCNT counter
.equ	M33_DWT_CTRL_EXCEVTENA_RESET, 0x1
.equ	M33_DWT_CTRL_EXCEVTENA_BITS, 0x00040000
.equ	M33_DWT_CTRL_EXCEVTENA_MSB, 18
.equ	M33_DWT_CTRL_EXCEVTENA_LSB, 18
# -----------------------------------------------------------------------------
# Field       : M33_DWT_CTRL_CPIEVTENA
# Description : Enables DWT_CPICNT counter
.equ	M33_DWT_CTRL_CPIEVTENA_RESET, 0x0
.equ	M33_DWT_CTRL_CPIEVTENA_BITS, 0x00020000
.equ	M33_DWT_CTRL_CPIEVTENA_MSB, 17
.equ	M33_DWT_CTRL_CPIEVTENA_LSB, 17
# -----------------------------------------------------------------------------
# Field       : M33_DWT_CTRL_EXTTRCENA
# Description : Enables generation of Exception Trace packets
.equ	M33_DWT_CTRL_EXTTRCENA_RESET, 0x0
.equ	M33_DWT_CTRL_EXTTRCENA_BITS, 0x00010000
.equ	M33_DWT_CTRL_EXTTRCENA_MSB, 16
.equ	M33_DWT_CTRL_EXTTRCENA_LSB, 16
# -----------------------------------------------------------------------------
# Field       : M33_DWT_CTRL_PCSAMPLENA
# Description : Enables use of POSTCNT counter as a timer for Periodic PC
#               Sample packet generation
.equ	M33_DWT_CTRL_PCSAMPLENA_RESET, 0x1
.equ	M33_DWT_CTRL_PCSAMPLENA_BITS, 0x00001000
.equ	M33_DWT_CTRL_PCSAMPLENA_MSB, 12
.equ	M33_DWT_CTRL_PCSAMPLENA_LSB, 12
# -----------------------------------------------------------------------------
# Field       : M33_DWT_CTRL_SYNCTAP
# Description : Selects the position of the synchronization packet counter tap
#               on the CYCCNT counter. This determines the Synchronization
#               packet rate
.equ	M33_DWT_CTRL_SYNCTAP_RESET, 0x2
.equ	M33_DWT_CTRL_SYNCTAP_BITS, 0x00000c00
.equ	M33_DWT_CTRL_SYNCTAP_MSB, 11
.equ	M33_DWT_CTRL_SYNCTAP_LSB, 10
# -----------------------------------------------------------------------------
# Field       : M33_DWT_CTRL_CYCTAP
# Description : Selects the position of the POSTCNT tap on the CYCCNT counter
.equ	M33_DWT_CTRL_CYCTAP_RESET, 0x0
.equ	M33_DWT_CTRL_CYCTAP_BITS, 0x00000200
.equ	M33_DWT_CTRL_CYCTAP_MSB, 9
.equ	M33_DWT_CTRL_CYCTAP_LSB, 9
# -----------------------------------------------------------------------------
# Field       : M33_DWT_CTRL_POSTINIT
# Description : Initial value for the POSTCNT counter
.equ	M33_DWT_CTRL_POSTINIT_RESET, 0x1
.equ	M33_DWT_CTRL_POSTINIT_BITS, 0x000001e0
.equ	M33_DWT_CTRL_POSTINIT_MSB, 8
.equ	M33_DWT_CTRL_POSTINIT_LSB, 5
# -----------------------------------------------------------------------------
# Field       : M33_DWT_CTRL_POSTPRESET
# Description : Reload value for the POSTCNT counter
.equ	M33_DWT_CTRL_POSTPRESET_RESET, 0x2
.equ	M33_DWT_CTRL_POSTPRESET_BITS, 0x0000001e
.equ	M33_DWT_CTRL_POSTPRESET_MSB, 4
.equ	M33_DWT_CTRL_POSTPRESET_LSB, 1
# -----------------------------------------------------------------------------
# Field       : M33_DWT_CTRL_CYCCNTENA
# Description : Enables CYCCNT
.equ	M33_DWT_CTRL_CYCCNTENA_RESET, 0x0
.equ	M33_DWT_CTRL_CYCCNTENA_BITS, 0x00000001
.equ	M33_DWT_CTRL_CYCCNTENA_MSB, 0
.equ	M33_DWT_CTRL_CYCCNTENA_LSB, 0
# =============================================================================
# Register    : M33_DWT_CYCCNT
# Description : Shows or sets the value of the processor cycle counter, CYCCNT
.equ	M33_DWT_CYCCNT_OFFSET, 0x00001004
.equ	M33_DWT_CYCCNT_BITS, 0xffffffff
.equ	M33_DWT_CYCCNT_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_DWT_CYCCNT_CYCCNT
# Description : Increments one on each processor clock cycle when
#               DWT_CTRL.CYCCNTENA == 1 and DEMCR.TRCENA == 1. On overflow,
#               CYCCNT wraps to zero
.equ	M33_DWT_CYCCNT_CYCCNT_RESET, 0x00000000
.equ	M33_DWT_CYCCNT_CYCCNT_BITS, 0xffffffff
.equ	M33_DWT_CYCCNT_CYCCNT_MSB, 31
.equ	M33_DWT_CYCCNT_CYCCNT_LSB, 0
# =============================================================================
# Register    : M33_DWT_EXCCNT
# Description : Counts the total cycles spent in exception processing
.equ	M33_DWT_EXCCNT_OFFSET, 0x0000100c
.equ	M33_DWT_EXCCNT_BITS, 0x000000ff
.equ	M33_DWT_EXCCNT_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_DWT_EXCCNT_EXCCNT
# Description : Counts one on each cycle when all of the following are true: -
#               DWT_CTRL.EXCEVTENA == 1 and DEMCR.TRCENA == 1. - No instruction
#               is executed, see DWT_CPICNT. - An exception-entry or exception-
#               exit related operation is in progress. - Either
#               SecureNoninvasiveDebugAllowed() == TRUE, or NS-Req for the
#               operation is set to Non-secure and NoninvasiveDebugAllowed() ==
#               TRUE.
.equ	M33_DWT_EXCCNT_EXCCNT_RESET, 0x00
.equ	M33_DWT_EXCCNT_EXCCNT_BITS, 0x000000ff
.equ	M33_DWT_EXCCNT_EXCCNT_MSB, 7
.equ	M33_DWT_EXCCNT_EXCCNT_LSB, 0
# =============================================================================
# Register    : M33_DWT_LSUCNT
# Description : Increments on the additional cycles required to execute all
#               load or store instructions
.equ	M33_DWT_LSUCNT_OFFSET, 0x00001014
.equ	M33_DWT_LSUCNT_BITS, 0x000000ff
.equ	M33_DWT_LSUCNT_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_DWT_LSUCNT_LSUCNT
# Description : Counts one on each cycle when all of the following are true: -
#               DWT_CTRL.LSUEVTENA == 1 and DEMCR.TRCENA == 1. - No instruction
#               is executed, see DWT_CPICNT. - No exception-entry or exception-
#               exit operation is in progress, see DWT_EXCCNT. - A load-store
#               operation is in progress. - Either
#               SecureNoninvasiveDebugAllowed() == TRUE, or NS-Req for the
#               operation is set to Non-secure and NoninvasiveDebugAllowed() ==
#               TRUE.
.equ	M33_DWT_LSUCNT_LSUCNT_RESET, 0x00
.equ	M33_DWT_LSUCNT_LSUCNT_BITS, 0x000000ff
.equ	M33_DWT_LSUCNT_LSUCNT_MSB, 7
.equ	M33_DWT_LSUCNT_LSUCNT_LSB, 0
# =============================================================================
# Register    : M33_DWT_FOLDCNT
# Description : Increments on the additional cycles required to execute all
#               load or store instructions
.equ	M33_DWT_FOLDCNT_OFFSET, 0x00001018
.equ	M33_DWT_FOLDCNT_BITS, 0x000000ff
.equ	M33_DWT_FOLDCNT_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_DWT_FOLDCNT_FOLDCNT
# Description : Counts on each cycle when all of the following are true: -
#               DWT_CTRL.FOLDEVTENA == 1 and DEMCR.TRCENA == 1. - At least two
#               instructions are executed, see DWT_CPICNT. - Either
#               SecureNoninvasiveDebugAllowed() == TRUE, or the PE is in Non-
#               secure state and NoninvasiveDebugAllowed() == TRUE. The counter
#               is incremented by the number of instructions executed, minus
#               one
.equ	M33_DWT_FOLDCNT_FOLDCNT_RESET, 0x00
.equ	M33_DWT_FOLDCNT_FOLDCNT_BITS, 0x000000ff
.equ	M33_DWT_FOLDCNT_FOLDCNT_MSB, 7
.equ	M33_DWT_FOLDCNT_FOLDCNT_LSB, 0
# =============================================================================
# Register    : M33_DWT_COMP0
# Description : Provides a reference value for use by watchpoint comparator 0
.equ	M33_DWT_COMP0_OFFSET, 0x00001020
.equ	M33_DWT_COMP0_BITS, 0xffffffff
.equ	M33_DWT_COMP0_RESET, 0x00000000
.equ	M33_DWT_COMP0_MSB, 31
.equ	M33_DWT_COMP0_LSB, 0
# =============================================================================
# Register    : M33_DWT_FUNCTION0
# Description : Controls the operation of watchpoint comparator 0
.equ	M33_DWT_FUNCTION0_OFFSET, 0x00001028
.equ	M33_DWT_FUNCTION0_BITS, 0xf9000c3f
.equ	M33_DWT_FUNCTION0_RESET, 0x58000000
# -----------------------------------------------------------------------------
# Field       : M33_DWT_FUNCTION0_ID
# Description : Identifies the capabilities for MATCH for comparator *n
.equ	M33_DWT_FUNCTION0_ID_RESET, 0x0b
.equ	M33_DWT_FUNCTION0_ID_BITS, 0xf8000000
.equ	M33_DWT_FUNCTION0_ID_MSB, 31
.equ	M33_DWT_FUNCTION0_ID_LSB, 27
# -----------------------------------------------------------------------------
# Field       : M33_DWT_FUNCTION0_MATCHED
# Description : Set to 1 when the comparator matches
.equ	M33_DWT_FUNCTION0_MATCHED_RESET, 0x0
.equ	M33_DWT_FUNCTION0_MATCHED_BITS, 0x01000000
.equ	M33_DWT_FUNCTION0_MATCHED_MSB, 24
.equ	M33_DWT_FUNCTION0_MATCHED_LSB, 24
# -----------------------------------------------------------------------------
# Field       : M33_DWT_FUNCTION0_DATAVSIZE
# Description : Defines the size of the object being watched for by Data Value
#               and Data Address comparators
.equ	M33_DWT_FUNCTION0_DATAVSIZE_RESET, 0x0
.equ	M33_DWT_FUNCTION0_DATAVSIZE_BITS, 0x00000c00
.equ	M33_DWT_FUNCTION0_DATAVSIZE_MSB, 11
.equ	M33_DWT_FUNCTION0_DATAVSIZE_LSB, 10
# -----------------------------------------------------------------------------
# Field       : M33_DWT_FUNCTION0_ACTION
# Description : Defines the action on a match. This field is ignored and the
#               comparator generates no actions if it is disabled by MATCH
.equ	M33_DWT_FUNCTION0_ACTION_RESET, 0x0
.equ	M33_DWT_FUNCTION0_ACTION_BITS, 0x00000030
.equ	M33_DWT_FUNCTION0_ACTION_MSB, 5
.equ	M33_DWT_FUNCTION0_ACTION_LSB, 4
# -----------------------------------------------------------------------------
# Field       : M33_DWT_FUNCTION0_MATCH
# Description : Controls the type of match generated by this comparator
.equ	M33_DWT_FUNCTION0_MATCH_RESET, 0x0
.equ	M33_DWT_FUNCTION0_MATCH_BITS, 0x0000000f
.equ	M33_DWT_FUNCTION0_MATCH_MSB, 3
.equ	M33_DWT_FUNCTION0_MATCH_LSB, 0
# =============================================================================
# Register    : M33_DWT_COMP1
# Description : Provides a reference value for use by watchpoint comparator 1
.equ	M33_DWT_COMP1_OFFSET, 0x00001030
.equ	M33_DWT_COMP1_BITS, 0xffffffff
.equ	M33_DWT_COMP1_RESET, 0x00000000
.equ	M33_DWT_COMP1_MSB, 31
.equ	M33_DWT_COMP1_LSB, 0
# =============================================================================
# Register    : M33_DWT_FUNCTION1
# Description : Controls the operation of watchpoint comparator 1
.equ	M33_DWT_FUNCTION1_OFFSET, 0x00001038
.equ	M33_DWT_FUNCTION1_BITS, 0xf9000c3f
.equ	M33_DWT_FUNCTION1_RESET, 0x89000828
# -----------------------------------------------------------------------------
# Field       : M33_DWT_FUNCTION1_ID
# Description : Identifies the capabilities for MATCH for comparator *n
.equ	M33_DWT_FUNCTION1_ID_RESET, 0x11
.equ	M33_DWT_FUNCTION1_ID_BITS, 0xf8000000
.equ	M33_DWT_FUNCTION1_ID_MSB, 31
.equ	M33_DWT_FUNCTION1_ID_LSB, 27
# -----------------------------------------------------------------------------
# Field       : M33_DWT_FUNCTION1_MATCHED
# Description : Set to 1 when the comparator matches
.equ	M33_DWT_FUNCTION1_MATCHED_RESET, 0x1
.equ	M33_DWT_FUNCTION1_MATCHED_BITS, 0x01000000
.equ	M33_DWT_FUNCTION1_MATCHED_MSB, 24
.equ	M33_DWT_FUNCTION1_MATCHED_LSB, 24
# -----------------------------------------------------------------------------
# Field       : M33_DWT_FUNCTION1_DATAVSIZE
# Description : Defines the size of the object being watched for by Data Value
#               and Data Address comparators
.equ	M33_DWT_FUNCTION1_DATAVSIZE_RESET, 0x2
.equ	M33_DWT_FUNCTION1_DATAVSIZE_BITS, 0x00000c00
.equ	M33_DWT_FUNCTION1_DATAVSIZE_MSB, 11
.equ	M33_DWT_FUNCTION1_DATAVSIZE_LSB, 10
# -----------------------------------------------------------------------------
# Field       : M33_DWT_FUNCTION1_ACTION
# Description : Defines the action on a match. This field is ignored and the
#               comparator generates no actions if it is disabled by MATCH
.equ	M33_DWT_FUNCTION1_ACTION_RESET, 0x2
.equ	M33_DWT_FUNCTION1_ACTION_BITS, 0x00000030
.equ	M33_DWT_FUNCTION1_ACTION_MSB, 5
.equ	M33_DWT_FUNCTION1_ACTION_LSB, 4
# -----------------------------------------------------------------------------
# Field       : M33_DWT_FUNCTION1_MATCH
# Description : Controls the type of match generated by this comparator
.equ	M33_DWT_FUNCTION1_MATCH_RESET, 0x8
.equ	M33_DWT_FUNCTION1_MATCH_BITS, 0x0000000f
.equ	M33_DWT_FUNCTION1_MATCH_MSB, 3
.equ	M33_DWT_FUNCTION1_MATCH_LSB, 0
# =============================================================================
# Register    : M33_DWT_COMP2
# Description : Provides a reference value for use by watchpoint comparator 2
.equ	M33_DWT_COMP2_OFFSET, 0x00001040
.equ	M33_DWT_COMP2_BITS, 0xffffffff
.equ	M33_DWT_COMP2_RESET, 0x00000000
.equ	M33_DWT_COMP2_MSB, 31
.equ	M33_DWT_COMP2_LSB, 0
# =============================================================================
# Register    : M33_DWT_FUNCTION2
# Description : Controls the operation of watchpoint comparator 2
.equ	M33_DWT_FUNCTION2_OFFSET, 0x00001048
.equ	M33_DWT_FUNCTION2_BITS, 0xf9000c3f
.equ	M33_DWT_FUNCTION2_RESET, 0x50000000
# -----------------------------------------------------------------------------
# Field       : M33_DWT_FUNCTION2_ID
# Description : Identifies the capabilities for MATCH for comparator *n
.equ	M33_DWT_FUNCTION2_ID_RESET, 0x0a
.equ	M33_DWT_FUNCTION2_ID_BITS, 0xf8000000
.equ	M33_DWT_FUNCTION2_ID_MSB, 31
.equ	M33_DWT_FUNCTION2_ID_LSB, 27
# -----------------------------------------------------------------------------
# Field       : M33_DWT_FUNCTION2_MATCHED
# Description : Set to 1 when the comparator matches
.equ	M33_DWT_FUNCTION2_MATCHED_RESET, 0x0
.equ	M33_DWT_FUNCTION2_MATCHED_BITS, 0x01000000
.equ	M33_DWT_FUNCTION2_MATCHED_MSB, 24
.equ	M33_DWT_FUNCTION2_MATCHED_LSB, 24
# -----------------------------------------------------------------------------
# Field       : M33_DWT_FUNCTION2_DATAVSIZE
# Description : Defines the size of the object being watched for by Data Value
#               and Data Address comparators
.equ	M33_DWT_FUNCTION2_DATAVSIZE_RESET, 0x0
.equ	M33_DWT_FUNCTION2_DATAVSIZE_BITS, 0x00000c00
.equ	M33_DWT_FUNCTION2_DATAVSIZE_MSB, 11
.equ	M33_DWT_FUNCTION2_DATAVSIZE_LSB, 10
# -----------------------------------------------------------------------------
# Field       : M33_DWT_FUNCTION2_ACTION
# Description : Defines the action on a match. This field is ignored and the
#               comparator generates no actions if it is disabled by MATCH
.equ	M33_DWT_FUNCTION2_ACTION_RESET, 0x0
.equ	M33_DWT_FUNCTION2_ACTION_BITS, 0x00000030
.equ	M33_DWT_FUNCTION2_ACTION_MSB, 5
.equ	M33_DWT_FUNCTION2_ACTION_LSB, 4
# -----------------------------------------------------------------------------
# Field       : M33_DWT_FUNCTION2_MATCH
# Description : Controls the type of match generated by this comparator
.equ	M33_DWT_FUNCTION2_MATCH_RESET, 0x0
.equ	M33_DWT_FUNCTION2_MATCH_BITS, 0x0000000f
.equ	M33_DWT_FUNCTION2_MATCH_MSB, 3
.equ	M33_DWT_FUNCTION2_MATCH_LSB, 0
# =============================================================================
# Register    : M33_DWT_COMP3
# Description : Provides a reference value for use by watchpoint comparator 3
.equ	M33_DWT_COMP3_OFFSET, 0x00001050
.equ	M33_DWT_COMP3_BITS, 0xffffffff
.equ	M33_DWT_COMP3_RESET, 0x00000000
.equ	M33_DWT_COMP3_MSB, 31
.equ	M33_DWT_COMP3_LSB, 0
# =============================================================================
# Register    : M33_DWT_FUNCTION3
# Description : Controls the operation of watchpoint comparator 3
.equ	M33_DWT_FUNCTION3_OFFSET, 0x00001058
.equ	M33_DWT_FUNCTION3_BITS, 0xf9000c3f
.equ	M33_DWT_FUNCTION3_RESET, 0x20000800
# -----------------------------------------------------------------------------
# Field       : M33_DWT_FUNCTION3_ID
# Description : Identifies the capabilities for MATCH for comparator *n
.equ	M33_DWT_FUNCTION3_ID_RESET, 0x04
.equ	M33_DWT_FUNCTION3_ID_BITS, 0xf8000000
.equ	M33_DWT_FUNCTION3_ID_MSB, 31
.equ	M33_DWT_FUNCTION3_ID_LSB, 27
# -----------------------------------------------------------------------------
# Field       : M33_DWT_FUNCTION3_MATCHED
# Description : Set to 1 when the comparator matches
.equ	M33_DWT_FUNCTION3_MATCHED_RESET, 0x0
.equ	M33_DWT_FUNCTION3_MATCHED_BITS, 0x01000000
.equ	M33_DWT_FUNCTION3_MATCHED_MSB, 24
.equ	M33_DWT_FUNCTION3_MATCHED_LSB, 24
# -----------------------------------------------------------------------------
# Field       : M33_DWT_FUNCTION3_DATAVSIZE
# Description : Defines the size of the object being watched for by Data Value
#               and Data Address comparators
.equ	M33_DWT_FUNCTION3_DATAVSIZE_RESET, 0x2
.equ	M33_DWT_FUNCTION3_DATAVSIZE_BITS, 0x00000c00
.equ	M33_DWT_FUNCTION3_DATAVSIZE_MSB, 11
.equ	M33_DWT_FUNCTION3_DATAVSIZE_LSB, 10
# -----------------------------------------------------------------------------
# Field       : M33_DWT_FUNCTION3_ACTION
# Description : Defines the action on a match. This field is ignored and the
#               comparator generates no actions if it is disabled by MATCH
.equ	M33_DWT_FUNCTION3_ACTION_RESET, 0x0
.equ	M33_DWT_FUNCTION3_ACTION_BITS, 0x00000030
.equ	M33_DWT_FUNCTION3_ACTION_MSB, 5
.equ	M33_DWT_FUNCTION3_ACTION_LSB, 4
# -----------------------------------------------------------------------------
# Field       : M33_DWT_FUNCTION3_MATCH
# Description : Controls the type of match generated by this comparator
.equ	M33_DWT_FUNCTION3_MATCH_RESET, 0x0
.equ	M33_DWT_FUNCTION3_MATCH_BITS, 0x0000000f
.equ	M33_DWT_FUNCTION3_MATCH_MSB, 3
.equ	M33_DWT_FUNCTION3_MATCH_LSB, 0
# =============================================================================
# Register    : M33_DWT_DEVARCH
# Description : Provides CoreSight discovery information for the DWT
.equ	M33_DWT_DEVARCH_OFFSET, 0x00001fbc
.equ	M33_DWT_DEVARCH_BITS, 0xffffffff
.equ	M33_DWT_DEVARCH_RESET, 0x47701a02
# -----------------------------------------------------------------------------
# Field       : M33_DWT_DEVARCH_ARCHITECT
# Description : Defines the architect of the component. Bits [31:28] are the
#               JEP106 continuation code (JEP106 bank ID, minus 1) and bits
#               [27:21] are the JEP106 ID code.
.equ	M33_DWT_DEVARCH_ARCHITECT_RESET, 0x23b
.equ	M33_DWT_DEVARCH_ARCHITECT_BITS, 0xffe00000
.equ	M33_DWT_DEVARCH_ARCHITECT_MSB, 31
.equ	M33_DWT_DEVARCH_ARCHITECT_LSB, 21
# -----------------------------------------------------------------------------
# Field       : M33_DWT_DEVARCH_PRESENT
# Description : Defines that the DEVARCH register is present
.equ	M33_DWT_DEVARCH_PRESENT_RESET, 0x1
.equ	M33_DWT_DEVARCH_PRESENT_BITS, 0x00100000
.equ	M33_DWT_DEVARCH_PRESENT_MSB, 20
.equ	M33_DWT_DEVARCH_PRESENT_LSB, 20
# -----------------------------------------------------------------------------
# Field       : M33_DWT_DEVARCH_REVISION
# Description : Defines the architecture revision of the component
.equ	M33_DWT_DEVARCH_REVISION_RESET, 0x0
.equ	M33_DWT_DEVARCH_REVISION_BITS, 0x000f0000
.equ	M33_DWT_DEVARCH_REVISION_MSB, 19
.equ	M33_DWT_DEVARCH_REVISION_LSB, 16
# -----------------------------------------------------------------------------
# Field       : M33_DWT_DEVARCH_ARCHVER
# Description : Defines the architecture version of the component
.equ	M33_DWT_DEVARCH_ARCHVER_RESET, 0x1
.equ	M33_DWT_DEVARCH_ARCHVER_BITS, 0x0000f000
.equ	M33_DWT_DEVARCH_ARCHVER_MSB, 15
.equ	M33_DWT_DEVARCH_ARCHVER_LSB, 12
# -----------------------------------------------------------------------------
# Field       : M33_DWT_DEVARCH_ARCHPART
# Description : Defines the architecture of the component
.equ	M33_DWT_DEVARCH_ARCHPART_RESET, 0xa02
.equ	M33_DWT_DEVARCH_ARCHPART_BITS, 0x00000fff
.equ	M33_DWT_DEVARCH_ARCHPART_MSB, 11
.equ	M33_DWT_DEVARCH_ARCHPART_LSB, 0
# =============================================================================
# Register    : M33_DWT_DEVTYPE
# Description : Provides CoreSight discovery information for the DWT
.equ	M33_DWT_DEVTYPE_OFFSET, 0x00001fcc
.equ	M33_DWT_DEVTYPE_BITS, 0x000000ff
.equ	M33_DWT_DEVTYPE_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_DWT_DEVTYPE_SUB
# Description : Component sub-type
.equ	M33_DWT_DEVTYPE_SUB_RESET, 0x0
.equ	M33_DWT_DEVTYPE_SUB_BITS, 0x000000f0
.equ	M33_DWT_DEVTYPE_SUB_MSB, 7
.equ	M33_DWT_DEVTYPE_SUB_LSB, 4
# -----------------------------------------------------------------------------
# Field       : M33_DWT_DEVTYPE_MAJOR
# Description : Component major type
.equ	M33_DWT_DEVTYPE_MAJOR_RESET, 0x0
.equ	M33_DWT_DEVTYPE_MAJOR_BITS, 0x0000000f
.equ	M33_DWT_DEVTYPE_MAJOR_MSB, 3
.equ	M33_DWT_DEVTYPE_MAJOR_LSB, 0
# =============================================================================
# Register    : M33_DWT_PIDR4
# Description : Provides CoreSight discovery information for the DWT
.equ	M33_DWT_PIDR4_OFFSET, 0x00001fd0
.equ	M33_DWT_PIDR4_BITS, 0x000000ff
.equ	M33_DWT_PIDR4_RESET, 0x00000004
# -----------------------------------------------------------------------------
# Field       : M33_DWT_PIDR4_SIZE
# Description : See CoreSight Architecture Specification
.equ	M33_DWT_PIDR4_SIZE_RESET, 0x0
.equ	M33_DWT_PIDR4_SIZE_BITS, 0x000000f0
.equ	M33_DWT_PIDR4_SIZE_MSB, 7
.equ	M33_DWT_PIDR4_SIZE_LSB, 4
# -----------------------------------------------------------------------------
# Field       : M33_DWT_PIDR4_DES_2
# Description : See CoreSight Architecture Specification
.equ	M33_DWT_PIDR4_DES_2_RESET, 0x4
.equ	M33_DWT_PIDR4_DES_2_BITS, 0x0000000f
.equ	M33_DWT_PIDR4_DES_2_MSB, 3
.equ	M33_DWT_PIDR4_DES_2_LSB, 0
# =============================================================================
# Register    : M33_DWT_PIDR5
# Description : Provides CoreSight discovery information for the DWT
.equ	M33_DWT_PIDR5_OFFSET, 0x00001fd4
.equ	M33_DWT_PIDR5_BITS, 0x00000000
.equ	M33_DWT_PIDR5_RESET, 0x00000000
.equ	M33_DWT_PIDR5_MSB, 31
.equ	M33_DWT_PIDR5_LSB, 0
# =============================================================================
# Register    : M33_DWT_PIDR6
# Description : Provides CoreSight discovery information for the DWT
.equ	M33_DWT_PIDR6_OFFSET, 0x00001fd8
.equ	M33_DWT_PIDR6_BITS, 0x00000000
.equ	M33_DWT_PIDR6_RESET, 0x00000000
.equ	M33_DWT_PIDR6_MSB, 31
.equ	M33_DWT_PIDR6_LSB, 0
# =============================================================================
# Register    : M33_DWT_PIDR7
# Description : Provides CoreSight discovery information for the DWT
.equ	M33_DWT_PIDR7_OFFSET, 0x00001fdc
.equ	M33_DWT_PIDR7_BITS, 0x00000000
.equ	M33_DWT_PIDR7_RESET, 0x00000000
.equ	M33_DWT_PIDR7_MSB, 31
.equ	M33_DWT_PIDR7_LSB, 0
# =============================================================================
