konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/m33.inc
# Register    : M33_DWT_PIDR0
# Description : Provides CoreSight discovery information for the DWT
.equ	M33_DWT_PIDR0_OFFSET, 0x00001fe0
.equ	M33_DWT_PIDR0_BITS, 0x000000ff
.equ	M33_DWT_PIDR0_RESET, 0x00000021
# -----------------------------------------------------------------------------
# Field       : M33_DWT_PIDR0_PART_0
# Description : See CoreSight Architecture Specification
.equ	M33_DWT_PIDR0_PART_0_RESET, 0x21
.equ	M33_DWT_PIDR0_PART_0_BITS, 0x000000ff
.equ	M33_DWT_PIDR0_PART_0_MSB, 7
.equ	M33_DWT_PIDR0_PART_0_LSB, 0
# =============================================================================
# Register    : M33_DWT_PIDR1
# Description : Provides CoreSight discovery information for the DWT
.equ	M33_DWT_PIDR1_OFFSET, 0x00001fe4
.equ	M33_DWT_PIDR1_BITS, 0x000000ff
.equ	M33_DWT_PIDR1_RESET, 0x000000bd
# -----------------------------------------------------------------------------
# Field       : M33_DWT_PIDR1_DES_0
# Description : See CoreSight Architecture Specification
.equ	M33_DWT_PIDR1_DES_0_RESET, 0xb
.equ	M33_DWT_PIDR1_DES_0_BITS, 0x000000f0
.equ	M33_DWT_PIDR1_DES_0_MSB, 7
.equ	M33_DWT_PIDR1_DES_0_LSB, 4
# -----------------------------------------------------------------------------
# Field       : M33_DWT_PIDR1_PART_1
# Description : See CoreSight Architecture Specification
.equ	M33_DWT_PIDR1_PART_1_RESET, 0xd
.equ	M33_DWT_PIDR1_PART_1_BITS, 0x0000000f
.equ	M33_DWT_PIDR1_PART_1_MSB, 3
.equ	M33_DWT_PIDR1_PART_1_LSB, 0
# =============================================================================
# Register    : M33_DWT_PIDR2
# Description : Provides CoreSight discovery information for the DWT
.equ	M33_DWT_PIDR2_OFFSET, 0x00001fe8
.equ	M33_DWT_PIDR2_BITS, 0x000000ff
.equ	M33_DWT_PIDR2_RESET, 0x0000000b
# -----------------------------------------------------------------------------
# Field       : M33_DWT_PIDR2_REVISION
# Description : See CoreSight Architecture Specification
.equ	M33_DWT_PIDR2_REVISION_RESET, 0x0
.equ	M33_DWT_PIDR2_REVISION_BITS, 0x000000f0
.equ	M33_DWT_PIDR2_REVISION_MSB, 7
.equ	M33_DWT_PIDR2_REVISION_LSB, 4
# -----------------------------------------------------------------------------
# Field       : M33_DWT_PIDR2_JEDEC
# Description : See CoreSight Architecture Specification
.equ	M33_DWT_PIDR2_JEDEC_RESET, 0x1
.equ	M33_DWT_PIDR2_JEDEC_BITS, 0x00000008
.equ	M33_DWT_PIDR2_JEDEC_MSB, 3
.equ	M33_DWT_PIDR2_JEDEC_LSB, 3
# -----------------------------------------------------------------------------
# Field       : M33_DWT_PIDR2_DES_1
# Description : See CoreSight Architecture Specification
.equ	M33_DWT_PIDR2_DES_1_RESET, 0x3
.equ	M33_DWT_PIDR2_DES_1_BITS, 0x00000007
.equ	M33_DWT_PIDR2_DES_1_MSB, 2
.equ	M33_DWT_PIDR2_DES_1_LSB, 0
# =============================================================================
# Register    : M33_DWT_PIDR3
# Description : Provides CoreSight discovery information for the DWT
.equ	M33_DWT_PIDR3_OFFSET, 0x00001fec
.equ	M33_DWT_PIDR3_BITS, 0x000000ff
.equ	M33_DWT_PIDR3_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_DWT_PIDR3_REVAND
# Description : See CoreSight Architecture Specification
.equ	M33_DWT_PIDR3_REVAND_RESET, 0x0
.equ	M33_DWT_PIDR3_REVAND_BITS, 0x000000f0
.equ	M33_DWT_PIDR3_REVAND_MSB, 7
.equ	M33_DWT_PIDR3_REVAND_LSB, 4
# -----------------------------------------------------------------------------
# Field       : M33_DWT_PIDR3_CMOD
# Description : See CoreSight Architecture Specification
.equ	M33_DWT_PIDR3_CMOD_RESET, 0x0
.equ	M33_DWT_PIDR3_CMOD_BITS, 0x0000000f
.equ	M33_DWT_PIDR3_CMOD_MSB, 3
.equ	M33_DWT_PIDR3_CMOD_LSB, 0
# =============================================================================
# Register    : M33_DWT_CIDR0
# Description : Provides CoreSight discovery information for the DWT
.equ	M33_DWT_CIDR0_OFFSET, 0x00001ff0
.equ	M33_DWT_CIDR0_BITS, 0x000000ff
.equ	M33_DWT_CIDR0_RESET, 0x0000000d
# -----------------------------------------------------------------------------
# Field       : M33_DWT_CIDR0_PRMBL_0
# Description : See CoreSight Architecture Specification
.equ	M33_DWT_CIDR0_PRMBL_0_RESET, 0x0d
.equ	M33_DWT_CIDR0_PRMBL_0_BITS, 0x000000ff
.equ	M33_DWT_CIDR0_PRMBL_0_MSB, 7
.equ	M33_DWT_CIDR0_PRMBL_0_LSB, 0
# =============================================================================
# Register    : M33_DWT_CIDR1
# Description : Provides CoreSight discovery information for the DWT
.equ	M33_DWT_CIDR1_OFFSET, 0x00001ff4
.equ	M33_DWT_CIDR1_BITS, 0x000000ff
.equ	M33_DWT_CIDR1_RESET, 0x00000090
# -----------------------------------------------------------------------------
# Field       : M33_DWT_CIDR1_CLASS
# Description : See CoreSight Architecture Specification
.equ	M33_DWT_CIDR1_CLASS_RESET, 0x9
.equ	M33_DWT_CIDR1_CLASS_BITS, 0x000000f0
.equ	M33_DWT_CIDR1_CLASS_MSB, 7
.equ	M33_DWT_CIDR1_CLASS_LSB, 4
# -----------------------------------------------------------------------------
# Field       : M33_DWT_CIDR1_PRMBL_1
# Description : See CoreSight Architecture Specification
.equ	M33_DWT_CIDR1_PRMBL_1_RESET, 0x0
.equ	M33_DWT_CIDR1_PRMBL_1_BITS, 0x0000000f
.equ	M33_DWT_CIDR1_PRMBL_1_MSB, 3
.equ	M33_DWT_CIDR1_PRMBL_1_LSB, 0
# =============================================================================
# Register    : M33_DWT_CIDR2
# Description : Provides CoreSight discovery information for the DWT
.equ	M33_DWT_CIDR2_OFFSET, 0x00001ff8
.equ	M33_DWT_CIDR2_BITS, 0x000000ff
.equ	M33_DWT_CIDR2_RESET, 0x00000005
# -----------------------------------------------------------------------------
# Field       : M33_DWT_CIDR2_PRMBL_2
# Description : See CoreSight Architecture Specification
.equ	M33_DWT_CIDR2_PRMBL_2_RESET, 0x05
.equ	M33_DWT_CIDR2_PRMBL_2_BITS, 0x000000ff
.equ	M33_DWT_CIDR2_PRMBL_2_MSB, 7
.equ	M33_DWT_CIDR2_PRMBL_2_LSB, 0
# =============================================================================
# Register    : M33_DWT_CIDR3
# Description : Provides CoreSight discovery information for the DWT
.equ	M33_DWT_CIDR3_OFFSET, 0x00001ffc
.equ	M33_DWT_CIDR3_BITS, 0x000000ff
.equ	M33_DWT_CIDR3_RESET, 0x000000b1
# -----------------------------------------------------------------------------
# Field       : M33_DWT_CIDR3_PRMBL_3
# Description : See CoreSight Architecture Specification
.equ	M33_DWT_CIDR3_PRMBL_3_RESET, 0xb1
.equ	M33_DWT_CIDR3_PRMBL_3_BITS, 0x000000ff
.equ	M33_DWT_CIDR3_PRMBL_3_MSB, 7
.equ	M33_DWT_CIDR3_PRMBL_3_LSB, 0
# =============================================================================
# Register    : M33_FP_CTRL
# Description : Provides FPB implementation information, and the global enable
#               for the FPB unit
.equ	M33_FP_CTRL_OFFSET, 0x00002000
.equ	M33_FP_CTRL_BITS, 0xf0007ff3
.equ	M33_FP_CTRL_RESET, 0x60005580
# -----------------------------------------------------------------------------
# Field       : M33_FP_CTRL_REV
# Description : Flash Patch and Breakpoint Unit architecture revision
.equ	M33_FP_CTRL_REV_RESET, 0x6
.equ	M33_FP_CTRL_REV_BITS, 0xf0000000
.equ	M33_FP_CTRL_REV_MSB, 31
.equ	M33_FP_CTRL_REV_LSB, 28
# -----------------------------------------------------------------------------
# Field       : M33_FP_CTRL_NUM_CODE_14_12_
# Description : Indicates the number of implemented instruction address
#               comparators. Zero indicates no Instruction Address comparators
#               are implemented. The Instruction Address comparators are
#               numbered from 0 to NUM_CODE - 1
.equ	M33_FP_CTRL_NUM_CODE_14_12__RESET, 0x5
.equ	M33_FP_CTRL_NUM_CODE_14_12__BITS, 0x00007000
.equ	M33_FP_CTRL_NUM_CODE_14_12__MSB, 14
.equ	M33_FP_CTRL_NUM_CODE_14_12__LSB, 12
# -----------------------------------------------------------------------------
# Field       : M33_FP_CTRL_NUM_LIT
# Description : Indicates the number of implemented literal address
#               comparators. The Literal Address comparators are numbered from
#               NUM_CODE to NUM_CODE + NUM_LIT - 1
.equ	M33_FP_CTRL_NUM_LIT_RESET, 0x5
.equ	M33_FP_CTRL_NUM_LIT_BITS, 0x00000f00
.equ	M33_FP_CTRL_NUM_LIT_MSB, 11
.equ	M33_FP_CTRL_NUM_LIT_LSB, 8
# -----------------------------------------------------------------------------
# Field       : M33_FP_CTRL_NUM_CODE_7_4_
# Description : Indicates the number of implemented instruction address
#               comparators. Zero indicates no Instruction Address comparators
#               are implemented. The Instruction Address comparators are
#               numbered from 0 to NUM_CODE - 1
.equ	M33_FP_CTRL_NUM_CODE_7_4__RESET, 0x8
.equ	M33_FP_CTRL_NUM_CODE_7_4__BITS, 0x000000f0
.equ	M33_FP_CTRL_NUM_CODE_7_4__MSB, 7
.equ	M33_FP_CTRL_NUM_CODE_7_4__LSB, 4
# -----------------------------------------------------------------------------
# Field       : M33_FP_CTRL_KEY
# Description : Writes to the FP_CTRL are ignored unless KEY is concurrently
#               written to one
.equ	M33_FP_CTRL_KEY_RESET, 0x0
.equ	M33_FP_CTRL_KEY_BITS, 0x00000002
.equ	M33_FP_CTRL_KEY_MSB, 1
.equ	M33_FP_CTRL_KEY_LSB, 1
# -----------------------------------------------------------------------------
# Field       : M33_FP_CTRL_ENABLE
# Description : Enables the FPB
.equ	M33_FP_CTRL_ENABLE_RESET, 0x0
.equ	M33_FP_CTRL_ENABLE_BITS, 0x00000001
.equ	M33_FP_CTRL_ENABLE_MSB, 0
.equ	M33_FP_CTRL_ENABLE_LSB, 0
# =============================================================================
# Register    : M33_FP_REMAP
# Description : Indicates whether the implementation supports Flash Patch remap
#               and, if it does, holds the target address for remap
.equ	M33_FP_REMAP_OFFSET, 0x00002004
.equ	M33_FP_REMAP_BITS, 0x3fffffe0
.equ	M33_FP_REMAP_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_FP_REMAP_RMPSPT
# Description : Indicates whether the FPB unit supports the Flash Patch remap
#               function
.equ	M33_FP_REMAP_RMPSPT_RESET, 0x0
.equ	M33_FP_REMAP_RMPSPT_BITS, 0x20000000
.equ	M33_FP_REMAP_RMPSPT_MSB, 29
.equ	M33_FP_REMAP_RMPSPT_LSB, 29
# -----------------------------------------------------------------------------
# Field       : M33_FP_REMAP_REMAP
# Description : Holds the bits[28:5] of the Flash Patch remap address
.equ	M33_FP_REMAP_REMAP_RESET, 0x000000
.equ	M33_FP_REMAP_REMAP_BITS, 0x1fffffe0
.equ	M33_FP_REMAP_REMAP_MSB, 28
.equ	M33_FP_REMAP_REMAP_LSB, 5
# =============================================================================
# Register    : M33_FP_COMP0
# Description : Holds an address for comparison. The effect of the match
#               depends on the configuration of the FPB and whether the
#               comparator is an instruction address comparator or a literal
#               address comparator
.equ	M33_FP_COMP0_OFFSET, 0x00002008
.equ	M33_FP_COMP0_BITS, 0x00000001
.equ	M33_FP_COMP0_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_FP_COMP0_BE
# Description : Selects between flashpatch and breakpoint functionality
.equ	M33_FP_COMP0_BE_RESET, 0x0
.equ	M33_FP_COMP0_BE_BITS, 0x00000001
.equ	M33_FP_COMP0_BE_MSB, 0
.equ	M33_FP_COMP0_BE_LSB, 0
# =============================================================================
# Register    : M33_FP_COMP1
# Description : Holds an address for comparison. The effect of the match
#               depends on the configuration of the FPB and whether the
#               comparator is an instruction address comparator or a literal
#               address comparator
.equ	M33_FP_COMP1_OFFSET, 0x0000200c
.equ	M33_FP_COMP1_BITS, 0x00000001
.equ	M33_FP_COMP1_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_FP_COMP1_BE
# Description : Selects between flashpatch and breakpoint functionality
.equ	M33_FP_COMP1_BE_RESET, 0x0
.equ	M33_FP_COMP1_BE_BITS, 0x00000001
.equ	M33_FP_COMP1_BE_MSB, 0
.equ	M33_FP_COMP1_BE_LSB, 0
# =============================================================================
# Register    : M33_FP_COMP2
# Description : Holds an address for comparison. The effect of the match
#               depends on the configuration of the FPB and whether the
#               comparator is an instruction address comparator or a literal
#               address comparator
.equ	M33_FP_COMP2_OFFSET, 0x00002010
.equ	M33_FP_COMP2_BITS, 0x00000001
.equ	M33_FP_COMP2_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_FP_COMP2_BE
# Description : Selects between flashpatch and breakpoint functionality
.equ	M33_FP_COMP2_BE_RESET, 0x0
.equ	M33_FP_COMP2_BE_BITS, 0x00000001
.equ	M33_FP_COMP2_BE_MSB, 0
.equ	M33_FP_COMP2_BE_LSB, 0
# =============================================================================
# Register    : M33_FP_COMP3
# Description : Holds an address for comparison. The effect of the match
#               depends on the configuration of the FPB and whether the
#               comparator is an instruction address comparator or a literal
#               address comparator
.equ	M33_FP_COMP3_OFFSET, 0x00002014
.equ	M33_FP_COMP3_BITS, 0x00000001
.equ	M33_FP_COMP3_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_FP_COMP3_BE
# Description : Selects between flashpatch and breakpoint functionality
.equ	M33_FP_COMP3_BE_RESET, 0x0
.equ	M33_FP_COMP3_BE_BITS, 0x00000001
.equ	M33_FP_COMP3_BE_MSB, 0
.equ	M33_FP_COMP3_BE_LSB, 0
# =============================================================================
# Register    : M33_FP_COMP4
# Description : Holds an address for comparison. The effect of the match
#               depends on the configuration of the FPB and whether the
#               comparator is an instruction address comparator or a literal
#               address comparator
.equ	M33_FP_COMP4_OFFSET, 0x00002018
.equ	M33_FP_COMP4_BITS, 0x00000001
.equ	M33_FP_COMP4_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_FP_COMP4_BE
# Description : Selects between flashpatch and breakpoint functionality
.equ	M33_FP_COMP4_BE_RESET, 0x0
.equ	M33_FP_COMP4_BE_BITS, 0x00000001
.equ	M33_FP_COMP4_BE_MSB, 0
.equ	M33_FP_COMP4_BE_LSB, 0
# =============================================================================
# Register    : M33_FP_COMP5
# Description : Holds an address for comparison. The effect of the match
#               depends on the configuration of the FPB and whether the
#               comparator is an instruction address comparator or a literal
#               address comparator
.equ	M33_FP_COMP5_OFFSET, 0x0000201c
.equ	M33_FP_COMP5_BITS, 0x00000001
.equ	M33_FP_COMP5_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_FP_COMP5_BE
# Description : Selects between flashpatch and breakpoint functionality
.equ	M33_FP_COMP5_BE_RESET, 0x0
.equ	M33_FP_COMP5_BE_BITS, 0x00000001
.equ	M33_FP_COMP5_BE_MSB, 0
.equ	M33_FP_COMP5_BE_LSB, 0
# =============================================================================
# Register    : M33_FP_COMP6
# Description : Holds an address for comparison. The effect of the match
#               depends on the configuration of the FPB and whether the
#               comparator is an instruction address comparator or a literal
#               address comparator
.equ	M33_FP_COMP6_OFFSET, 0x00002020
.equ	M33_FP_COMP6_BITS, 0x00000001
.equ	M33_FP_COMP6_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_FP_COMP6_BE
# Description : Selects between flashpatch and breakpoint functionality
.equ	M33_FP_COMP6_BE_RESET, 0x0
.equ	M33_FP_COMP6_BE_BITS, 0x00000001
.equ	M33_FP_COMP6_BE_MSB, 0
.equ	M33_FP_COMP6_BE_LSB, 0
# =============================================================================
# Register    : M33_FP_COMP7
# Description : Holds an address for comparison. The effect of the match
#               depends on the configuration of the FPB and whether the
#               comparator is an instruction address comparator or a literal
#               address comparator
.equ	M33_FP_COMP7_OFFSET, 0x00002024
.equ	M33_FP_COMP7_BITS, 0x00000001
.equ	M33_FP_COMP7_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_FP_COMP7_BE
# Description : Selects between flashpatch and breakpoint functionality
.equ	M33_FP_COMP7_BE_RESET, 0x0
.equ	M33_FP_COMP7_BE_BITS, 0x00000001
.equ	M33_FP_COMP7_BE_MSB, 0
.equ	M33_FP_COMP7_BE_LSB, 0
# =============================================================================
# Register    : M33_FP_DEVARCH
# Description : Provides CoreSight discovery information for the FPB
.equ	M33_FP_DEVARCH_OFFSET, 0x00002fbc
.equ	M33_FP_DEVARCH_BITS, 0xffffffff
.equ	M33_FP_DEVARCH_RESET, 0x47701a03
# -----------------------------------------------------------------------------
# Field       : M33_FP_DEVARCH_ARCHITECT
# Description : Defines the architect of the component. Bits [31:28] are the
#               JEP106 continuation code (JEP106 bank ID, minus 1) and bits
#               [27:21] are the JEP106 ID code.
.equ	M33_FP_DEVARCH_ARCHITECT_RESET, 0x23b
.equ	M33_FP_DEVARCH_ARCHITECT_BITS, 0xffe00000
.equ	M33_FP_DEVARCH_ARCHITECT_MSB, 31
.equ	M33_FP_DEVARCH_ARCHITECT_LSB, 21
# -----------------------------------------------------------------------------
# Field       : M33_FP_DEVARCH_PRESENT
# Description : Defines that the DEVARCH register is present
.equ	M33_FP_DEVARCH_PRESENT_RESET, 0x1
.equ	M33_FP_DEVARCH_PRESENT_BITS, 0x00100000
.equ	M33_FP_DEVARCH_PRESENT_MSB, 20
.equ	M33_FP_DEVARCH_PRESENT_LSB, 20
# -----------------------------------------------------------------------------
# Field       : M33_FP_DEVARCH_REVISION
# Description : Defines the architecture revision of the component
.equ	M33_FP_DEVARCH_REVISION_RESET, 0x0
.equ	M33_FP_DEVARCH_REVISION_BITS, 0x000f0000
.equ	M33_FP_DEVARCH_REVISION_MSB, 19
.equ	M33_FP_DEVARCH_REVISION_LSB, 16
# -----------------------------------------------------------------------------
# Field       : M33_FP_DEVARCH_ARCHVER
# Description : Defines the architecture version of the component
.equ	M33_FP_DEVARCH_ARCHVER_RESET, 0x1
.equ	M33_FP_DEVARCH_ARCHVER_BITS, 0x0000f000
.equ	M33_FP_DEVARCH_ARCHVER_MSB, 15
.equ	M33_FP_DEVARCH_ARCHVER_LSB, 12
# -----------------------------------------------------------------------------
# Field       : M33_FP_DEVARCH_ARCHPART
# Description : Defines the architecture of the component
.equ	M33_FP_DEVARCH_ARCHPART_RESET, 0xa03
.equ	M33_FP_DEVARCH_ARCHPART_BITS, 0x00000fff
.equ	M33_FP_DEVARCH_ARCHPART_MSB, 11
.equ	M33_FP_DEVARCH_ARCHPART_LSB, 0
# =============================================================================
# Register    : M33_FP_DEVTYPE
# Description : Provides CoreSight discovery information for the FPB
.equ	M33_FP_DEVTYPE_OFFSET, 0x00002fcc
.equ	M33_FP_DEVTYPE_BITS, 0x000000ff
.equ	M33_FP_DEVTYPE_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_FP_DEVTYPE_SUB
# Description : Component sub-type
.equ	M33_FP_DEVTYPE_SUB_RESET, 0x0
.equ	M33_FP_DEVTYPE_SUB_BITS, 0x000000f0
.equ	M33_FP_DEVTYPE_SUB_MSB, 7
.equ	M33_FP_DEVTYPE_SUB_LSB, 4
# -----------------------------------------------------------------------------
# Field       : M33_FP_DEVTYPE_MAJOR
# Description : Component major type
.equ	M33_FP_DEVTYPE_MAJOR_RESET, 0x0
.equ	M33_FP_DEVTYPE_MAJOR_BITS, 0x0000000f
.equ	M33_FP_DEVTYPE_MAJOR_MSB, 3
.equ	M33_FP_DEVTYPE_MAJOR_LSB, 0
# =============================================================================
# Register    : M33_FP_PIDR4
# Description : Provides CoreSight discovery information for the FP
.equ	M33_FP_PIDR4_OFFSET, 0x00002fd0
.equ	M33_FP_PIDR4_BITS, 0x000000ff
.equ	M33_FP_PIDR4_RESET, 0x00000004
# -----------------------------------------------------------------------------
# Field       : M33_FP_PIDR4_SIZE
# Description : See CoreSight Architecture Specification
.equ	M33_FP_PIDR4_SIZE_RESET, 0x0
.equ	M33_FP_PIDR4_SIZE_BITS, 0x000000f0
.equ	M33_FP_PIDR4_SIZE_MSB, 7
.equ	M33_FP_PIDR4_SIZE_LSB, 4
# -----------------------------------------------------------------------------
# Field       : M33_FP_PIDR4_DES_2
# Description : See CoreSight Architecture Specification
.equ	M33_FP_PIDR4_DES_2_RESET, 0x4
.equ	M33_FP_PIDR4_DES_2_BITS, 0x0000000f
.equ	M33_FP_PIDR4_DES_2_MSB, 3
.equ	M33_FP_PIDR4_DES_2_LSB, 0
# =============================================================================
# Register    : M33_FP_PIDR5
# Description : Provides CoreSight discovery information for the FP
.equ	M33_FP_PIDR5_OFFSET, 0x00002fd4
.equ	M33_FP_PIDR5_BITS, 0x00000000
.equ	M33_FP_PIDR5_RESET, 0x00000000
.equ	M33_FP_PIDR5_MSB, 31
.equ	M33_FP_PIDR5_LSB, 0
# =============================================================================
# Register    : M33_FP_PIDR6
# Description : Provides CoreSight discovery information for the FP
.equ	M33_FP_PIDR6_OFFSET, 0x00002fd8
.equ	M33_FP_PIDR6_BITS, 0x00000000
.equ	M33_FP_PIDR6_RESET, 0x00000000
.equ	M33_FP_PIDR6_MSB, 31
.equ	M33_FP_PIDR6_LSB, 0
# =============================================================================
# Register    : M33_FP_PIDR7
# Description : Provides CoreSight discovery information for the FP
.equ	M33_FP_PIDR7_OFFSET, 0x00002fdc
.equ	M33_FP_PIDR7_BITS, 0x00000000
.equ	M33_FP_PIDR7_RESET, 0x00000000
.equ	M33_FP_PIDR7_MSB, 31
.equ	M33_FP_PIDR7_LSB, 0
# =============================================================================
# Register    : M33_FP_PIDR0
# Description : Provides CoreSight discovery information for the FP
.equ	M33_FP_PIDR0_OFFSET, 0x00002fe0
.equ	M33_FP_PIDR0_BITS, 0x000000ff
.equ	M33_FP_PIDR0_RESET, 0x00000021
# -----------------------------------------------------------------------------
# Field       : M33_FP_PIDR0_PART_0
# Description : See CoreSight Architecture Specification
.equ	M33_FP_PIDR0_PART_0_RESET, 0x21
.equ	M33_FP_PIDR0_PART_0_BITS, 0x000000ff
.equ	M33_FP_PIDR0_PART_0_MSB, 7
.equ	M33_FP_PIDR0_PART_0_LSB, 0
# =============================================================================
# Register    : M33_FP_PIDR1
# Description : Provides CoreSight discovery information for the FP
.equ	M33_FP_PIDR1_OFFSET, 0x00002fe4
.equ	M33_FP_PIDR1_BITS, 0x000000ff
.equ	M33_FP_PIDR1_RESET, 0x000000bd
# -----------------------------------------------------------------------------
# Field       : M33_FP_PIDR1_DES_0
# Description : See CoreSight Architecture Specification
.equ	M33_FP_PIDR1_DES_0_RESET, 0xb
.equ	M33_FP_PIDR1_DES_0_BITS, 0x000000f0
.equ	M33_FP_PIDR1_DES_0_MSB, 7
.equ	M33_FP_PIDR1_DES_0_LSB, 4
# -----------------------------------------------------------------------------
# Field       : M33_FP_PIDR1_PART_1
# Description : See CoreSight Architecture Specification
.equ	M33_FP_PIDR1_PART_1_RESET, 0xd
.equ	M33_FP_PIDR1_PART_1_BITS, 0x0000000f
.equ	M33_FP_PIDR1_PART_1_MSB, 3
.equ	M33_FP_PIDR1_PART_1_LSB, 0
# =============================================================================
# Register    : M33_FP_PIDR2
# Description : Provides CoreSight discovery information for the FP
.equ	M33_FP_PIDR2_OFFSET, 0x00002fe8
.equ	M33_FP_PIDR2_BITS, 0x000000ff
.equ	M33_FP_PIDR2_RESET, 0x0000000b
# -----------------------------------------------------------------------------
# Field       : M33_FP_PIDR2_REVISION
# Description : See CoreSight Architecture Specification
.equ	M33_FP_PIDR2_REVISION_RESET, 0x0
.equ	M33_FP_PIDR2_REVISION_BITS, 0x000000f0
.equ	M33_FP_PIDR2_REVISION_MSB, 7
.equ	M33_FP_PIDR2_REVISION_LSB, 4
# -----------------------------------------------------------------------------
# Field       : M33_FP_PIDR2_JEDEC
# Description : See CoreSight Architecture Specification
.equ	M33_FP_PIDR2_JEDEC_RESET, 0x1
.equ	M33_FP_PIDR2_JEDEC_BITS, 0x00000008
.equ	M33_FP_PIDR2_JEDEC_MSB, 3
.equ	M33_FP_PIDR2_JEDEC_LSB, 3
