konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/m33.inc
# -----------------------------------------------------------------------------
# Field       : M33_FP_PIDR2_DES_1
# Description : See CoreSight Architecture Specification
.equ	M33_FP_PIDR2_DES_1_RESET, 0x3
.equ	M33_FP_PIDR2_DES_1_BITS, 0x00000007
.equ	M33_FP_PIDR2_DES_1_MSB, 2
.equ	M33_FP_PIDR2_DES_1_LSB, 0
# =============================================================================
# Register    : M33_FP_PIDR3
# Description : Provides CoreSight discovery information for the FP
.equ	M33_FP_PIDR3_OFFSET, 0x00002fec
.equ	M33_FP_PIDR3_BITS, 0x000000ff
.equ	M33_FP_PIDR3_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_FP_PIDR3_REVAND
# Description : See CoreSight Architecture Specification
.equ	M33_FP_PIDR3_REVAND_RESET, 0x0
.equ	M33_FP_PIDR3_REVAND_BITS, 0x000000f0
.equ	M33_FP_PIDR3_REVAND_MSB, 7
.equ	M33_FP_PIDR3_REVAND_LSB, 4
# -----------------------------------------------------------------------------
# Field       : M33_FP_PIDR3_CMOD
# Description : See CoreSight Architecture Specification
.equ	M33_FP_PIDR3_CMOD_RESET, 0x0
.equ	M33_FP_PIDR3_CMOD_BITS, 0x0000000f
.equ	M33_FP_PIDR3_CMOD_MSB, 3
.equ	M33_FP_PIDR3_CMOD_LSB, 0
# =============================================================================
# Register    : M33_FP_CIDR0
# Description : Provides CoreSight discovery information for the FP
.equ	M33_FP_CIDR0_OFFSET, 0x00002ff0
.equ	M33_FP_CIDR0_BITS, 0x000000ff
.equ	M33_FP_CIDR0_RESET, 0x0000000d
# -----------------------------------------------------------------------------
# Field       : M33_FP_CIDR0_PRMBL_0
# Description : See CoreSight Architecture Specification
.equ	M33_FP_CIDR0_PRMBL_0_RESET, 0x0d
.equ	M33_FP_CIDR0_PRMBL_0_BITS, 0x000000ff
.equ	M33_FP_CIDR0_PRMBL_0_MSB, 7
.equ	M33_FP_CIDR0_PRMBL_0_LSB, 0
# =============================================================================
# Register    : M33_FP_CIDR1
# Description : Provides CoreSight discovery information for the FP
.equ	M33_FP_CIDR1_OFFSET, 0x00002ff4
.equ	M33_FP_CIDR1_BITS, 0x000000ff
.equ	M33_FP_CIDR1_RESET, 0x00000090
# -----------------------------------------------------------------------------
# Field       : M33_FP_CIDR1_CLASS
# Description : See CoreSight Architecture Specification
.equ	M33_FP_CIDR1_CLASS_RESET, 0x9
.equ	M33_FP_CIDR1_CLASS_BITS, 0x000000f0
.equ	M33_FP_CIDR1_CLASS_MSB, 7
.equ	M33_FP_CIDR1_CLASS_LSB, 4
# -----------------------------------------------------------------------------
# Field       : M33_FP_CIDR1_PRMBL_1
# Description : See CoreSight Architecture Specification
.equ	M33_FP_CIDR1_PRMBL_1_RESET, 0x0
.equ	M33_FP_CIDR1_PRMBL_1_BITS, 0x0000000f
.equ	M33_FP_CIDR1_PRMBL_1_MSB, 3
.equ	M33_FP_CIDR1_PRMBL_1_LSB, 0
# =============================================================================
# Register    : M33_FP_CIDR2
# Description : Provides CoreSight discovery information for the FP
.equ	M33_FP_CIDR2_OFFSET, 0x00002ff8
.equ	M33_FP_CIDR2_BITS, 0x000000ff
.equ	M33_FP_CIDR2_RESET, 0x00000005
# -----------------------------------------------------------------------------
# Field       : M33_FP_CIDR2_PRMBL_2
# Description : See CoreSight Architecture Specification
.equ	M33_FP_CIDR2_PRMBL_2_RESET, 0x05
.equ	M33_FP_CIDR2_PRMBL_2_BITS, 0x000000ff
.equ	M33_FP_CIDR2_PRMBL_2_MSB, 7
.equ	M33_FP_CIDR2_PRMBL_2_LSB, 0
# =============================================================================
# Register    : M33_FP_CIDR3
# Description : Provides CoreSight discovery information for the FP
.equ	M33_FP_CIDR3_OFFSET, 0x00002ffc
.equ	M33_FP_CIDR3_BITS, 0x000000ff
.equ	M33_FP_CIDR3_RESET, 0x000000b1
# -----------------------------------------------------------------------------
# Field       : M33_FP_CIDR3_PRMBL_3
# Description : See CoreSight Architecture Specification
.equ	M33_FP_CIDR3_PRMBL_3_RESET, 0xb1
.equ	M33_FP_CIDR3_PRMBL_3_BITS, 0x000000ff
.equ	M33_FP_CIDR3_PRMBL_3_MSB, 7
.equ	M33_FP_CIDR3_PRMBL_3_LSB, 0
# =============================================================================
# Register    : M33_ICTR
# Description : Provides information about the interrupt controller
.equ	M33_ICTR_OFFSET, 0x0000e004
.equ	M33_ICTR_BITS, 0x0000000f
.equ	M33_ICTR_RESET, 0x00000001
# -----------------------------------------------------------------------------
# Field       : M33_ICTR_INTLINESNUM
# Description : Indicates the number of the highest implemented register in
#               each of the NVIC control register sets, or in the case of
#               NVIC_IPR*n, 4×INTLINESNUM
.equ	M33_ICTR_INTLINESNUM_RESET, 0x1
.equ	M33_ICTR_INTLINESNUM_BITS, 0x0000000f
.equ	M33_ICTR_INTLINESNUM_MSB, 3
.equ	M33_ICTR_INTLINESNUM_LSB, 0
# =============================================================================
# Register    : M33_ACTLR
# Description : Provides IMPLEMENTATION DEFINED configuration and control
#               options
.equ	M33_ACTLR_OFFSET, 0x0000e008
.equ	M33_ACTLR_BITS, 0x20001605
.equ	M33_ACTLR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_ACTLR_EXTEXCLALL
# Description : External Exclusives Allowed with no MPU
.equ	M33_ACTLR_EXTEXCLALL_RESET, 0x0
.equ	M33_ACTLR_EXTEXCLALL_BITS, 0x20000000
.equ	M33_ACTLR_EXTEXCLALL_MSB, 29
.equ	M33_ACTLR_EXTEXCLALL_LSB, 29
# -----------------------------------------------------------------------------
# Field       : M33_ACTLR_DISITMATBFLUSH
# Description : Disable ATB Flush
.equ	M33_ACTLR_DISITMATBFLUSH_RESET, 0x0
.equ	M33_ACTLR_DISITMATBFLUSH_BITS, 0x00001000
.equ	M33_ACTLR_DISITMATBFLUSH_MSB, 12
.equ	M33_ACTLR_DISITMATBFLUSH_LSB, 12
# -----------------------------------------------------------------------------
# Field       : M33_ACTLR_FPEXCODIS
# Description : Disable FPU exception outputs
.equ	M33_ACTLR_FPEXCODIS_RESET, 0x0
.equ	M33_ACTLR_FPEXCODIS_BITS, 0x00000400
.equ	M33_ACTLR_FPEXCODIS_MSB, 10
.equ	M33_ACTLR_FPEXCODIS_LSB, 10
# -----------------------------------------------------------------------------
# Field       : M33_ACTLR_DISOOFP
# Description : Disable out-of-order FP instruction completion
.equ	M33_ACTLR_DISOOFP_RESET, 0x0
.equ	M33_ACTLR_DISOOFP_BITS, 0x00000200
.equ	M33_ACTLR_DISOOFP_MSB, 9
.equ	M33_ACTLR_DISOOFP_LSB, 9
# -----------------------------------------------------------------------------
# Field       : M33_ACTLR_DISFOLD
# Description : Disable dual-issue.
.equ	M33_ACTLR_DISFOLD_RESET, 0x0
.equ	M33_ACTLR_DISFOLD_BITS, 0x00000004
.equ	M33_ACTLR_DISFOLD_MSB, 2
.equ	M33_ACTLR_DISFOLD_LSB, 2
# -----------------------------------------------------------------------------
# Field       : M33_ACTLR_DISMCYCINT
# Description : Disable dual-issue.
.equ	M33_ACTLR_DISMCYCINT_RESET, 0x0
.equ	M33_ACTLR_DISMCYCINT_BITS, 0x00000001
.equ	M33_ACTLR_DISMCYCINT_MSB, 0
.equ	M33_ACTLR_DISMCYCINT_LSB, 0
# =============================================================================
# Register    : M33_SYST_CSR
# Description : Use the SysTick Control and Status Register to enable the
#               SysTick features.
.equ	M33_SYST_CSR_OFFSET, 0x0000e010
.equ	M33_SYST_CSR_BITS, 0x00010007
.equ	M33_SYST_CSR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_SYST_CSR_COUNTFLAG
# Description : Returns 1 if timer counted to 0 since last time this was read.
#               Clears on read by application or debugger.
.equ	M33_SYST_CSR_COUNTFLAG_RESET, 0x0
.equ	M33_SYST_CSR_COUNTFLAG_BITS, 0x00010000
.equ	M33_SYST_CSR_COUNTFLAG_MSB, 16
.equ	M33_SYST_CSR_COUNTFLAG_LSB, 16
# -----------------------------------------------------------------------------
# Field       : M33_SYST_CSR_CLKSOURCE
# Description : SysTick clock source. Always reads as one if SYST_CALIB reports
#               NOREF.
#               Selects the SysTick timer clock source:
#               0 = External reference clock.
#               1 = Processor clock.
.equ	M33_SYST_CSR_CLKSOURCE_RESET, 0x0
.equ	M33_SYST_CSR_CLKSOURCE_BITS, 0x00000004
.equ	M33_SYST_CSR_CLKSOURCE_MSB, 2
.equ	M33_SYST_CSR_CLKSOURCE_LSB, 2
# -----------------------------------------------------------------------------
# Field       : M33_SYST_CSR_TICKINT
# Description : Enables SysTick exception request:
#               0 = Counting down to zero does not assert the SysTick exception
#               request.
#               1 = Counting down to zero to asserts the SysTick exception
#               request.
.equ	M33_SYST_CSR_TICKINT_RESET, 0x0
.equ	M33_SYST_CSR_TICKINT_BITS, 0x00000002
.equ	M33_SYST_CSR_TICKINT_MSB, 1
.equ	M33_SYST_CSR_TICKINT_LSB, 1
# -----------------------------------------------------------------------------
# Field       : M33_SYST_CSR_ENABLE
# Description : Enable SysTick counter:
#               0 = Counter disabled.
#               1 = Counter enabled.
.equ	M33_SYST_CSR_ENABLE_RESET, 0x0
.equ	M33_SYST_CSR_ENABLE_BITS, 0x00000001
.equ	M33_SYST_CSR_ENABLE_MSB, 0
.equ	M33_SYST_CSR_ENABLE_LSB, 0
# =============================================================================
# Register    : M33_SYST_RVR
# Description : Use the SysTick Reload Value Register to specify the start
#               value to load into the current value register when the counter
#               reaches 0. It can be any value between 0 and 0x00FFFFFF. A
#               start value of 0 is possible, but has no effect because the
#               SysTick interrupt and COUNTFLAG are activated when counting
#               from 1 to 0. The reset value of this register is UNKNOWN.
#               To generate a multi-shot timer with a period of N processor
#               clock cycles, use a RELOAD value of N-1. For example, if the
#               SysTick interrupt is required every 100 clock pulses, set
#               RELOAD to 99.
.equ	M33_SYST_RVR_OFFSET, 0x0000e014
.equ	M33_SYST_RVR_BITS, 0x00ffffff
.equ	M33_SYST_RVR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_SYST_RVR_RELOAD
# Description : Value to load into the SysTick Current Value Register when the
#               counter reaches 0.
.equ	M33_SYST_RVR_RELOAD_RESET, 0x000000
.equ	M33_SYST_RVR_RELOAD_BITS, 0x00ffffff
.equ	M33_SYST_RVR_RELOAD_MSB, 23
.equ	M33_SYST_RVR_RELOAD_LSB, 0
# =============================================================================
# Register    : M33_SYST_CVR
# Description : Use the SysTick Current Value Register to find the current
#               value in the register. The reset value of this register is
#               UNKNOWN.
.equ	M33_SYST_CVR_OFFSET, 0x0000e018
.equ	M33_SYST_CVR_BITS, 0x00ffffff
.equ	M33_SYST_CVR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_SYST_CVR_CURRENT
# Description : Reads return the current value of the SysTick counter. This
#               register is write-clear. Writing to it with any value clears
#               the register to 0. Clearing this register also clears the
#               COUNTFLAG bit of the SysTick Control and Status Register.
.equ	M33_SYST_CVR_CURRENT_RESET, 0x000000
.equ	M33_SYST_CVR_CURRENT_BITS, 0x00ffffff
.equ	M33_SYST_CVR_CURRENT_MSB, 23
.equ	M33_SYST_CVR_CURRENT_LSB, 0
# =============================================================================
# Register    : M33_SYST_CALIB
# Description : Use the SysTick Calibration Value Register to enable software
#               to scale to any required speed using divide and multiply.
.equ	M33_SYST_CALIB_OFFSET, 0x0000e01c
.equ	M33_SYST_CALIB_BITS, 0xc0ffffff
.equ	M33_SYST_CALIB_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_SYST_CALIB_NOREF
# Description : If reads as 1, the Reference clock is not provided - the
#               CLKSOURCE bit of the SysTick Control and Status register will
#               be forced to 1 and cannot be cleared to 0.
.equ	M33_SYST_CALIB_NOREF_RESET, 0x0
.equ	M33_SYST_CALIB_NOREF_BITS, 0x80000000
.equ	M33_SYST_CALIB_NOREF_MSB, 31
.equ	M33_SYST_CALIB_NOREF_LSB, 31
# -----------------------------------------------------------------------------
# Field       : M33_SYST_CALIB_SKEW
# Description : If reads as 1, the calibration value for 10ms is inexact (due
#               to clock frequency).
.equ	M33_SYST_CALIB_SKEW_RESET, 0x0
.equ	M33_SYST_CALIB_SKEW_BITS, 0x40000000
.equ	M33_SYST_CALIB_SKEW_MSB, 30
.equ	M33_SYST_CALIB_SKEW_LSB, 30
# -----------------------------------------------------------------------------
# Field       : M33_SYST_CALIB_TENMS
# Description : An optional Reload value to be used for 10ms (100Hz) timing,
#               subject to system clock skew errors. If the value reads as 0,
#               the calibration value is not known.
.equ	M33_SYST_CALIB_TENMS_RESET, 0x000000
.equ	M33_SYST_CALIB_TENMS_BITS, 0x00ffffff
.equ	M33_SYST_CALIB_TENMS_MSB, 23
.equ	M33_SYST_CALIB_TENMS_LSB, 0
# =============================================================================
# Register    : M33_NVIC_ISER0
# Description : Enables or reads the enabled state of each group of 32
#               interrupts
.equ	M33_NVIC_ISER0_OFFSET, 0x0000e100
.equ	M33_NVIC_ISER0_BITS, 0xffffffff
.equ	M33_NVIC_ISER0_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_ISER0_SETENA
# Description : For SETENA[m] in NVIC_ISER*n, indicates whether interrupt 32*n
#               + m is enabled
.equ	M33_NVIC_ISER0_SETENA_RESET, 0x00000000
.equ	M33_NVIC_ISER0_SETENA_BITS, 0xffffffff
.equ	M33_NVIC_ISER0_SETENA_MSB, 31
.equ	M33_NVIC_ISER0_SETENA_LSB, 0
# =============================================================================
# Register    : M33_NVIC_ISER1
# Description : Enables or reads the enabled state of each group of 32
#               interrupts
.equ	M33_NVIC_ISER1_OFFSET, 0x0000e104
.equ	M33_NVIC_ISER1_BITS, 0xffffffff
.equ	M33_NVIC_ISER1_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_ISER1_SETENA
# Description : For SETENA[m] in NVIC_ISER*n, indicates whether interrupt 32*n
#               + m is enabled
.equ	M33_NVIC_ISER1_SETENA_RESET, 0x00000000
.equ	M33_NVIC_ISER1_SETENA_BITS, 0xffffffff
.equ	M33_NVIC_ISER1_SETENA_MSB, 31
.equ	M33_NVIC_ISER1_SETENA_LSB, 0
# =============================================================================
# Register    : M33_NVIC_ICER0
# Description : Clears or reads the enabled state of each group of 32
#               interrupts
.equ	M33_NVIC_ICER0_OFFSET, 0x0000e180
.equ	M33_NVIC_ICER0_BITS, 0xffffffff
.equ	M33_NVIC_ICER0_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_ICER0_CLRENA
# Description : For CLRENA[m] in NVIC_ICER*n, indicates whether interrupt 32*n
#               + m is enabled
.equ	M33_NVIC_ICER0_CLRENA_RESET, 0x00000000
.equ	M33_NVIC_ICER0_CLRENA_BITS, 0xffffffff
.equ	M33_NVIC_ICER0_CLRENA_MSB, 31
.equ	M33_NVIC_ICER0_CLRENA_LSB, 0
# =============================================================================
# Register    : M33_NVIC_ICER1
# Description : Clears or reads the enabled state of each group of 32
#               interrupts
.equ	M33_NVIC_ICER1_OFFSET, 0x0000e184
.equ	M33_NVIC_ICER1_BITS, 0xffffffff
.equ	M33_NVIC_ICER1_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_ICER1_CLRENA
# Description : For CLRENA[m] in NVIC_ICER*n, indicates whether interrupt 32*n
#               + m is enabled
.equ	M33_NVIC_ICER1_CLRENA_RESET, 0x00000000
.equ	M33_NVIC_ICER1_CLRENA_BITS, 0xffffffff
.equ	M33_NVIC_ICER1_CLRENA_MSB, 31
.equ	M33_NVIC_ICER1_CLRENA_LSB, 0
# =============================================================================
# Register    : M33_NVIC_ISPR0
# Description : Enables or reads the pending state of each group of 32
#               interrupts
.equ	M33_NVIC_ISPR0_OFFSET, 0x0000e200
.equ	M33_NVIC_ISPR0_BITS, 0xffffffff
.equ	M33_NVIC_ISPR0_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_ISPR0_SETPEND
# Description : For SETPEND[m] in NVIC_ISPR*n, indicates whether interrupt 32*n
#               + m is pending
.equ	M33_NVIC_ISPR0_SETPEND_RESET, 0x00000000
.equ	M33_NVIC_ISPR0_SETPEND_BITS, 0xffffffff
.equ	M33_NVIC_ISPR0_SETPEND_MSB, 31
.equ	M33_NVIC_ISPR0_SETPEND_LSB, 0
# =============================================================================
# Register    : M33_NVIC_ISPR1
# Description : Enables or reads the pending state of each group of 32
#               interrupts
.equ	M33_NVIC_ISPR1_OFFSET, 0x0000e204
.equ	M33_NVIC_ISPR1_BITS, 0xffffffff
.equ	M33_NVIC_ISPR1_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_ISPR1_SETPEND
# Description : For SETPEND[m] in NVIC_ISPR*n, indicates whether interrupt 32*n
#               + m is pending
.equ	M33_NVIC_ISPR1_SETPEND_RESET, 0x00000000
.equ	M33_NVIC_ISPR1_SETPEND_BITS, 0xffffffff
.equ	M33_NVIC_ISPR1_SETPEND_MSB, 31
.equ	M33_NVIC_ISPR1_SETPEND_LSB, 0
# =============================================================================
# Register    : M33_NVIC_ICPR0
# Description : Clears or reads the pending state of each group of 32
#               interrupts
.equ	M33_NVIC_ICPR0_OFFSET, 0x0000e280
.equ	M33_NVIC_ICPR0_BITS, 0xffffffff
.equ	M33_NVIC_ICPR0_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_ICPR0_CLRPEND
# Description : For CLRPEND[m] in NVIC_ICPR*n, indicates whether interrupt 32*n
#               + m is pending
.equ	M33_NVIC_ICPR0_CLRPEND_RESET, 0x00000000
.equ	M33_NVIC_ICPR0_CLRPEND_BITS, 0xffffffff
.equ	M33_NVIC_ICPR0_CLRPEND_MSB, 31
.equ	M33_NVIC_ICPR0_CLRPEND_LSB, 0
# =============================================================================
# Register    : M33_NVIC_ICPR1
# Description : Clears or reads the pending state of each group of 32
#               interrupts
.equ	M33_NVIC_ICPR1_OFFSET, 0x0000e284
.equ	M33_NVIC_ICPR1_BITS, 0xffffffff
.equ	M33_NVIC_ICPR1_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_ICPR1_CLRPEND
# Description : For CLRPEND[m] in NVIC_ICPR*n, indicates whether interrupt 32*n
#               + m is pending
.equ	M33_NVIC_ICPR1_CLRPEND_RESET, 0x00000000
.equ	M33_NVIC_ICPR1_CLRPEND_BITS, 0xffffffff
.equ	M33_NVIC_ICPR1_CLRPEND_MSB, 31
.equ	M33_NVIC_ICPR1_CLRPEND_LSB, 0
# =============================================================================
# Register    : M33_NVIC_IABR0
# Description : For each group of 32 interrupts, shows the active state of each
#               interrupt
.equ	M33_NVIC_IABR0_OFFSET, 0x0000e300
.equ	M33_NVIC_IABR0_BITS, 0xffffffff
.equ	M33_NVIC_IABR0_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_IABR0_ACTIVE
# Description : For ACTIVE[m] in NVIC_IABR*n, indicates the active state for
#               interrupt 32*n+m
.equ	M33_NVIC_IABR0_ACTIVE_RESET, 0x00000000
.equ	M33_NVIC_IABR0_ACTIVE_BITS, 0xffffffff
.equ	M33_NVIC_IABR0_ACTIVE_MSB, 31
.equ	M33_NVIC_IABR0_ACTIVE_LSB, 0
# =============================================================================
# Register    : M33_NVIC_IABR1
# Description : For each group of 32 interrupts, shows the active state of each
#               interrupt
.equ	M33_NVIC_IABR1_OFFSET, 0x0000e304
.equ	M33_NVIC_IABR1_BITS, 0xffffffff
.equ	M33_NVIC_IABR1_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_IABR1_ACTIVE
# Description : For ACTIVE[m] in NVIC_IABR*n, indicates the active state for
#               interrupt 32*n+m
.equ	M33_NVIC_IABR1_ACTIVE_RESET, 0x00000000
.equ	M33_NVIC_IABR1_ACTIVE_BITS, 0xffffffff
.equ	M33_NVIC_IABR1_ACTIVE_MSB, 31
.equ	M33_NVIC_IABR1_ACTIVE_LSB, 0
# =============================================================================
# Register    : M33_NVIC_ITNS0
# Description : For each group of 32 interrupts, determines whether each
#               interrupt targets Non-secure or Secure state
.equ	M33_NVIC_ITNS0_OFFSET, 0x0000e380
.equ	M33_NVIC_ITNS0_BITS, 0xffffffff
.equ	M33_NVIC_ITNS0_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_ITNS0_ITNS
# Description : For ITNS[m] in NVIC_ITNS*n, `IAAMO the target Security state
#               for interrupt 32*n+m
.equ	M33_NVIC_ITNS0_ITNS_RESET, 0x00000000
.equ	M33_NVIC_ITNS0_ITNS_BITS, 0xffffffff
.equ	M33_NVIC_ITNS0_ITNS_MSB, 31
.equ	M33_NVIC_ITNS0_ITNS_LSB, 0
# =============================================================================
# Register    : M33_NVIC_ITNS1
# Description : For each group of 32 interrupts, determines whether each
#               interrupt targets Non-secure or Secure state
.equ	M33_NVIC_ITNS1_OFFSET, 0x0000e384
.equ	M33_NVIC_ITNS1_BITS, 0xffffffff
.equ	M33_NVIC_ITNS1_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_ITNS1_ITNS
# Description : For ITNS[m] in NVIC_ITNS*n, `IAAMO the target Security state
#               for interrupt 32*n+m
.equ	M33_NVIC_ITNS1_ITNS_RESET, 0x00000000
.equ	M33_NVIC_ITNS1_ITNS_BITS, 0xffffffff
.equ	M33_NVIC_ITNS1_ITNS_MSB, 31
.equ	M33_NVIC_ITNS1_ITNS_LSB, 0
# =============================================================================
# Register    : M33_NVIC_IPR0
# Description : Sets or reads interrupt priorities
.equ	M33_NVIC_IPR0_OFFSET, 0x0000e400
.equ	M33_NVIC_IPR0_BITS, 0xf0f0f0f0
.equ	M33_NVIC_IPR0_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_IPR0_PRI_N3
# Description : For register NVIC_IPRn, the priority of interrupt number 4*n+3,
#               or RES0 if the PE does not implement this interrupt
.equ	M33_NVIC_IPR0_PRI_N3_RESET, 0x0
.equ	M33_NVIC_IPR0_PRI_N3_BITS, 0xf0000000
.equ	M33_NVIC_IPR0_PRI_N3_MSB, 31
.equ	M33_NVIC_IPR0_PRI_N3_LSB, 28
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_IPR0_PRI_N2
# Description : For register NVIC_IPRn, the priority of interrupt number 4*n+2,
#               or RES0 if the PE does not implement this interrupt
.equ	M33_NVIC_IPR0_PRI_N2_RESET, 0x0
.equ	M33_NVIC_IPR0_PRI_N2_BITS, 0x00f00000
.equ	M33_NVIC_IPR0_PRI_N2_MSB, 23
.equ	M33_NVIC_IPR0_PRI_N2_LSB, 20
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_IPR0_PRI_N1
# Description : For register NVIC_IPRn, the priority of interrupt number 4*n+1,
#               or RES0 if the PE does not implement this interrupt
.equ	M33_NVIC_IPR0_PRI_N1_RESET, 0x0
.equ	M33_NVIC_IPR0_PRI_N1_BITS, 0x0000f000
.equ	M33_NVIC_IPR0_PRI_N1_MSB, 15
.equ	M33_NVIC_IPR0_PRI_N1_LSB, 12
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_IPR0_PRI_N0
# Description : For register NVIC_IPRn, the priority of interrupt number 4*n+0,
#               or RES0 if the PE does not implement this interrupt
.equ	M33_NVIC_IPR0_PRI_N0_RESET, 0x0
.equ	M33_NVIC_IPR0_PRI_N0_BITS, 0x000000f0
.equ	M33_NVIC_IPR0_PRI_N0_MSB, 7
.equ	M33_NVIC_IPR0_PRI_N0_LSB, 4
# =============================================================================
# Register    : M33_NVIC_IPR1
# Description : Sets or reads interrupt priorities
.equ	M33_NVIC_IPR1_OFFSET, 0x0000e404
.equ	M33_NVIC_IPR1_BITS, 0xf0f0f0f0
.equ	M33_NVIC_IPR1_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_IPR1_PRI_N3
# Description : For register NVIC_IPRn, the priority of interrupt number 4*n+3,
#               or RES0 if the PE does not implement this interrupt
