konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/m33.inc
.equ	M33_NVIC_IPR1_PRI_N3_RESET, 0x0
.equ	M33_NVIC_IPR1_PRI_N3_BITS, 0xf0000000
.equ	M33_NVIC_IPR1_PRI_N3_MSB, 31
.equ	M33_NVIC_IPR1_PRI_N3_LSB, 28
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_IPR1_PRI_N2
# Description : For register NVIC_IPRn, the priority of interrupt number 4*n+2,
#               or RES0 if the PE does not implement this interrupt
.equ	M33_NVIC_IPR1_PRI_N2_RESET, 0x0
.equ	M33_NVIC_IPR1_PRI_N2_BITS, 0x00f00000
.equ	M33_NVIC_IPR1_PRI_N2_MSB, 23
.equ	M33_NVIC_IPR1_PRI_N2_LSB, 20
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_IPR1_PRI_N1
# Description : For register NVIC_IPRn, the priority of interrupt number 4*n+1,
#               or RES0 if the PE does not implement this interrupt
.equ	M33_NVIC_IPR1_PRI_N1_RESET, 0x0
.equ	M33_NVIC_IPR1_PRI_N1_BITS, 0x0000f000
.equ	M33_NVIC_IPR1_PRI_N1_MSB, 15
.equ	M33_NVIC_IPR1_PRI_N1_LSB, 12
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_IPR1_PRI_N0
# Description : For register NVIC_IPRn, the priority of interrupt number 4*n+0,
#               or RES0 if the PE does not implement this interrupt
.equ	M33_NVIC_IPR1_PRI_N0_RESET, 0x0
.equ	M33_NVIC_IPR1_PRI_N0_BITS, 0x000000f0
.equ	M33_NVIC_IPR1_PRI_N0_MSB, 7
.equ	M33_NVIC_IPR1_PRI_N0_LSB, 4
# =============================================================================
# Register    : M33_NVIC_IPR2
# Description : Sets or reads interrupt priorities
.equ	M33_NVIC_IPR2_OFFSET, 0x0000e408
.equ	M33_NVIC_IPR2_BITS, 0xf0f0f0f0
.equ	M33_NVIC_IPR2_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_IPR2_PRI_N3
# Description : For register NVIC_IPRn, the priority of interrupt number 4*n+3,
#               or RES0 if the PE does not implement this interrupt
.equ	M33_NVIC_IPR2_PRI_N3_RESET, 0x0
.equ	M33_NVIC_IPR2_PRI_N3_BITS, 0xf0000000
.equ	M33_NVIC_IPR2_PRI_N3_MSB, 31
.equ	M33_NVIC_IPR2_PRI_N3_LSB, 28
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_IPR2_PRI_N2
# Description : For register NVIC_IPRn, the priority of interrupt number 4*n+2,
#               or RES0 if the PE does not implement this interrupt
.equ	M33_NVIC_IPR2_PRI_N2_RESET, 0x0
.equ	M33_NVIC_IPR2_PRI_N2_BITS, 0x00f00000
.equ	M33_NVIC_IPR2_PRI_N2_MSB, 23
.equ	M33_NVIC_IPR2_PRI_N2_LSB, 20
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_IPR2_PRI_N1
# Description : For register NVIC_IPRn, the priority of interrupt number 4*n+1,
#               or RES0 if the PE does not implement this interrupt
.equ	M33_NVIC_IPR2_PRI_N1_RESET, 0x0
.equ	M33_NVIC_IPR2_PRI_N1_BITS, 0x0000f000
.equ	M33_NVIC_IPR2_PRI_N1_MSB, 15
.equ	M33_NVIC_IPR2_PRI_N1_LSB, 12
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_IPR2_PRI_N0
# Description : For register NVIC_IPRn, the priority of interrupt number 4*n+0,
#               or RES0 if the PE does not implement this interrupt
.equ	M33_NVIC_IPR2_PRI_N0_RESET, 0x0
.equ	M33_NVIC_IPR2_PRI_N0_BITS, 0x000000f0
.equ	M33_NVIC_IPR2_PRI_N0_MSB, 7
.equ	M33_NVIC_IPR2_PRI_N0_LSB, 4
# =============================================================================
# Register    : M33_NVIC_IPR3
# Description : Sets or reads interrupt priorities
.equ	M33_NVIC_IPR3_OFFSET, 0x0000e40c
.equ	M33_NVIC_IPR3_BITS, 0xf0f0f0f0
.equ	M33_NVIC_IPR3_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_IPR3_PRI_N3
# Description : For register NVIC_IPRn, the priority of interrupt number 4*n+3,
#               or RES0 if the PE does not implement this interrupt
.equ	M33_NVIC_IPR3_PRI_N3_RESET, 0x0
.equ	M33_NVIC_IPR3_PRI_N3_BITS, 0xf0000000
.equ	M33_NVIC_IPR3_PRI_N3_MSB, 31
.equ	M33_NVIC_IPR3_PRI_N3_LSB, 28
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_IPR3_PRI_N2
# Description : For register NVIC_IPRn, the priority of interrupt number 4*n+2,
#               or RES0 if the PE does not implement this interrupt
.equ	M33_NVIC_IPR3_PRI_N2_RESET, 0x0
.equ	M33_NVIC_IPR3_PRI_N2_BITS, 0x00f00000
.equ	M33_NVIC_IPR3_PRI_N2_MSB, 23
.equ	M33_NVIC_IPR3_PRI_N2_LSB, 20
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_IPR3_PRI_N1
# Description : For register NVIC_IPRn, the priority of interrupt number 4*n+1,
#               or RES0 if the PE does not implement this interrupt
.equ	M33_NVIC_IPR3_PRI_N1_RESET, 0x0
.equ	M33_NVIC_IPR3_PRI_N1_BITS, 0x0000f000
.equ	M33_NVIC_IPR3_PRI_N1_MSB, 15
.equ	M33_NVIC_IPR3_PRI_N1_LSB, 12
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_IPR3_PRI_N0
# Description : For register NVIC_IPRn, the priority of interrupt number 4*n+0,
#               or RES0 if the PE does not implement this interrupt
.equ	M33_NVIC_IPR3_PRI_N0_RESET, 0x0
.equ	M33_NVIC_IPR3_PRI_N0_BITS, 0x000000f0
.equ	M33_NVIC_IPR3_PRI_N0_MSB, 7
.equ	M33_NVIC_IPR3_PRI_N0_LSB, 4
# =============================================================================
# Register    : M33_NVIC_IPR4
# Description : Sets or reads interrupt priorities
.equ	M33_NVIC_IPR4_OFFSET, 0x0000e410
.equ	M33_NVIC_IPR4_BITS, 0xf0f0f0f0
.equ	M33_NVIC_IPR4_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_IPR4_PRI_N3
# Description : For register NVIC_IPRn, the priority of interrupt number 4*n+3,
#               or RES0 if the PE does not implement this interrupt
.equ	M33_NVIC_IPR4_PRI_N3_RESET, 0x0
.equ	M33_NVIC_IPR4_PRI_N3_BITS, 0xf0000000
.equ	M33_NVIC_IPR4_PRI_N3_MSB, 31
.equ	M33_NVIC_IPR4_PRI_N3_LSB, 28
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_IPR4_PRI_N2
# Description : For register NVIC_IPRn, the priority of interrupt number 4*n+2,
#               or RES0 if the PE does not implement this interrupt
.equ	M33_NVIC_IPR4_PRI_N2_RESET, 0x0
.equ	M33_NVIC_IPR4_PRI_N2_BITS, 0x00f00000
.equ	M33_NVIC_IPR4_PRI_N2_MSB, 23
.equ	M33_NVIC_IPR4_PRI_N2_LSB, 20
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_IPR4_PRI_N1
# Description : For register NVIC_IPRn, the priority of interrupt number 4*n+1,
#               or RES0 if the PE does not implement this interrupt
.equ	M33_NVIC_IPR4_PRI_N1_RESET, 0x0
.equ	M33_NVIC_IPR4_PRI_N1_BITS, 0x0000f000
.equ	M33_NVIC_IPR4_PRI_N1_MSB, 15
.equ	M33_NVIC_IPR4_PRI_N1_LSB, 12
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_IPR4_PRI_N0
# Description : For register NVIC_IPRn, the priority of interrupt number 4*n+0,
#               or RES0 if the PE does not implement this interrupt
.equ	M33_NVIC_IPR4_PRI_N0_RESET, 0x0
.equ	M33_NVIC_IPR4_PRI_N0_BITS, 0x000000f0
.equ	M33_NVIC_IPR4_PRI_N0_MSB, 7
.equ	M33_NVIC_IPR4_PRI_N0_LSB, 4
# =============================================================================
# Register    : M33_NVIC_IPR5
# Description : Sets or reads interrupt priorities
.equ	M33_NVIC_IPR5_OFFSET, 0x0000e414
.equ	M33_NVIC_IPR5_BITS, 0xf0f0f0f0
.equ	M33_NVIC_IPR5_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_IPR5_PRI_N3
# Description : For register NVIC_IPRn, the priority of interrupt number 4*n+3,
#               or RES0 if the PE does not implement this interrupt
.equ	M33_NVIC_IPR5_PRI_N3_RESET, 0x0
.equ	M33_NVIC_IPR5_PRI_N3_BITS, 0xf0000000
.equ	M33_NVIC_IPR5_PRI_N3_MSB, 31
.equ	M33_NVIC_IPR5_PRI_N3_LSB, 28
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_IPR5_PRI_N2
# Description : For register NVIC_IPRn, the priority of interrupt number 4*n+2,
#               or RES0 if the PE does not implement this interrupt
.equ	M33_NVIC_IPR5_PRI_N2_RESET, 0x0
.equ	M33_NVIC_IPR5_PRI_N2_BITS, 0x00f00000
.equ	M33_NVIC_IPR5_PRI_N2_MSB, 23
.equ	M33_NVIC_IPR5_PRI_N2_LSB, 20
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_IPR5_PRI_N1
# Description : For register NVIC_IPRn, the priority of interrupt number 4*n+1,
#               or RES0 if the PE does not implement this interrupt
.equ	M33_NVIC_IPR5_PRI_N1_RESET, 0x0
.equ	M33_NVIC_IPR5_PRI_N1_BITS, 0x0000f000
.equ	M33_NVIC_IPR5_PRI_N1_MSB, 15
.equ	M33_NVIC_IPR5_PRI_N1_LSB, 12
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_IPR5_PRI_N0
# Description : For register NVIC_IPRn, the priority of interrupt number 4*n+0,
#               or RES0 if the PE does not implement this interrupt
.equ	M33_NVIC_IPR5_PRI_N0_RESET, 0x0
.equ	M33_NVIC_IPR5_PRI_N0_BITS, 0x000000f0
.equ	M33_NVIC_IPR5_PRI_N0_MSB, 7
.equ	M33_NVIC_IPR5_PRI_N0_LSB, 4
# =============================================================================
# Register    : M33_NVIC_IPR6
# Description : Sets or reads interrupt priorities
.equ	M33_NVIC_IPR6_OFFSET, 0x0000e418
.equ	M33_NVIC_IPR6_BITS, 0xf0f0f0f0
.equ	M33_NVIC_IPR6_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_IPR6_PRI_N3
# Description : For register NVIC_IPRn, the priority of interrupt number 4*n+3,
#               or RES0 if the PE does not implement this interrupt
.equ	M33_NVIC_IPR6_PRI_N3_RESET, 0x0
.equ	M33_NVIC_IPR6_PRI_N3_BITS, 0xf0000000
.equ	M33_NVIC_IPR6_PRI_N3_MSB, 31
.equ	M33_NVIC_IPR6_PRI_N3_LSB, 28
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_IPR6_PRI_N2
# Description : For register NVIC_IPRn, the priority of interrupt number 4*n+2,
#               or RES0 if the PE does not implement this interrupt
.equ	M33_NVIC_IPR6_PRI_N2_RESET, 0x0
.equ	M33_NVIC_IPR6_PRI_N2_BITS, 0x00f00000
.equ	M33_NVIC_IPR6_PRI_N2_MSB, 23
.equ	M33_NVIC_IPR6_PRI_N2_LSB, 20
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_IPR6_PRI_N1
# Description : For register NVIC_IPRn, the priority of interrupt number 4*n+1,
#               or RES0 if the PE does not implement this interrupt
.equ	M33_NVIC_IPR6_PRI_N1_RESET, 0x0
.equ	M33_NVIC_IPR6_PRI_N1_BITS, 0x0000f000
.equ	M33_NVIC_IPR6_PRI_N1_MSB, 15
.equ	M33_NVIC_IPR6_PRI_N1_LSB, 12
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_IPR6_PRI_N0
# Description : For register NVIC_IPRn, the priority of interrupt number 4*n+0,
#               or RES0 if the PE does not implement this interrupt
.equ	M33_NVIC_IPR6_PRI_N0_RESET, 0x0
.equ	M33_NVIC_IPR6_PRI_N0_BITS, 0x000000f0
.equ	M33_NVIC_IPR6_PRI_N0_MSB, 7
.equ	M33_NVIC_IPR6_PRI_N0_LSB, 4
# =============================================================================
# Register    : M33_NVIC_IPR7
# Description : Sets or reads interrupt priorities
.equ	M33_NVIC_IPR7_OFFSET, 0x0000e41c
.equ	M33_NVIC_IPR7_BITS, 0xf0f0f0f0
.equ	M33_NVIC_IPR7_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_IPR7_PRI_N3
# Description : For register NVIC_IPRn, the priority of interrupt number 4*n+3,
#               or RES0 if the PE does not implement this interrupt
.equ	M33_NVIC_IPR7_PRI_N3_RESET, 0x0
.equ	M33_NVIC_IPR7_PRI_N3_BITS, 0xf0000000
.equ	M33_NVIC_IPR7_PRI_N3_MSB, 31
.equ	M33_NVIC_IPR7_PRI_N3_LSB, 28
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_IPR7_PRI_N2
# Description : For register NVIC_IPRn, the priority of interrupt number 4*n+2,
#               or RES0 if the PE does not implement this interrupt
.equ	M33_NVIC_IPR7_PRI_N2_RESET, 0x0
.equ	M33_NVIC_IPR7_PRI_N2_BITS, 0x00f00000
.equ	M33_NVIC_IPR7_PRI_N2_MSB, 23
.equ	M33_NVIC_IPR7_PRI_N2_LSB, 20
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_IPR7_PRI_N1
# Description : For register NVIC_IPRn, the priority of interrupt number 4*n+1,
#               or RES0 if the PE does not implement this interrupt
.equ	M33_NVIC_IPR7_PRI_N1_RESET, 0x0
.equ	M33_NVIC_IPR7_PRI_N1_BITS, 0x0000f000
.equ	M33_NVIC_IPR7_PRI_N1_MSB, 15
.equ	M33_NVIC_IPR7_PRI_N1_LSB, 12
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_IPR7_PRI_N0
# Description : For register NVIC_IPRn, the priority of interrupt number 4*n+0,
#               or RES0 if the PE does not implement this interrupt
.equ	M33_NVIC_IPR7_PRI_N0_RESET, 0x0
.equ	M33_NVIC_IPR7_PRI_N0_BITS, 0x000000f0
.equ	M33_NVIC_IPR7_PRI_N0_MSB, 7
.equ	M33_NVIC_IPR7_PRI_N0_LSB, 4
# =============================================================================
# Register    : M33_NVIC_IPR8
# Description : Sets or reads interrupt priorities
.equ	M33_NVIC_IPR8_OFFSET, 0x0000e420
.equ	M33_NVIC_IPR8_BITS, 0xf0f0f0f0
.equ	M33_NVIC_IPR8_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_IPR8_PRI_N3
# Description : For register NVIC_IPRn, the priority of interrupt number 4*n+3,
#               or RES0 if the PE does not implement this interrupt
.equ	M33_NVIC_IPR8_PRI_N3_RESET, 0x0
.equ	M33_NVIC_IPR8_PRI_N3_BITS, 0xf0000000
.equ	M33_NVIC_IPR8_PRI_N3_MSB, 31
.equ	M33_NVIC_IPR8_PRI_N3_LSB, 28
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_IPR8_PRI_N2
# Description : For register NVIC_IPRn, the priority of interrupt number 4*n+2,
#               or RES0 if the PE does not implement this interrupt
.equ	M33_NVIC_IPR8_PRI_N2_RESET, 0x0
.equ	M33_NVIC_IPR8_PRI_N2_BITS, 0x00f00000
.equ	M33_NVIC_IPR8_PRI_N2_MSB, 23
.equ	M33_NVIC_IPR8_PRI_N2_LSB, 20
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_IPR8_PRI_N1
# Description : For register NVIC_IPRn, the priority of interrupt number 4*n+1,
#               or RES0 if the PE does not implement this interrupt
.equ	M33_NVIC_IPR8_PRI_N1_RESET, 0x0
.equ	M33_NVIC_IPR8_PRI_N1_BITS, 0x0000f000
.equ	M33_NVIC_IPR8_PRI_N1_MSB, 15
.equ	M33_NVIC_IPR8_PRI_N1_LSB, 12
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_IPR8_PRI_N0
# Description : For register NVIC_IPRn, the priority of interrupt number 4*n+0,
#               or RES0 if the PE does not implement this interrupt
.equ	M33_NVIC_IPR8_PRI_N0_RESET, 0x0
.equ	M33_NVIC_IPR8_PRI_N0_BITS, 0x000000f0
.equ	M33_NVIC_IPR8_PRI_N0_MSB, 7
.equ	M33_NVIC_IPR8_PRI_N0_LSB, 4
# =============================================================================
# Register    : M33_NVIC_IPR9
# Description : Sets or reads interrupt priorities
.equ	M33_NVIC_IPR9_OFFSET, 0x0000e424
.equ	M33_NVIC_IPR9_BITS, 0xf0f0f0f0
.equ	M33_NVIC_IPR9_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_IPR9_PRI_N3
# Description : For register NVIC_IPRn, the priority of interrupt number 4*n+3,
#               or RES0 if the PE does not implement this interrupt
.equ	M33_NVIC_IPR9_PRI_N3_RESET, 0x0
.equ	M33_NVIC_IPR9_PRI_N3_BITS, 0xf0000000
.equ	M33_NVIC_IPR9_PRI_N3_MSB, 31
.equ	M33_NVIC_IPR9_PRI_N3_LSB, 28
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_IPR9_PRI_N2
# Description : For register NVIC_IPRn, the priority of interrupt number 4*n+2,
#               or RES0 if the PE does not implement this interrupt
.equ	M33_NVIC_IPR9_PRI_N2_RESET, 0x0
.equ	M33_NVIC_IPR9_PRI_N2_BITS, 0x00f00000
.equ	M33_NVIC_IPR9_PRI_N2_MSB, 23
.equ	M33_NVIC_IPR9_PRI_N2_LSB, 20
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_IPR9_PRI_N1
# Description : For register NVIC_IPRn, the priority of interrupt number 4*n+1,
#               or RES0 if the PE does not implement this interrupt
.equ	M33_NVIC_IPR9_PRI_N1_RESET, 0x0
.equ	M33_NVIC_IPR9_PRI_N1_BITS, 0x0000f000
.equ	M33_NVIC_IPR9_PRI_N1_MSB, 15
.equ	M33_NVIC_IPR9_PRI_N1_LSB, 12
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_IPR9_PRI_N0
# Description : For register NVIC_IPRn, the priority of interrupt number 4*n+0,
#               or RES0 if the PE does not implement this interrupt
.equ	M33_NVIC_IPR9_PRI_N0_RESET, 0x0
.equ	M33_NVIC_IPR9_PRI_N0_BITS, 0x000000f0
.equ	M33_NVIC_IPR9_PRI_N0_MSB, 7
.equ	M33_NVIC_IPR9_PRI_N0_LSB, 4
# =============================================================================
# Register    : M33_NVIC_IPR10
# Description : Sets or reads interrupt priorities
.equ	M33_NVIC_IPR10_OFFSET, 0x0000e428
.equ	M33_NVIC_IPR10_BITS, 0xf0f0f0f0
.equ	M33_NVIC_IPR10_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_IPR10_PRI_N3
# Description : For register NVIC_IPRn, the priority of interrupt number 4*n+3,
#               or RES0 if the PE does not implement this interrupt
.equ	M33_NVIC_IPR10_PRI_N3_RESET, 0x0
.equ	M33_NVIC_IPR10_PRI_N3_BITS, 0xf0000000
.equ	M33_NVIC_IPR10_PRI_N3_MSB, 31
.equ	M33_NVIC_IPR10_PRI_N3_LSB, 28
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_IPR10_PRI_N2
# Description : For register NVIC_IPRn, the priority of interrupt number 4*n+2,
#               or RES0 if the PE does not implement this interrupt
.equ	M33_NVIC_IPR10_PRI_N2_RESET, 0x0
.equ	M33_NVIC_IPR10_PRI_N2_BITS, 0x00f00000
.equ	M33_NVIC_IPR10_PRI_N2_MSB, 23
.equ	M33_NVIC_IPR10_PRI_N2_LSB, 20
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_IPR10_PRI_N1
# Description : For register NVIC_IPRn, the priority of interrupt number 4*n+1,
#               or RES0 if the PE does not implement this interrupt
.equ	M33_NVIC_IPR10_PRI_N1_RESET, 0x0
.equ	M33_NVIC_IPR10_PRI_N1_BITS, 0x0000f000
.equ	M33_NVIC_IPR10_PRI_N1_MSB, 15
.equ	M33_NVIC_IPR10_PRI_N1_LSB, 12
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_IPR10_PRI_N0
# Description : For register NVIC_IPRn, the priority of interrupt number 4*n+0,
#               or RES0 if the PE does not implement this interrupt
.equ	M33_NVIC_IPR10_PRI_N0_RESET, 0x0
.equ	M33_NVIC_IPR10_PRI_N0_BITS, 0x000000f0
.equ	M33_NVIC_IPR10_PRI_N0_MSB, 7
.equ	M33_NVIC_IPR10_PRI_N0_LSB, 4
# =============================================================================
# Register    : M33_NVIC_IPR11
# Description : Sets or reads interrupt priorities
.equ	M33_NVIC_IPR11_OFFSET, 0x0000e42c
.equ	M33_NVIC_IPR11_BITS, 0xf0f0f0f0
.equ	M33_NVIC_IPR11_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_IPR11_PRI_N3
# Description : For register NVIC_IPRn, the priority of interrupt number 4*n+3,
#               or RES0 if the PE does not implement this interrupt
.equ	M33_NVIC_IPR11_PRI_N3_RESET, 0x0
.equ	M33_NVIC_IPR11_PRI_N3_BITS, 0xf0000000
.equ	M33_NVIC_IPR11_PRI_N3_MSB, 31
.equ	M33_NVIC_IPR11_PRI_N3_LSB, 28
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_IPR11_PRI_N2
# Description : For register NVIC_IPRn, the priority of interrupt number 4*n+2,
#               or RES0 if the PE does not implement this interrupt
.equ	M33_NVIC_IPR11_PRI_N2_RESET, 0x0
.equ	M33_NVIC_IPR11_PRI_N2_BITS, 0x00f00000
.equ	M33_NVIC_IPR11_PRI_N2_MSB, 23
.equ	M33_NVIC_IPR11_PRI_N2_LSB, 20
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_IPR11_PRI_N1
# Description : For register NVIC_IPRn, the priority of interrupt number 4*n+1,
#               or RES0 if the PE does not implement this interrupt
.equ	M33_NVIC_IPR11_PRI_N1_RESET, 0x0
.equ	M33_NVIC_IPR11_PRI_N1_BITS, 0x0000f000
.equ	M33_NVIC_IPR11_PRI_N1_MSB, 15
.equ	M33_NVIC_IPR11_PRI_N1_LSB, 12
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_IPR11_PRI_N0
# Description : For register NVIC_IPRn, the priority of interrupt number 4*n+0,
#               or RES0 if the PE does not implement this interrupt
.equ	M33_NVIC_IPR11_PRI_N0_RESET, 0x0
.equ	M33_NVIC_IPR11_PRI_N0_BITS, 0x000000f0
.equ	M33_NVIC_IPR11_PRI_N0_MSB, 7
.equ	M33_NVIC_IPR11_PRI_N0_LSB, 4
# =============================================================================
# Register    : M33_NVIC_IPR12
# Description : Sets or reads interrupt priorities
.equ	M33_NVIC_IPR12_OFFSET, 0x0000e430
.equ	M33_NVIC_IPR12_BITS, 0xf0f0f0f0
.equ	M33_NVIC_IPR12_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_IPR12_PRI_N3
# Description : For register NVIC_IPRn, the priority of interrupt number 4*n+3,
#               or RES0 if the PE does not implement this interrupt
.equ	M33_NVIC_IPR12_PRI_N3_RESET, 0x0
.equ	M33_NVIC_IPR12_PRI_N3_BITS, 0xf0000000
.equ	M33_NVIC_IPR12_PRI_N3_MSB, 31
.equ	M33_NVIC_IPR12_PRI_N3_LSB, 28
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_IPR12_PRI_N2
# Description : For register NVIC_IPRn, the priority of interrupt number 4*n+2,
#               or RES0 if the PE does not implement this interrupt
.equ	M33_NVIC_IPR12_PRI_N2_RESET, 0x0
.equ	M33_NVIC_IPR12_PRI_N2_BITS, 0x00f00000
.equ	M33_NVIC_IPR12_PRI_N2_MSB, 23
.equ	M33_NVIC_IPR12_PRI_N2_LSB, 20
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_IPR12_PRI_N1
# Description : For register NVIC_IPRn, the priority of interrupt number 4*n+1,
#               or RES0 if the PE does not implement this interrupt
.equ	M33_NVIC_IPR12_PRI_N1_RESET, 0x0
.equ	M33_NVIC_IPR12_PRI_N1_BITS, 0x0000f000
.equ	M33_NVIC_IPR12_PRI_N1_MSB, 15
.equ	M33_NVIC_IPR12_PRI_N1_LSB, 12
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_IPR12_PRI_N0
# Description : For register NVIC_IPRn, the priority of interrupt number 4*n+0,
#               or RES0 if the PE does not implement this interrupt
.equ	M33_NVIC_IPR12_PRI_N0_RESET, 0x0
.equ	M33_NVIC_IPR12_PRI_N0_BITS, 0x000000f0
.equ	M33_NVIC_IPR12_PRI_N0_MSB, 7
.equ	M33_NVIC_IPR12_PRI_N0_LSB, 4
# =============================================================================
# Register    : M33_NVIC_IPR13
# Description : Sets or reads interrupt priorities
.equ	M33_NVIC_IPR13_OFFSET, 0x0000e434
.equ	M33_NVIC_IPR13_BITS, 0xf0f0f0f0
.equ	M33_NVIC_IPR13_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_IPR13_PRI_N3
# Description : For register NVIC_IPRn, the priority of interrupt number 4*n+3,
#               or RES0 if the PE does not implement this interrupt
.equ	M33_NVIC_IPR13_PRI_N3_RESET, 0x0
.equ	M33_NVIC_IPR13_PRI_N3_BITS, 0xf0000000
.equ	M33_NVIC_IPR13_PRI_N3_MSB, 31
.equ	M33_NVIC_IPR13_PRI_N3_LSB, 28
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_IPR13_PRI_N2
# Description : For register NVIC_IPRn, the priority of interrupt number 4*n+2,
#               or RES0 if the PE does not implement this interrupt
.equ	M33_NVIC_IPR13_PRI_N2_RESET, 0x0
.equ	M33_NVIC_IPR13_PRI_N2_BITS, 0x00f00000
.equ	M33_NVIC_IPR13_PRI_N2_MSB, 23
.equ	M33_NVIC_IPR13_PRI_N2_LSB, 20
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_IPR13_PRI_N1
# Description : For register NVIC_IPRn, the priority of interrupt number 4*n+1,
#               or RES0 if the PE does not implement this interrupt
