konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/m33.inc
.equ	M33_NVIC_IPR13_PRI_N1_RESET, 0x0
.equ	M33_NVIC_IPR13_PRI_N1_BITS, 0x0000f000
.equ	M33_NVIC_IPR13_PRI_N1_MSB, 15
.equ	M33_NVIC_IPR13_PRI_N1_LSB, 12
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_IPR13_PRI_N0
# Description : For register NVIC_IPRn, the priority of interrupt number 4*n+0,
#               or RES0 if the PE does not implement this interrupt
.equ	M33_NVIC_IPR13_PRI_N0_RESET, 0x0
.equ	M33_NVIC_IPR13_PRI_N0_BITS, 0x000000f0
.equ	M33_NVIC_IPR13_PRI_N0_MSB, 7
.equ	M33_NVIC_IPR13_PRI_N0_LSB, 4
# =============================================================================
# Register    : M33_NVIC_IPR14
# Description : Sets or reads interrupt priorities
.equ	M33_NVIC_IPR14_OFFSET, 0x0000e438
.equ	M33_NVIC_IPR14_BITS, 0xf0f0f0f0
.equ	M33_NVIC_IPR14_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_IPR14_PRI_N3
# Description : For register NVIC_IPRn, the priority of interrupt number 4*n+3,
#               or RES0 if the PE does not implement this interrupt
.equ	M33_NVIC_IPR14_PRI_N3_RESET, 0x0
.equ	M33_NVIC_IPR14_PRI_N3_BITS, 0xf0000000
.equ	M33_NVIC_IPR14_PRI_N3_MSB, 31
.equ	M33_NVIC_IPR14_PRI_N3_LSB, 28
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_IPR14_PRI_N2
# Description : For register NVIC_IPRn, the priority of interrupt number 4*n+2,
#               or RES0 if the PE does not implement this interrupt
.equ	M33_NVIC_IPR14_PRI_N2_RESET, 0x0
.equ	M33_NVIC_IPR14_PRI_N2_BITS, 0x00f00000
.equ	M33_NVIC_IPR14_PRI_N2_MSB, 23
.equ	M33_NVIC_IPR14_PRI_N2_LSB, 20
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_IPR14_PRI_N1
# Description : For register NVIC_IPRn, the priority of interrupt number 4*n+1,
#               or RES0 if the PE does not implement this interrupt
.equ	M33_NVIC_IPR14_PRI_N1_RESET, 0x0
.equ	M33_NVIC_IPR14_PRI_N1_BITS, 0x0000f000
.equ	M33_NVIC_IPR14_PRI_N1_MSB, 15
.equ	M33_NVIC_IPR14_PRI_N1_LSB, 12
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_IPR14_PRI_N0
# Description : For register NVIC_IPRn, the priority of interrupt number 4*n+0,
#               or RES0 if the PE does not implement this interrupt
.equ	M33_NVIC_IPR14_PRI_N0_RESET, 0x0
.equ	M33_NVIC_IPR14_PRI_N0_BITS, 0x000000f0
.equ	M33_NVIC_IPR14_PRI_N0_MSB, 7
.equ	M33_NVIC_IPR14_PRI_N0_LSB, 4
# =============================================================================
# Register    : M33_NVIC_IPR15
# Description : Sets or reads interrupt priorities
.equ	M33_NVIC_IPR15_OFFSET, 0x0000e43c
.equ	M33_NVIC_IPR15_BITS, 0xf0f0f0f0
.equ	M33_NVIC_IPR15_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_IPR15_PRI_N3
# Description : For register NVIC_IPRn, the priority of interrupt number 4*n+3,
#               or RES0 if the PE does not implement this interrupt
.equ	M33_NVIC_IPR15_PRI_N3_RESET, 0x0
.equ	M33_NVIC_IPR15_PRI_N3_BITS, 0xf0000000
.equ	M33_NVIC_IPR15_PRI_N3_MSB, 31
.equ	M33_NVIC_IPR15_PRI_N3_LSB, 28
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_IPR15_PRI_N2
# Description : For register NVIC_IPRn, the priority of interrupt number 4*n+2,
#               or RES0 if the PE does not implement this interrupt
.equ	M33_NVIC_IPR15_PRI_N2_RESET, 0x0
.equ	M33_NVIC_IPR15_PRI_N2_BITS, 0x00f00000
.equ	M33_NVIC_IPR15_PRI_N2_MSB, 23
.equ	M33_NVIC_IPR15_PRI_N2_LSB, 20
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_IPR15_PRI_N1
# Description : For register NVIC_IPRn, the priority of interrupt number 4*n+1,
#               or RES0 if the PE does not implement this interrupt
.equ	M33_NVIC_IPR15_PRI_N1_RESET, 0x0
.equ	M33_NVIC_IPR15_PRI_N1_BITS, 0x0000f000
.equ	M33_NVIC_IPR15_PRI_N1_MSB, 15
.equ	M33_NVIC_IPR15_PRI_N1_LSB, 12
# -----------------------------------------------------------------------------
# Field       : M33_NVIC_IPR15_PRI_N0
# Description : For register NVIC_IPRn, the priority of interrupt number 4*n+0,
#               or RES0 if the PE does not implement this interrupt
.equ	M33_NVIC_IPR15_PRI_N0_RESET, 0x0
.equ	M33_NVIC_IPR15_PRI_N0_BITS, 0x000000f0
.equ	M33_NVIC_IPR15_PRI_N0_MSB, 7
.equ	M33_NVIC_IPR15_PRI_N0_LSB, 4
# =============================================================================
# Register    : M33_CPUID
# Description : Provides identification information for the PE, including an
#               implementer code for the device and a device ID number
.equ	M33_CPUID_OFFSET, 0x0000ed00
.equ	M33_CPUID_BITS, 0xffffffff
.equ	M33_CPUID_RESET, 0x411fd210
# -----------------------------------------------------------------------------
# Field       : M33_CPUID_IMPLEMENTER
# Description : This field must hold an implementer code that has been assigned
#               by ARM
.equ	M33_CPUID_IMPLEMENTER_RESET, 0x41
.equ	M33_CPUID_IMPLEMENTER_BITS, 0xff000000
.equ	M33_CPUID_IMPLEMENTER_MSB, 31
.equ	M33_CPUID_IMPLEMENTER_LSB, 24
# -----------------------------------------------------------------------------
# Field       : M33_CPUID_VARIANT
# Description : IMPLEMENTATION DEFINED variant number. Typically, this field is
#               used to distinguish between different product variants, or
#               major revisions of a product
.equ	M33_CPUID_VARIANT_RESET, 0x1
.equ	M33_CPUID_VARIANT_BITS, 0x00f00000
.equ	M33_CPUID_VARIANT_MSB, 23
.equ	M33_CPUID_VARIANT_LSB, 20
# -----------------------------------------------------------------------------
# Field       : M33_CPUID_ARCHITECTURE
# Description : Defines the Architecture implemented by the PE
.equ	M33_CPUID_ARCHITECTURE_RESET, 0xf
.equ	M33_CPUID_ARCHITECTURE_BITS, 0x000f0000
.equ	M33_CPUID_ARCHITECTURE_MSB, 19
.equ	M33_CPUID_ARCHITECTURE_LSB, 16
# -----------------------------------------------------------------------------
# Field       : M33_CPUID_PARTNO
# Description : IMPLEMENTATION DEFINED primary part number for the device
.equ	M33_CPUID_PARTNO_RESET, 0xd21
.equ	M33_CPUID_PARTNO_BITS, 0x0000fff0
.equ	M33_CPUID_PARTNO_MSB, 15
.equ	M33_CPUID_PARTNO_LSB, 4
# -----------------------------------------------------------------------------
# Field       : M33_CPUID_REVISION
# Description : IMPLEMENTATION DEFINED revision number for the device
.equ	M33_CPUID_REVISION_RESET, 0x0
.equ	M33_CPUID_REVISION_BITS, 0x0000000f
.equ	M33_CPUID_REVISION_MSB, 3
.equ	M33_CPUID_REVISION_LSB, 0
# =============================================================================
# Register    : M33_ICSR
# Description : Controls and provides status information for NMI, PendSV,
#               SysTick and interrupts
.equ	M33_ICSR_OFFSET, 0x0000ed04
.equ	M33_ICSR_BITS, 0xdfdff9ff
.equ	M33_ICSR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_ICSR_PENDNMISET
# Description : Indicates whether the NMI exception is pending
.equ	M33_ICSR_PENDNMISET_RESET, 0x0
.equ	M33_ICSR_PENDNMISET_BITS, 0x80000000
.equ	M33_ICSR_PENDNMISET_MSB, 31
.equ	M33_ICSR_PENDNMISET_LSB, 31
# -----------------------------------------------------------------------------
# Field       : M33_ICSR_PENDNMICLR
# Description : Allows the NMI exception pend state to be cleared
.equ	M33_ICSR_PENDNMICLR_RESET, 0x0
.equ	M33_ICSR_PENDNMICLR_BITS, 0x40000000
.equ	M33_ICSR_PENDNMICLR_MSB, 30
.equ	M33_ICSR_PENDNMICLR_LSB, 30
# -----------------------------------------------------------------------------
# Field       : M33_ICSR_PENDSVSET
# Description : Indicates whether the PendSV `FTSSS exception is pending
.equ	M33_ICSR_PENDSVSET_RESET, 0x0
.equ	M33_ICSR_PENDSVSET_BITS, 0x10000000
.equ	M33_ICSR_PENDSVSET_MSB, 28
.equ	M33_ICSR_PENDSVSET_LSB, 28
# -----------------------------------------------------------------------------
# Field       : M33_ICSR_PENDSVCLR
# Description : Allows the PendSV exception pend state to be cleared `FTSSS
.equ	M33_ICSR_PENDSVCLR_RESET, 0x0
.equ	M33_ICSR_PENDSVCLR_BITS, 0x08000000
.equ	M33_ICSR_PENDSVCLR_MSB, 27
.equ	M33_ICSR_PENDSVCLR_LSB, 27
# -----------------------------------------------------------------------------
# Field       : M33_ICSR_PENDSTSET
# Description : Indicates whether the SysTick `FTSSS exception is pending
.equ	M33_ICSR_PENDSTSET_RESET, 0x0
.equ	M33_ICSR_PENDSTSET_BITS, 0x04000000
.equ	M33_ICSR_PENDSTSET_MSB, 26
.equ	M33_ICSR_PENDSTSET_LSB, 26
# -----------------------------------------------------------------------------
# Field       : M33_ICSR_PENDSTCLR
# Description : Allows the SysTick exception pend state to be cleared `FTSSS
.equ	M33_ICSR_PENDSTCLR_RESET, 0x0
.equ	M33_ICSR_PENDSTCLR_BITS, 0x02000000
.equ	M33_ICSR_PENDSTCLR_MSB, 25
.equ	M33_ICSR_PENDSTCLR_LSB, 25
# -----------------------------------------------------------------------------
# Field       : M33_ICSR_STTNS
# Description : Controls whether in a single SysTick implementation, the
#               SysTick is Secure or Non-secure
.equ	M33_ICSR_STTNS_RESET, 0x0
.equ	M33_ICSR_STTNS_BITS, 0x01000000
.equ	M33_ICSR_STTNS_MSB, 24
.equ	M33_ICSR_STTNS_LSB, 24
# -----------------------------------------------------------------------------
# Field       : M33_ICSR_ISRPREEMPT
# Description : Indicates whether a pending exception will be serviced on exit
#               from debug halt state
.equ	M33_ICSR_ISRPREEMPT_RESET, 0x0
.equ	M33_ICSR_ISRPREEMPT_BITS, 0x00800000
.equ	M33_ICSR_ISRPREEMPT_MSB, 23
.equ	M33_ICSR_ISRPREEMPT_LSB, 23
# -----------------------------------------------------------------------------
# Field       : M33_ICSR_ISRPENDING
# Description : Indicates whether an external interrupt, generated by the NVIC,
#               is pending
.equ	M33_ICSR_ISRPENDING_RESET, 0x0
.equ	M33_ICSR_ISRPENDING_BITS, 0x00400000
.equ	M33_ICSR_ISRPENDING_MSB, 22
.equ	M33_ICSR_ISRPENDING_LSB, 22
# -----------------------------------------------------------------------------
# Field       : M33_ICSR_VECTPENDING
# Description : The exception number of the highest priority pending and
#               enabled interrupt
.equ	M33_ICSR_VECTPENDING_RESET, 0x000
.equ	M33_ICSR_VECTPENDING_BITS, 0x001ff000
.equ	M33_ICSR_VECTPENDING_MSB, 20
.equ	M33_ICSR_VECTPENDING_LSB, 12
# -----------------------------------------------------------------------------
# Field       : M33_ICSR_RETTOBASE
# Description : In Handler mode, indicates whether there is more than one
#               active exception
.equ	M33_ICSR_RETTOBASE_RESET, 0x0
.equ	M33_ICSR_RETTOBASE_BITS, 0x00000800
.equ	M33_ICSR_RETTOBASE_MSB, 11
.equ	M33_ICSR_RETTOBASE_LSB, 11
# -----------------------------------------------------------------------------
# Field       : M33_ICSR_VECTACTIVE
# Description : The exception number of the current executing exception
.equ	M33_ICSR_VECTACTIVE_RESET, 0x000
.equ	M33_ICSR_VECTACTIVE_BITS, 0x000001ff
.equ	M33_ICSR_VECTACTIVE_MSB, 8
.equ	M33_ICSR_VECTACTIVE_LSB, 0
# =============================================================================
# Register    : M33_VTOR
# Description : The VTOR indicates the offset of the vector table base address
#               from memory address 0x00000000.
.equ	M33_VTOR_OFFSET, 0x0000ed08
.equ	M33_VTOR_BITS, 0xffffff80
.equ	M33_VTOR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_VTOR_TBLOFF
# Description : Vector table base offset field. It contains bits[31:7] of the
#               offset of the table base from the bottom of the memory map.
.equ	M33_VTOR_TBLOFF_RESET, 0x0000000
.equ	M33_VTOR_TBLOFF_BITS, 0xffffff80
.equ	M33_VTOR_TBLOFF_MSB, 31
.equ	M33_VTOR_TBLOFF_LSB, 7
# =============================================================================
# Register    : M33_AIRCR
# Description : Use the Application Interrupt and Reset Control Register to:
#               determine data endianness, clear all active state information
#               from debug halt mode, request a system reset.
.equ	M33_AIRCR_OFFSET, 0x0000ed0c
.equ	M33_AIRCR_BITS, 0xffffe70e
.equ	M33_AIRCR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_AIRCR_VECTKEY
# Description : Register key:
#               Reads as Unknown
#               On writes, write 0x05FA to VECTKEY, otherwise the write is
#               ignored.
.equ	M33_AIRCR_VECTKEY_RESET, 0x0000
.equ	M33_AIRCR_VECTKEY_BITS, 0xffff0000
.equ	M33_AIRCR_VECTKEY_MSB, 31
.equ	M33_AIRCR_VECTKEY_LSB, 16
# -----------------------------------------------------------------------------
# Field       : M33_AIRCR_ENDIANESS
# Description : Data endianness implemented:
#               0 = Little-endian.
.equ	M33_AIRCR_ENDIANESS_RESET, 0x0
.equ	M33_AIRCR_ENDIANESS_BITS, 0x00008000
.equ	M33_AIRCR_ENDIANESS_MSB, 15
.equ	M33_AIRCR_ENDIANESS_LSB, 15
# -----------------------------------------------------------------------------
# Field       : M33_AIRCR_PRIS
# Description : Prioritize Secure exceptions. The value of this bit defines
#               whether Secure exception priority boosting is enabled.
#               0	Priority ranges of Secure and Non-secure exceptions are
#               identical.
#               1	Non-secure exceptions are de-prioritized.
.equ	M33_AIRCR_PRIS_RESET, 0x0
.equ	M33_AIRCR_PRIS_BITS, 0x00004000
.equ	M33_AIRCR_PRIS_MSB, 14
.equ	M33_AIRCR_PRIS_LSB, 14
# -----------------------------------------------------------------------------
# Field       : M33_AIRCR_BFHFNMINS
# Description : BusFault, HardFault, and NMI Non-secure enable.
#               0	BusFault, HardFault, and NMI are Secure.
#               1	BusFault and NMI are Non-secure and exceptions can target
#               Non-secure HardFault.
.equ	M33_AIRCR_BFHFNMINS_RESET, 0x0
.equ	M33_AIRCR_BFHFNMINS_BITS, 0x00002000
.equ	M33_AIRCR_BFHFNMINS_MSB, 13
.equ	M33_AIRCR_BFHFNMINS_LSB, 13
# -----------------------------------------------------------------------------
# Field       : M33_AIRCR_PRIGROUP
# Description : Interrupt priority grouping field. This field determines the
#               split of group priority from subpriority.
#               See https:#developer.arm.com/documentation/100235/0004/the-
#               cortex-m33-peripherals/system-control-block/application-
#               interrupt-and-reset-control-register?lang=en
.equ	M33_AIRCR_PRIGROUP_RESET, 0x0
.equ	M33_AIRCR_PRIGROUP_BITS, 0x00000700
.equ	M33_AIRCR_PRIGROUP_MSB, 10
.equ	M33_AIRCR_PRIGROUP_LSB, 8
# -----------------------------------------------------------------------------
# Field       : M33_AIRCR_SYSRESETREQS
# Description : System reset request, Secure state only.
#               0	SYSRESETREQ functionality is available to both Security
#               states.
#               1 SYSRESETREQ functionality is only available to Secure state.
.equ	M33_AIRCR_SYSRESETREQS_RESET, 0x0
.equ	M33_AIRCR_SYSRESETREQS_BITS, 0x00000008
.equ	M33_AIRCR_SYSRESETREQS_MSB, 3
.equ	M33_AIRCR_SYSRESETREQS_LSB, 3
# -----------------------------------------------------------------------------
# Field       : M33_AIRCR_SYSRESETREQ
# Description : Writing 1 to this bit causes the SYSRESETREQ signal to the
#               outer system to be asserted to request a reset. The intention
#               is to force a large system reset of all major components except
#               for debug. The C_HALT bit in the DHCSR is cleared as a result
#               of the system reset requested. The debugger does not lose
#               contact with the device.
.equ	M33_AIRCR_SYSRESETREQ_RESET, 0x0
.equ	M33_AIRCR_SYSRESETREQ_BITS, 0x00000004
.equ	M33_AIRCR_SYSRESETREQ_MSB, 2
.equ	M33_AIRCR_SYSRESETREQ_LSB, 2
# -----------------------------------------------------------------------------
# Field       : M33_AIRCR_VECTCLRACTIVE
# Description : Clears all active state information for fixed and configurable
#               exceptions. This bit: is self-clearing, can only be set by the
#               DAP when the core is halted.  When set: clears all active
#               exception status of the processor, forces a return to Thread
#               mode, forces an IPSR of 0. A debugger must re-initialize the
#               stack.
.equ	M33_AIRCR_VECTCLRACTIVE_RESET, 0x0
.equ	M33_AIRCR_VECTCLRACTIVE_BITS, 0x00000002
.equ	M33_AIRCR_VECTCLRACTIVE_MSB, 1
.equ	M33_AIRCR_VECTCLRACTIVE_LSB, 1
# =============================================================================
# Register    : M33_SCR
# Description : System Control Register. Use the System Control Register for
#               power-management functions: signal to the system when the
#               processor can enter a low power state, control how the
#               processor enters and exits low power states.
.equ	M33_SCR_OFFSET, 0x0000ed10
.equ	M33_SCR_BITS, 0x0000001e
.equ	M33_SCR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_SCR_SEVONPEND
# Description : Send Event on Pending bit:
#               0 = Only enabled interrupts or events can wakeup the processor,
#               disabled interrupts are excluded.
#               1 = Enabled events and all interrupts, including disabled
#               interrupts, can wakeup the processor.
#               When an event or interrupt becomes pending, the event signal
#               wakes up the processor from WFE. If the
#               processor is not waiting for an event, the event is registered
#               and affects the next WFE.
#               The processor also wakes up on execution of an SEV instruction
#               or an external event.
.equ	M33_SCR_SEVONPEND_RESET, 0x0
.equ	M33_SCR_SEVONPEND_BITS, 0x00000010
.equ	M33_SCR_SEVONPEND_MSB, 4
.equ	M33_SCR_SEVONPEND_LSB, 4
# -----------------------------------------------------------------------------
# Field       : M33_SCR_SLEEPDEEPS
# Description : 0 SLEEPDEEP is available to both security states
#               1 SLEEPDEEP is only available to Secure state
.equ	M33_SCR_SLEEPDEEPS_RESET, 0x0
.equ	M33_SCR_SLEEPDEEPS_BITS, 0x00000008
.equ	M33_SCR_SLEEPDEEPS_MSB, 3
.equ	M33_SCR_SLEEPDEEPS_LSB, 3
# -----------------------------------------------------------------------------
# Field       : M33_SCR_SLEEPDEEP
# Description : Controls whether the processor uses sleep or deep sleep as its
#               low power mode:
#               0 = Sleep.
#               1 = Deep sleep.
.equ	M33_SCR_SLEEPDEEP_RESET, 0x0
.equ	M33_SCR_SLEEPDEEP_BITS, 0x00000004
.equ	M33_SCR_SLEEPDEEP_MSB, 2
.equ	M33_SCR_SLEEPDEEP_LSB, 2
# -----------------------------------------------------------------------------
# Field       : M33_SCR_SLEEPONEXIT
# Description : Indicates sleep-on-exit when returning from Handler mode to
#               Thread mode:
#               0 = Do not sleep when returning to Thread mode.
#               1 = Enter sleep, or deep sleep, on return from an ISR to Thread
#               mode.
#               Setting this bit to 1 enables an interrupt driven application
#               to avoid returning to an empty main application.
.equ	M33_SCR_SLEEPONEXIT_RESET, 0x0
.equ	M33_SCR_SLEEPONEXIT_BITS, 0x00000002
.equ	M33_SCR_SLEEPONEXIT_MSB, 1
.equ	M33_SCR_SLEEPONEXIT_LSB, 1
# =============================================================================
# Register    : M33_CCR
# Description : Sets or returns configuration and control data
.equ	M33_CCR_OFFSET, 0x0000ed14
.equ	M33_CCR_BITS, 0x0007071b
.equ	M33_CCR_RESET, 0x00000201
# -----------------------------------------------------------------------------
# Field       : M33_CCR_BP
# Description : Enables program flow prediction `FTSSS
.equ	M33_CCR_BP_RESET, 0x0
.equ	M33_CCR_BP_BITS, 0x00040000
.equ	M33_CCR_BP_MSB, 18
.equ	M33_CCR_BP_LSB, 18
# -----------------------------------------------------------------------------
# Field       : M33_CCR_IC
# Description : This is a global enable bit for instruction caches in the
#               selected Security state
.equ	M33_CCR_IC_RESET, 0x0
.equ	M33_CCR_IC_BITS, 0x00020000
.equ	M33_CCR_IC_MSB, 17
.equ	M33_CCR_IC_LSB, 17
# -----------------------------------------------------------------------------
# Field       : M33_CCR_DC
# Description : Enables data caching of all data accesses to Normal memory
#               `FTSSS
.equ	M33_CCR_DC_RESET, 0x0
.equ	M33_CCR_DC_BITS, 0x00010000
.equ	M33_CCR_DC_MSB, 16
.equ	M33_CCR_DC_LSB, 16
# -----------------------------------------------------------------------------
# Field       : M33_CCR_STKOFHFNMIGN
# Description : Controls the effect of a stack limit violation while executing
#               at a requested priority less than 0
.equ	M33_CCR_STKOFHFNMIGN_RESET, 0x0
.equ	M33_CCR_STKOFHFNMIGN_BITS, 0x00000400
.equ	M33_CCR_STKOFHFNMIGN_MSB, 10
.equ	M33_CCR_STKOFHFNMIGN_LSB, 10
# -----------------------------------------------------------------------------
# Field       : M33_CCR_RES1
# Description : Reserved, RES1
.equ	M33_CCR_RES1_RESET, 0x1
.equ	M33_CCR_RES1_BITS, 0x00000200
.equ	M33_CCR_RES1_MSB, 9
.equ	M33_CCR_RES1_LSB, 9
# -----------------------------------------------------------------------------
# Field       : M33_CCR_BFHFNMIGN
# Description : Determines the effect of precise BusFaults on handlers running
#               at a requested priority less than 0
.equ	M33_CCR_BFHFNMIGN_RESET, 0x0
.equ	M33_CCR_BFHFNMIGN_BITS, 0x00000100
.equ	M33_CCR_BFHFNMIGN_MSB, 8
.equ	M33_CCR_BFHFNMIGN_LSB, 8
# -----------------------------------------------------------------------------
# Field       : M33_CCR_DIV_0_TRP
# Description : Controls the generation of a DIVBYZERO UsageFault when
#               attempting to perform integer division by zero
.equ	M33_CCR_DIV_0_TRP_RESET, 0x0
.equ	M33_CCR_DIV_0_TRP_BITS, 0x00000010
.equ	M33_CCR_DIV_0_TRP_MSB, 4
.equ	M33_CCR_DIV_0_TRP_LSB, 4
# -----------------------------------------------------------------------------
# Field       : M33_CCR_UNALIGN_TRP
# Description : Controls the trapping of unaligned word or halfword accesses
.equ	M33_CCR_UNALIGN_TRP_RESET, 0x0
.equ	M33_CCR_UNALIGN_TRP_BITS, 0x00000008
.equ	M33_CCR_UNALIGN_TRP_MSB, 3
.equ	M33_CCR_UNALIGN_TRP_LSB, 3
# -----------------------------------------------------------------------------
# Field       : M33_CCR_USERSETMPEND
# Description : Determines whether unprivileged accesses are permitted to pend
#               interrupts via the STIR
.equ	M33_CCR_USERSETMPEND_RESET, 0x0
.equ	M33_CCR_USERSETMPEND_BITS, 0x00000002
.equ	M33_CCR_USERSETMPEND_MSB, 1
.equ	M33_CCR_USERSETMPEND_LSB, 1
# -----------------------------------------------------------------------------
# Field       : M33_CCR_RES1_1
# Description : Reserved, RES1
.equ	M33_CCR_RES1_1_RESET, 0x1
.equ	M33_CCR_RES1_1_BITS, 0x00000001
.equ	M33_CCR_RES1_1_MSB, 0
.equ	M33_CCR_RES1_1_LSB, 0
# =============================================================================
# Register    : M33_SHPR1
# Description : Sets or returns priority for system handlers 4 - 7
.equ	M33_SHPR1_OFFSET, 0x0000ed18
.equ	M33_SHPR1_BITS, 0xe0e0e0e0
.equ	M33_SHPR1_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_SHPR1_PRI_7_3
# Description : Priority of system handler 7, SecureFault
.equ	M33_SHPR1_PRI_7_3_RESET, 0x0
.equ	M33_SHPR1_PRI_7_3_BITS, 0xe0000000
.equ	M33_SHPR1_PRI_7_3_MSB, 31
.equ	M33_SHPR1_PRI_7_3_LSB, 29
# -----------------------------------------------------------------------------
# Field       : M33_SHPR1_PRI_6_3
# Description : Priority of system handler 6, SecureFault
.equ	M33_SHPR1_PRI_6_3_RESET, 0x0
.equ	M33_SHPR1_PRI_6_3_BITS, 0x00e00000
.equ	M33_SHPR1_PRI_6_3_MSB, 23
.equ	M33_SHPR1_PRI_6_3_LSB, 21
# -----------------------------------------------------------------------------
# Field       : M33_SHPR1_PRI_5_3
# Description : Priority of system handler 5, SecureFault
