konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/m33.inc
.equ	M33_SHPR1_PRI_5_3_RESET, 0x0
.equ	M33_SHPR1_PRI_5_3_BITS, 0x0000e000
.equ	M33_SHPR1_PRI_5_3_MSB, 15
.equ	M33_SHPR1_PRI_5_3_LSB, 13
# -----------------------------------------------------------------------------
# Field       : M33_SHPR1_PRI_4_3
# Description : Priority of system handler 4, SecureFault
.equ	M33_SHPR1_PRI_4_3_RESET, 0x0
.equ	M33_SHPR1_PRI_4_3_BITS, 0x000000e0
.equ	M33_SHPR1_PRI_4_3_MSB, 7
.equ	M33_SHPR1_PRI_4_3_LSB, 5
# =============================================================================
# Register    : M33_SHPR2
# Description : Sets or returns priority for system handlers 8 - 11
.equ	M33_SHPR2_OFFSET, 0x0000ed1c
.equ	M33_SHPR2_BITS, 0xe0ffffff
.equ	M33_SHPR2_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_SHPR2_PRI_11_3
# Description : Priority of system handler 11, SecureFault
.equ	M33_SHPR2_PRI_11_3_RESET, 0x0
.equ	M33_SHPR2_PRI_11_3_BITS, 0xe0000000
.equ	M33_SHPR2_PRI_11_3_MSB, 31
.equ	M33_SHPR2_PRI_11_3_LSB, 29
# -----------------------------------------------------------------------------
# Field       : M33_SHPR2_PRI_10
# Description : Reserved, RES0
.equ	M33_SHPR2_PRI_10_RESET, 0x00
.equ	M33_SHPR2_PRI_10_BITS, 0x00ff0000
.equ	M33_SHPR2_PRI_10_MSB, 23
.equ	M33_SHPR2_PRI_10_LSB, 16
# -----------------------------------------------------------------------------
# Field       : M33_SHPR2_PRI_9
# Description : Reserved, RES0
.equ	M33_SHPR2_PRI_9_RESET, 0x00
.equ	M33_SHPR2_PRI_9_BITS, 0x0000ff00
.equ	M33_SHPR2_PRI_9_MSB, 15
.equ	M33_SHPR2_PRI_9_LSB, 8
# -----------------------------------------------------------------------------
# Field       : M33_SHPR2_PRI_8
# Description : Reserved, RES0
.equ	M33_SHPR2_PRI_8_RESET, 0x00
.equ	M33_SHPR2_PRI_8_BITS, 0x000000ff
.equ	M33_SHPR2_PRI_8_MSB, 7
.equ	M33_SHPR2_PRI_8_LSB, 0
# =============================================================================
# Register    : M33_SHPR3
# Description : Sets or returns priority for system handlers 12 - 15
.equ	M33_SHPR3_OFFSET, 0x0000ed20
.equ	M33_SHPR3_BITS, 0xe0e0ffe0
.equ	M33_SHPR3_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_SHPR3_PRI_15_3
# Description : Priority of system handler 15, SecureFault
.equ	M33_SHPR3_PRI_15_3_RESET, 0x0
.equ	M33_SHPR3_PRI_15_3_BITS, 0xe0000000
.equ	M33_SHPR3_PRI_15_3_MSB, 31
.equ	M33_SHPR3_PRI_15_3_LSB, 29
# -----------------------------------------------------------------------------
# Field       : M33_SHPR3_PRI_14_3
# Description : Priority of system handler 14, SecureFault
.equ	M33_SHPR3_PRI_14_3_RESET, 0x0
.equ	M33_SHPR3_PRI_14_3_BITS, 0x00e00000
.equ	M33_SHPR3_PRI_14_3_MSB, 23
.equ	M33_SHPR3_PRI_14_3_LSB, 21
# -----------------------------------------------------------------------------
# Field       : M33_SHPR3_PRI_13
# Description : Reserved, RES0
.equ	M33_SHPR3_PRI_13_RESET, 0x00
.equ	M33_SHPR3_PRI_13_BITS, 0x0000ff00
.equ	M33_SHPR3_PRI_13_MSB, 15
.equ	M33_SHPR3_PRI_13_LSB, 8
# -----------------------------------------------------------------------------
# Field       : M33_SHPR3_PRI_12_3
# Description : Priority of system handler 12, SecureFault
.equ	M33_SHPR3_PRI_12_3_RESET, 0x0
.equ	M33_SHPR3_PRI_12_3_BITS, 0x000000e0
.equ	M33_SHPR3_PRI_12_3_MSB, 7
.equ	M33_SHPR3_PRI_12_3_LSB, 5
# =============================================================================
# Register    : M33_SHCSR
# Description : Provides access to the active and pending status of system
#               exceptions
.equ	M33_SHCSR_OFFSET, 0x0000ed24
.equ	M33_SHCSR_BITS, 0x003ffdbf
.equ	M33_SHCSR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_SHCSR_HARDFAULTPENDED
# Description : `IAAMO the pending state of the HardFault exception `CTTSSS
.equ	M33_SHCSR_HARDFAULTPENDED_RESET, 0x0
.equ	M33_SHCSR_HARDFAULTPENDED_BITS, 0x00200000
.equ	M33_SHCSR_HARDFAULTPENDED_MSB, 21
.equ	M33_SHCSR_HARDFAULTPENDED_LSB, 21
# -----------------------------------------------------------------------------
# Field       : M33_SHCSR_SECUREFAULTPENDED
# Description : `IAAMO the pending state of the SecureFault exception
.equ	M33_SHCSR_SECUREFAULTPENDED_RESET, 0x0
.equ	M33_SHCSR_SECUREFAULTPENDED_BITS, 0x00100000
.equ	M33_SHCSR_SECUREFAULTPENDED_MSB, 20
.equ	M33_SHCSR_SECUREFAULTPENDED_LSB, 20
# -----------------------------------------------------------------------------
# Field       : M33_SHCSR_SECUREFAULTENA
# Description : `DW the SecureFault exception is enabled
.equ	M33_SHCSR_SECUREFAULTENA_RESET, 0x0
.equ	M33_SHCSR_SECUREFAULTENA_BITS, 0x00080000
.equ	M33_SHCSR_SECUREFAULTENA_MSB, 19
.equ	M33_SHCSR_SECUREFAULTENA_LSB, 19
# -----------------------------------------------------------------------------
# Field       : M33_SHCSR_USGFAULTENA
# Description : `DW the UsageFault exception is enabled `FTSSS
.equ	M33_SHCSR_USGFAULTENA_RESET, 0x0
.equ	M33_SHCSR_USGFAULTENA_BITS, 0x00040000
.equ	M33_SHCSR_USGFAULTENA_MSB, 18
.equ	M33_SHCSR_USGFAULTENA_LSB, 18
# -----------------------------------------------------------------------------
# Field       : M33_SHCSR_BUSFAULTENA
# Description : `DW the BusFault exception is enabled
.equ	M33_SHCSR_BUSFAULTENA_RESET, 0x0
.equ	M33_SHCSR_BUSFAULTENA_BITS, 0x00020000
.equ	M33_SHCSR_BUSFAULTENA_MSB, 17
.equ	M33_SHCSR_BUSFAULTENA_LSB, 17
# -----------------------------------------------------------------------------
# Field       : M33_SHCSR_MEMFAULTENA
# Description : `DW the MemManage exception is enabled `FTSSS
.equ	M33_SHCSR_MEMFAULTENA_RESET, 0x0
.equ	M33_SHCSR_MEMFAULTENA_BITS, 0x00010000
.equ	M33_SHCSR_MEMFAULTENA_MSB, 16
.equ	M33_SHCSR_MEMFAULTENA_LSB, 16
# -----------------------------------------------------------------------------
# Field       : M33_SHCSR_SVCALLPENDED
# Description : `IAAMO the pending state of the SVCall exception `FTSSS
.equ	M33_SHCSR_SVCALLPENDED_RESET, 0x0
.equ	M33_SHCSR_SVCALLPENDED_BITS, 0x00008000
.equ	M33_SHCSR_SVCALLPENDED_MSB, 15
.equ	M33_SHCSR_SVCALLPENDED_LSB, 15
# -----------------------------------------------------------------------------
# Field       : M33_SHCSR_BUSFAULTPENDED
# Description : `IAAMO the pending state of the BusFault exception
.equ	M33_SHCSR_BUSFAULTPENDED_RESET, 0x0
.equ	M33_SHCSR_BUSFAULTPENDED_BITS, 0x00004000
.equ	M33_SHCSR_BUSFAULTPENDED_MSB, 14
.equ	M33_SHCSR_BUSFAULTPENDED_LSB, 14
# -----------------------------------------------------------------------------
# Field       : M33_SHCSR_MEMFAULTPENDED
# Description : `IAAMO the pending state of the MemManage exception `FTSSS
.equ	M33_SHCSR_MEMFAULTPENDED_RESET, 0x0
.equ	M33_SHCSR_MEMFAULTPENDED_BITS, 0x00002000
.equ	M33_SHCSR_MEMFAULTPENDED_MSB, 13
.equ	M33_SHCSR_MEMFAULTPENDED_LSB, 13
# -----------------------------------------------------------------------------
# Field       : M33_SHCSR_USGFAULTPENDED
# Description : The UsageFault exception is banked between Security states,
#               `IAAMO the pending state of the UsageFault exception `FTSSS
.equ	M33_SHCSR_USGFAULTPENDED_RESET, 0x0
.equ	M33_SHCSR_USGFAULTPENDED_BITS, 0x00001000
.equ	M33_SHCSR_USGFAULTPENDED_MSB, 12
.equ	M33_SHCSR_USGFAULTPENDED_LSB, 12
# -----------------------------------------------------------------------------
# Field       : M33_SHCSR_SYSTICKACT
# Description : `IAAMO the active state of the SysTick exception `FTSSS
.equ	M33_SHCSR_SYSTICKACT_RESET, 0x0
.equ	M33_SHCSR_SYSTICKACT_BITS, 0x00000800
.equ	M33_SHCSR_SYSTICKACT_MSB, 11
.equ	M33_SHCSR_SYSTICKACT_LSB, 11
# -----------------------------------------------------------------------------
# Field       : M33_SHCSR_PENDSVACT
# Description : `IAAMO the active state of the PendSV exception `FTSSS
.equ	M33_SHCSR_PENDSVACT_RESET, 0x0
.equ	M33_SHCSR_PENDSVACT_BITS, 0x00000400
.equ	M33_SHCSR_PENDSVACT_MSB, 10
.equ	M33_SHCSR_PENDSVACT_LSB, 10
# -----------------------------------------------------------------------------
# Field       : M33_SHCSR_MONITORACT
# Description : `IAAMO the active state of the DebugMonitor exception
.equ	M33_SHCSR_MONITORACT_RESET, 0x0
.equ	M33_SHCSR_MONITORACT_BITS, 0x00000100
.equ	M33_SHCSR_MONITORACT_MSB, 8
.equ	M33_SHCSR_MONITORACT_LSB, 8
# -----------------------------------------------------------------------------
# Field       : M33_SHCSR_SVCALLACT
# Description : `IAAMO the active state of the SVCall exception `FTSSS
.equ	M33_SHCSR_SVCALLACT_RESET, 0x0
.equ	M33_SHCSR_SVCALLACT_BITS, 0x00000080
.equ	M33_SHCSR_SVCALLACT_MSB, 7
.equ	M33_SHCSR_SVCALLACT_LSB, 7
# -----------------------------------------------------------------------------
# Field       : M33_SHCSR_NMIACT
# Description : `IAAMO the active state of the NMI exception
.equ	M33_SHCSR_NMIACT_RESET, 0x0
.equ	M33_SHCSR_NMIACT_BITS, 0x00000020
.equ	M33_SHCSR_NMIACT_MSB, 5
.equ	M33_SHCSR_NMIACT_LSB, 5
# -----------------------------------------------------------------------------
# Field       : M33_SHCSR_SECUREFAULTACT
# Description : `IAAMO the active state of the SecureFault exception
.equ	M33_SHCSR_SECUREFAULTACT_RESET, 0x0
.equ	M33_SHCSR_SECUREFAULTACT_BITS, 0x00000010
.equ	M33_SHCSR_SECUREFAULTACT_MSB, 4
.equ	M33_SHCSR_SECUREFAULTACT_LSB, 4
# -----------------------------------------------------------------------------
# Field       : M33_SHCSR_USGFAULTACT
# Description : `IAAMO the active state of the UsageFault exception `FTSSS
.equ	M33_SHCSR_USGFAULTACT_RESET, 0x0
.equ	M33_SHCSR_USGFAULTACT_BITS, 0x00000008
.equ	M33_SHCSR_USGFAULTACT_MSB, 3
.equ	M33_SHCSR_USGFAULTACT_LSB, 3
# -----------------------------------------------------------------------------
# Field       : M33_SHCSR_HARDFAULTACT
# Description : Indicates and allows limited modification of the active state
#               of the HardFault exception `FTSSS
.equ	M33_SHCSR_HARDFAULTACT_RESET, 0x0
.equ	M33_SHCSR_HARDFAULTACT_BITS, 0x00000004
.equ	M33_SHCSR_HARDFAULTACT_MSB, 2
.equ	M33_SHCSR_HARDFAULTACT_LSB, 2
# -----------------------------------------------------------------------------
# Field       : M33_SHCSR_BUSFAULTACT
# Description : `IAAMO the active state of the BusFault exception
.equ	M33_SHCSR_BUSFAULTACT_RESET, 0x0
.equ	M33_SHCSR_BUSFAULTACT_BITS, 0x00000002
.equ	M33_SHCSR_BUSFAULTACT_MSB, 1
.equ	M33_SHCSR_BUSFAULTACT_LSB, 1
# -----------------------------------------------------------------------------
# Field       : M33_SHCSR_MEMFAULTACT
# Description : `IAAMO the active state of the MemManage exception `FTSSS
.equ	M33_SHCSR_MEMFAULTACT_RESET, 0x0
.equ	M33_SHCSR_MEMFAULTACT_BITS, 0x00000001
.equ	M33_SHCSR_MEMFAULTACT_MSB, 0
.equ	M33_SHCSR_MEMFAULTACT_LSB, 0
# =============================================================================
# Register    : M33_CFSR
# Description : Contains the three Configurable Fault Status Registers.
#
#               31:16 UFSR: Provides information on UsageFault exceptions
#
#               15:8 BFSR: Provides information on BusFault exceptions
#
#               7:0 MMFSR: Provides information on MemManage exceptions
.equ	M33_CFSR_OFFSET, 0x0000ed28
.equ	M33_CFSR_BITS, 0x031fbfff
.equ	M33_CFSR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_CFSR_UFSR_DIVBYZERO
# Description : Sticky flag indicating whether an integer division by zero
#               error has occurred
.equ	M33_CFSR_UFSR_DIVBYZERO_RESET, 0x0
.equ	M33_CFSR_UFSR_DIVBYZERO_BITS, 0x02000000
.equ	M33_CFSR_UFSR_DIVBYZERO_MSB, 25
.equ	M33_CFSR_UFSR_DIVBYZERO_LSB, 25
# -----------------------------------------------------------------------------
# Field       : M33_CFSR_UFSR_UNALIGNED
# Description : Sticky flag indicating whether an unaligned access error has
#               occurred
.equ	M33_CFSR_UFSR_UNALIGNED_RESET, 0x0
.equ	M33_CFSR_UFSR_UNALIGNED_BITS, 0x01000000
.equ	M33_CFSR_UFSR_UNALIGNED_MSB, 24
.equ	M33_CFSR_UFSR_UNALIGNED_LSB, 24
# -----------------------------------------------------------------------------
# Field       : M33_CFSR_UFSR_STKOF
# Description : Sticky flag indicating whether a stack overflow error has
#               occurred
.equ	M33_CFSR_UFSR_STKOF_RESET, 0x0
.equ	M33_CFSR_UFSR_STKOF_BITS, 0x00100000
.equ	M33_CFSR_UFSR_STKOF_MSB, 20
.equ	M33_CFSR_UFSR_STKOF_LSB, 20
# -----------------------------------------------------------------------------
# Field       : M33_CFSR_UFSR_NOCP
# Description : Sticky flag indicating whether a coprocessor disabled or not
#               present error has occurred
.equ	M33_CFSR_UFSR_NOCP_RESET, 0x0
.equ	M33_CFSR_UFSR_NOCP_BITS, 0x00080000
.equ	M33_CFSR_UFSR_NOCP_MSB, 19
.equ	M33_CFSR_UFSR_NOCP_LSB, 19
# -----------------------------------------------------------------------------
# Field       : M33_CFSR_UFSR_INVPC
# Description : Sticky flag indicating whether an integrity check error has
#               occurred
.equ	M33_CFSR_UFSR_INVPC_RESET, 0x0
.equ	M33_CFSR_UFSR_INVPC_BITS, 0x00040000
.equ	M33_CFSR_UFSR_INVPC_MSB, 18
.equ	M33_CFSR_UFSR_INVPC_LSB, 18
# -----------------------------------------------------------------------------
# Field       : M33_CFSR_UFSR_INVSTATE
# Description : Sticky flag indicating whether an EPSR.T or EPSR.IT validity
#               error has occurred
.equ	M33_CFSR_UFSR_INVSTATE_RESET, 0x0
.equ	M33_CFSR_UFSR_INVSTATE_BITS, 0x00020000
.equ	M33_CFSR_UFSR_INVSTATE_MSB, 17
.equ	M33_CFSR_UFSR_INVSTATE_LSB, 17
# -----------------------------------------------------------------------------
# Field       : M33_CFSR_UFSR_UNDEFINSTR
# Description : Sticky flag indicating whether an undefined instruction error
#               has occurred
.equ	M33_CFSR_UFSR_UNDEFINSTR_RESET, 0x0
.equ	M33_CFSR_UFSR_UNDEFINSTR_BITS, 0x00010000
.equ	M33_CFSR_UFSR_UNDEFINSTR_MSB, 16
.equ	M33_CFSR_UFSR_UNDEFINSTR_LSB, 16
# -----------------------------------------------------------------------------
# Field       : M33_CFSR_BFSR_BFARVALID
# Description : Indicates validity of the contents of the BFAR register
.equ	M33_CFSR_BFSR_BFARVALID_RESET, 0x0
.equ	M33_CFSR_BFSR_BFARVALID_BITS, 0x00008000
.equ	M33_CFSR_BFSR_BFARVALID_MSB, 15
.equ	M33_CFSR_BFSR_BFARVALID_LSB, 15
# -----------------------------------------------------------------------------
# Field       : M33_CFSR_BFSR_LSPERR
# Description : Records whether a BusFault occurred during FP lazy state
#               preservation
.equ	M33_CFSR_BFSR_LSPERR_RESET, 0x0
.equ	M33_CFSR_BFSR_LSPERR_BITS, 0x00002000
.equ	M33_CFSR_BFSR_LSPERR_MSB, 13
.equ	M33_CFSR_BFSR_LSPERR_LSB, 13
# -----------------------------------------------------------------------------
# Field       : M33_CFSR_BFSR_STKERR
# Description : Records whether a derived BusFault occurred during exception
#               entry stacking
.equ	M33_CFSR_BFSR_STKERR_RESET, 0x0
.equ	M33_CFSR_BFSR_STKERR_BITS, 0x00001000
.equ	M33_CFSR_BFSR_STKERR_MSB, 12
.equ	M33_CFSR_BFSR_STKERR_LSB, 12
# -----------------------------------------------------------------------------
# Field       : M33_CFSR_BFSR_UNSTKERR
# Description : Records whether a derived BusFault occurred during exception
#               return unstacking
.equ	M33_CFSR_BFSR_UNSTKERR_RESET, 0x0
.equ	M33_CFSR_BFSR_UNSTKERR_BITS, 0x00000800
.equ	M33_CFSR_BFSR_UNSTKERR_MSB, 11
.equ	M33_CFSR_BFSR_UNSTKERR_LSB, 11
# -----------------------------------------------------------------------------
# Field       : M33_CFSR_BFSR_IMPRECISERR
# Description : Records whether an imprecise data access error has occurred
.equ	M33_CFSR_BFSR_IMPRECISERR_RESET, 0x0
.equ	M33_CFSR_BFSR_IMPRECISERR_BITS, 0x00000400
.equ	M33_CFSR_BFSR_IMPRECISERR_MSB, 10
.equ	M33_CFSR_BFSR_IMPRECISERR_LSB, 10
# -----------------------------------------------------------------------------
# Field       : M33_CFSR_BFSR_PRECISERR
# Description : Records whether a precise data access error has occurred
.equ	M33_CFSR_BFSR_PRECISERR_RESET, 0x0
.equ	M33_CFSR_BFSR_PRECISERR_BITS, 0x00000200
.equ	M33_CFSR_BFSR_PRECISERR_MSB, 9
.equ	M33_CFSR_BFSR_PRECISERR_LSB, 9
# -----------------------------------------------------------------------------
# Field       : M33_CFSR_BFSR_IBUSERR
# Description : Records whether a BusFault on an instruction prefetch has
#               occurred
.equ	M33_CFSR_BFSR_IBUSERR_RESET, 0x0
.equ	M33_CFSR_BFSR_IBUSERR_BITS, 0x00000100
.equ	M33_CFSR_BFSR_IBUSERR_MSB, 8
.equ	M33_CFSR_BFSR_IBUSERR_LSB, 8
# -----------------------------------------------------------------------------
# Field       : M33_CFSR_MMFSR
# Description : Provides information on MemManage exceptions
.equ	M33_CFSR_MMFSR_RESET, 0x00
.equ	M33_CFSR_MMFSR_BITS, 0x000000ff
.equ	M33_CFSR_MMFSR_MSB, 7
.equ	M33_CFSR_MMFSR_LSB, 0
# =============================================================================
# Register    : M33_HFSR
# Description : Shows the cause of any HardFaults
.equ	M33_HFSR_OFFSET, 0x0000ed2c
.equ	M33_HFSR_BITS, 0xc0000002
.equ	M33_HFSR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_HFSR_DEBUGEVT
# Description : Indicates when a Debug event has occurred
.equ	M33_HFSR_DEBUGEVT_RESET, 0x0
.equ	M33_HFSR_DEBUGEVT_BITS, 0x80000000
.equ	M33_HFSR_DEBUGEVT_MSB, 31
.equ	M33_HFSR_DEBUGEVT_LSB, 31
# -----------------------------------------------------------------------------
# Field       : M33_HFSR_FORCED
# Description : Indicates that a fault with configurable priority has been
#               escalated to a HardFault exception, because it could not be
#               made active, because of priority, or because it was disabled
.equ	M33_HFSR_FORCED_RESET, 0x0
.equ	M33_HFSR_FORCED_BITS, 0x40000000
.equ	M33_HFSR_FORCED_MSB, 30
.equ	M33_HFSR_FORCED_LSB, 30
# -----------------------------------------------------------------------------
# Field       : M33_HFSR_VECTTBL
# Description : Indicates when a fault has occurred because of a vector table
#               read error on exception processing
.equ	M33_HFSR_VECTTBL_RESET, 0x0
.equ	M33_HFSR_VECTTBL_BITS, 0x00000002
.equ	M33_HFSR_VECTTBL_MSB, 1
.equ	M33_HFSR_VECTTBL_LSB, 1
# =============================================================================
# Register    : M33_DFSR
# Description : Shows which debug event occurred
.equ	M33_DFSR_OFFSET, 0x0000ed30
.equ	M33_DFSR_BITS, 0x0000001f
.equ	M33_DFSR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_DFSR_EXTERNAL
# Description : Sticky flag indicating whether an External debug request debug
#               event has occurred
.equ	M33_DFSR_EXTERNAL_RESET, 0x0
.equ	M33_DFSR_EXTERNAL_BITS, 0x00000010
.equ	M33_DFSR_EXTERNAL_MSB, 4
.equ	M33_DFSR_EXTERNAL_LSB, 4
# -----------------------------------------------------------------------------
# Field       : M33_DFSR_VCATCH
# Description : Sticky flag indicating whether a Vector catch debug event has
#               occurred
.equ	M33_DFSR_VCATCH_RESET, 0x0
.equ	M33_DFSR_VCATCH_BITS, 0x00000008
.equ	M33_DFSR_VCATCH_MSB, 3
.equ	M33_DFSR_VCATCH_LSB, 3
# -----------------------------------------------------------------------------
# Field       : M33_DFSR_DWTTRAP
# Description : Sticky flag indicating whether a Watchpoint debug event has
#               occurred
.equ	M33_DFSR_DWTTRAP_RESET, 0x0
.equ	M33_DFSR_DWTTRAP_BITS, 0x00000004
.equ	M33_DFSR_DWTTRAP_MSB, 2
.equ	M33_DFSR_DWTTRAP_LSB, 2
# -----------------------------------------------------------------------------
# Field       : M33_DFSR_BKPT
# Description : Sticky flag indicating whether a Breakpoint debug event has
#               occurred
.equ	M33_DFSR_BKPT_RESET, 0x0
.equ	M33_DFSR_BKPT_BITS, 0x00000002
.equ	M33_DFSR_BKPT_MSB, 1
.equ	M33_DFSR_BKPT_LSB, 1
# -----------------------------------------------------------------------------
# Field       : M33_DFSR_HALTED
# Description : Sticky flag indicating that a Halt request debug event or Step
#               debug event has occurred
.equ	M33_DFSR_HALTED_RESET, 0x0
.equ	M33_DFSR_HALTED_BITS, 0x00000001
.equ	M33_DFSR_HALTED_MSB, 0
.equ	M33_DFSR_HALTED_LSB, 0
# =============================================================================
# Register    : M33_MMFAR
# Description : Shows the address of the memory location that caused an MPU
#               fault
.equ	M33_MMFAR_OFFSET, 0x0000ed34
.equ	M33_MMFAR_BITS, 0xffffffff
.equ	M33_MMFAR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_MMFAR_ADDRESS
# Description : This register is updated with the address of a location that
#               produced a MemManage fault. The MMFSR shows the cause of the
#               fault, and whether this field is valid. This field is valid
#               only when MMFSR.MMARVALID is set, otherwise it is UNKNOWN
.equ	M33_MMFAR_ADDRESS_RESET, 0x00000000
.equ	M33_MMFAR_ADDRESS_BITS, 0xffffffff
.equ	M33_MMFAR_ADDRESS_MSB, 31
.equ	M33_MMFAR_ADDRESS_LSB, 0
# =============================================================================
# Register    : M33_BFAR
# Description : Shows the address associated with a precise data access
#               BusFault
.equ	M33_BFAR_OFFSET, 0x0000ed38
.equ	M33_BFAR_BITS, 0xffffffff
.equ	M33_BFAR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_BFAR_ADDRESS
# Description : This register is updated with the address of a location that
#               produced a BusFault. The BFSR shows the reason for the fault.
#               This field is valid only when BFSR.BFARVALID is set, otherwise
#               it is UNKNOWN
.equ	M33_BFAR_ADDRESS_RESET, 0x00000000
.equ	M33_BFAR_ADDRESS_BITS, 0xffffffff
.equ	M33_BFAR_ADDRESS_MSB, 31
.equ	M33_BFAR_ADDRESS_LSB, 0
# =============================================================================
# Register    : M33_ID_PFR0
# Description : Gives top-level information about the instruction set supported
#               by the PE
.equ	M33_ID_PFR0_OFFSET, 0x0000ed40
.equ	M33_ID_PFR0_BITS, 0x000000ff
.equ	M33_ID_PFR0_RESET, 0x00000030
# -----------------------------------------------------------------------------
# Field       : M33_ID_PFR0_STATE1
# Description : T32 instruction set support
.equ	M33_ID_PFR0_STATE1_RESET, 0x3
.equ	M33_ID_PFR0_STATE1_BITS, 0x000000f0
.equ	M33_ID_PFR0_STATE1_MSB, 7
.equ	M33_ID_PFR0_STATE1_LSB, 4
# -----------------------------------------------------------------------------
# Field       : M33_ID_PFR0_STATE0
# Description : A32 instruction set support
.equ	M33_ID_PFR0_STATE0_RESET, 0x0
.equ	M33_ID_PFR0_STATE0_BITS, 0x0000000f
.equ	M33_ID_PFR0_STATE0_MSB, 3
.equ	M33_ID_PFR0_STATE0_LSB, 0
# =============================================================================
# Register    : M33_ID_PFR1
# Description : Gives information about the programmers' model and Extensions
#               support
.equ	M33_ID_PFR1_OFFSET, 0x0000ed44
.equ	M33_ID_PFR1_BITS, 0x00000ff0
.equ	M33_ID_PFR1_RESET, 0x00000520
# -----------------------------------------------------------------------------
# Field       : M33_ID_PFR1_MPROGMOD
# Description : Identifies support for the M-Profile programmers' model support
.equ	M33_ID_PFR1_MPROGMOD_RESET, 0x5
.equ	M33_ID_PFR1_MPROGMOD_BITS, 0x00000f00
.equ	M33_ID_PFR1_MPROGMOD_MSB, 11
.equ	M33_ID_PFR1_MPROGMOD_LSB, 8
# -----------------------------------------------------------------------------
# Field       : M33_ID_PFR1_SECURITY
# Description : Identifies whether the Security Extension is implemented
.equ	M33_ID_PFR1_SECURITY_RESET, 0x2
.equ	M33_ID_PFR1_SECURITY_BITS, 0x000000f0
.equ	M33_ID_PFR1_SECURITY_MSB, 7
.equ	M33_ID_PFR1_SECURITY_LSB, 4
# =============================================================================
# Register    : M33_ID_DFR0
# Description : Provides top level information about the debug system
.equ	M33_ID_DFR0_OFFSET, 0x0000ed48
.equ	M33_ID_DFR0_BITS, 0x00f00000
.equ	M33_ID_DFR0_RESET, 0x00200000
# -----------------------------------------------------------------------------
# Field       : M33_ID_DFR0_MPROFDBG
