konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/m33.inc
# Description : Indicates the supported M-profile debug architecture
.equ	M33_ID_DFR0_MPROFDBG_RESET, 0x2
.equ	M33_ID_DFR0_MPROFDBG_BITS, 0x00f00000
.equ	M33_ID_DFR0_MPROFDBG_MSB, 23
.equ	M33_ID_DFR0_MPROFDBG_LSB, 20
# =============================================================================
# Register    : M33_ID_AFR0
# Description : Provides information about the IMPLEMENTATION DEFINED features
#               of the PE
.equ	M33_ID_AFR0_OFFSET, 0x0000ed4c
.equ	M33_ID_AFR0_BITS, 0x0000ffff
.equ	M33_ID_AFR0_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_ID_AFR0_IMPDEF3
# Description : IMPLEMENTATION DEFINED meaning
.equ	M33_ID_AFR0_IMPDEF3_RESET, 0x0
.equ	M33_ID_AFR0_IMPDEF3_BITS, 0x0000f000
.equ	M33_ID_AFR0_IMPDEF3_MSB, 15
.equ	M33_ID_AFR0_IMPDEF3_LSB, 12
# -----------------------------------------------------------------------------
# Field       : M33_ID_AFR0_IMPDEF2
# Description : IMPLEMENTATION DEFINED meaning
.equ	M33_ID_AFR0_IMPDEF2_RESET, 0x0
.equ	M33_ID_AFR0_IMPDEF2_BITS, 0x00000f00
.equ	M33_ID_AFR0_IMPDEF2_MSB, 11
.equ	M33_ID_AFR0_IMPDEF2_LSB, 8
# -----------------------------------------------------------------------------
# Field       : M33_ID_AFR0_IMPDEF1
# Description : IMPLEMENTATION DEFINED meaning
.equ	M33_ID_AFR0_IMPDEF1_RESET, 0x0
.equ	M33_ID_AFR0_IMPDEF1_BITS, 0x000000f0
.equ	M33_ID_AFR0_IMPDEF1_MSB, 7
.equ	M33_ID_AFR0_IMPDEF1_LSB, 4
# -----------------------------------------------------------------------------
# Field       : M33_ID_AFR0_IMPDEF0
# Description : IMPLEMENTATION DEFINED meaning
.equ	M33_ID_AFR0_IMPDEF0_RESET, 0x0
.equ	M33_ID_AFR0_IMPDEF0_BITS, 0x0000000f
.equ	M33_ID_AFR0_IMPDEF0_MSB, 3
.equ	M33_ID_AFR0_IMPDEF0_LSB, 0
# =============================================================================
# Register    : M33_ID_MMFR0
# Description : Provides information about the implemented memory model and
#               memory management support
.equ	M33_ID_MMFR0_OFFSET, 0x0000ed50
.equ	M33_ID_MMFR0_BITS, 0x00fffff0
.equ	M33_ID_MMFR0_RESET, 0x00101f40
# -----------------------------------------------------------------------------
# Field       : M33_ID_MMFR0_AUXREG
# Description : Indicates support for Auxiliary Control Registers
.equ	M33_ID_MMFR0_AUXREG_RESET, 0x1
.equ	M33_ID_MMFR0_AUXREG_BITS, 0x00f00000
.equ	M33_ID_MMFR0_AUXREG_MSB, 23
.equ	M33_ID_MMFR0_AUXREG_LSB, 20
# -----------------------------------------------------------------------------
# Field       : M33_ID_MMFR0_TCM
# Description : Indicates support for tightly coupled memories (TCMs)
.equ	M33_ID_MMFR0_TCM_RESET, 0x0
.equ	M33_ID_MMFR0_TCM_BITS, 0x000f0000
.equ	M33_ID_MMFR0_TCM_MSB, 19
.equ	M33_ID_MMFR0_TCM_LSB, 16
# -----------------------------------------------------------------------------
# Field       : M33_ID_MMFR0_SHARELVL
# Description : Indicates the number of shareability levels implemented
.equ	M33_ID_MMFR0_SHARELVL_RESET, 0x1
.equ	M33_ID_MMFR0_SHARELVL_BITS, 0x0000f000
.equ	M33_ID_MMFR0_SHARELVL_MSB, 15
.equ	M33_ID_MMFR0_SHARELVL_LSB, 12
# -----------------------------------------------------------------------------
# Field       : M33_ID_MMFR0_OUTERSHR
# Description : Indicates the outermost shareability domain implemented
.equ	M33_ID_MMFR0_OUTERSHR_RESET, 0xf
.equ	M33_ID_MMFR0_OUTERSHR_BITS, 0x00000f00
.equ	M33_ID_MMFR0_OUTERSHR_MSB, 11
.equ	M33_ID_MMFR0_OUTERSHR_LSB, 8
# -----------------------------------------------------------------------------
# Field       : M33_ID_MMFR0_PMSA
# Description : Indicates support for the protected memory system architecture
#               (PMSA)
.equ	M33_ID_MMFR0_PMSA_RESET, 0x4
.equ	M33_ID_MMFR0_PMSA_BITS, 0x000000f0
.equ	M33_ID_MMFR0_PMSA_MSB, 7
.equ	M33_ID_MMFR0_PMSA_LSB, 4
# =============================================================================
# Register    : M33_ID_MMFR1
# Description : Provides information about the implemented memory model and
#               memory management support
.equ	M33_ID_MMFR1_OFFSET, 0x0000ed54
.equ	M33_ID_MMFR1_BITS, 0x00000000
.equ	M33_ID_MMFR1_RESET, 0x00000000
.equ	M33_ID_MMFR1_MSB, 31
.equ	M33_ID_MMFR1_LSB, 0
# =============================================================================
# Register    : M33_ID_MMFR2
# Description : Provides information about the implemented memory model and
#               memory management support
.equ	M33_ID_MMFR2_OFFSET, 0x0000ed58
.equ	M33_ID_MMFR2_BITS, 0x0f000000
.equ	M33_ID_MMFR2_RESET, 0x01000000
# -----------------------------------------------------------------------------
# Field       : M33_ID_MMFR2_WFISTALL
# Description : Indicates the support for Wait For Interrupt (WFI) stalling
.equ	M33_ID_MMFR2_WFISTALL_RESET, 0x1
.equ	M33_ID_MMFR2_WFISTALL_BITS, 0x0f000000
.equ	M33_ID_MMFR2_WFISTALL_MSB, 27
.equ	M33_ID_MMFR2_WFISTALL_LSB, 24
# =============================================================================
# Register    : M33_ID_MMFR3
# Description : Provides information about the implemented memory model and
#               memory management support
.equ	M33_ID_MMFR3_OFFSET, 0x0000ed5c
.equ	M33_ID_MMFR3_BITS, 0x00000fff
.equ	M33_ID_MMFR3_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_ID_MMFR3_BPMAINT
# Description : Indicates the supported branch predictor maintenance
.equ	M33_ID_MMFR3_BPMAINT_RESET, 0x0
.equ	M33_ID_MMFR3_BPMAINT_BITS, 0x00000f00
.equ	M33_ID_MMFR3_BPMAINT_MSB, 11
.equ	M33_ID_MMFR3_BPMAINT_LSB, 8
# -----------------------------------------------------------------------------
# Field       : M33_ID_MMFR3_CMAINTSW
# Description : Indicates the supported cache maintenance operations by set/way
.equ	M33_ID_MMFR3_CMAINTSW_RESET, 0x0
.equ	M33_ID_MMFR3_CMAINTSW_BITS, 0x000000f0
.equ	M33_ID_MMFR3_CMAINTSW_MSB, 7
.equ	M33_ID_MMFR3_CMAINTSW_LSB, 4
# -----------------------------------------------------------------------------
# Field       : M33_ID_MMFR3_CMAINTVA
# Description : Indicates the supported cache maintenance operations by address
.equ	M33_ID_MMFR3_CMAINTVA_RESET, 0x0
.equ	M33_ID_MMFR3_CMAINTVA_BITS, 0x0000000f
.equ	M33_ID_MMFR3_CMAINTVA_MSB, 3
.equ	M33_ID_MMFR3_CMAINTVA_LSB, 0
# =============================================================================
# Register    : M33_ID_ISAR0
# Description : Provides information about the instruction set implemented by
#               the PE
.equ	M33_ID_ISAR0_OFFSET, 0x0000ed60
.equ	M33_ID_ISAR0_BITS, 0x0ffffff0
.equ	M33_ID_ISAR0_RESET, 0x08092300
# -----------------------------------------------------------------------------
# Field       : M33_ID_ISAR0_DIVIDE
# Description : Indicates the supported Divide instructions
.equ	M33_ID_ISAR0_DIVIDE_RESET, 0x8
.equ	M33_ID_ISAR0_DIVIDE_BITS, 0x0f000000
.equ	M33_ID_ISAR0_DIVIDE_MSB, 27
.equ	M33_ID_ISAR0_DIVIDE_LSB, 24
# -----------------------------------------------------------------------------
# Field       : M33_ID_ISAR0_DEBUG
# Description : Indicates the implemented Debug instructions
.equ	M33_ID_ISAR0_DEBUG_RESET, 0x0
.equ	M33_ID_ISAR0_DEBUG_BITS, 0x00f00000
.equ	M33_ID_ISAR0_DEBUG_MSB, 23
.equ	M33_ID_ISAR0_DEBUG_LSB, 20
# -----------------------------------------------------------------------------
# Field       : M33_ID_ISAR0_COPROC
# Description : Indicates the supported Coprocessor instructions
.equ	M33_ID_ISAR0_COPROC_RESET, 0x9
.equ	M33_ID_ISAR0_COPROC_BITS, 0x000f0000
.equ	M33_ID_ISAR0_COPROC_MSB, 19
.equ	M33_ID_ISAR0_COPROC_LSB, 16
# -----------------------------------------------------------------------------
# Field       : M33_ID_ISAR0_CMPBRANCH
# Description : Indicates the supported combined Compare and Branch
#               instructions
.equ	M33_ID_ISAR0_CMPBRANCH_RESET, 0x2
.equ	M33_ID_ISAR0_CMPBRANCH_BITS, 0x0000f000
.equ	M33_ID_ISAR0_CMPBRANCH_MSB, 15
.equ	M33_ID_ISAR0_CMPBRANCH_LSB, 12
# -----------------------------------------------------------------------------
# Field       : M33_ID_ISAR0_BITFIELD
# Description : Indicates the supported bit field instructions
.equ	M33_ID_ISAR0_BITFIELD_RESET, 0x3
.equ	M33_ID_ISAR0_BITFIELD_BITS, 0x00000f00
.equ	M33_ID_ISAR0_BITFIELD_MSB, 11
.equ	M33_ID_ISAR0_BITFIELD_LSB, 8
# -----------------------------------------------------------------------------
# Field       : M33_ID_ISAR0_BITCOUNT
# Description : Indicates the supported bit count instructions
.equ	M33_ID_ISAR0_BITCOUNT_RESET, 0x0
.equ	M33_ID_ISAR0_BITCOUNT_BITS, 0x000000f0
.equ	M33_ID_ISAR0_BITCOUNT_MSB, 7
.equ	M33_ID_ISAR0_BITCOUNT_LSB, 4
# =============================================================================
# Register    : M33_ID_ISAR1
# Description : Provides information about the instruction set implemented by
#               the PE
.equ	M33_ID_ISAR1_OFFSET, 0x0000ed64
.equ	M33_ID_ISAR1_BITS, 0x0ffff000
.equ	M33_ID_ISAR1_RESET, 0x05725000
# -----------------------------------------------------------------------------
# Field       : M33_ID_ISAR1_INTERWORK
# Description : Indicates the implemented Interworking instructions
.equ	M33_ID_ISAR1_INTERWORK_RESET, 0x5
.equ	M33_ID_ISAR1_INTERWORK_BITS, 0x0f000000
.equ	M33_ID_ISAR1_INTERWORK_MSB, 27
.equ	M33_ID_ISAR1_INTERWORK_LSB, 24
# -----------------------------------------------------------------------------
# Field       : M33_ID_ISAR1_IMMEDIATE
# Description : Indicates the implemented for data-processing instructions with
#               long immediates
.equ	M33_ID_ISAR1_IMMEDIATE_RESET, 0x7
.equ	M33_ID_ISAR1_IMMEDIATE_BITS, 0x00f00000
.equ	M33_ID_ISAR1_IMMEDIATE_MSB, 23
.equ	M33_ID_ISAR1_IMMEDIATE_LSB, 20
# -----------------------------------------------------------------------------
# Field       : M33_ID_ISAR1_IFTHEN
# Description : Indicates the implemented If-Then instructions
.equ	M33_ID_ISAR1_IFTHEN_RESET, 0x2
.equ	M33_ID_ISAR1_IFTHEN_BITS, 0x000f0000
.equ	M33_ID_ISAR1_IFTHEN_MSB, 19
.equ	M33_ID_ISAR1_IFTHEN_LSB, 16
# -----------------------------------------------------------------------------
# Field       : M33_ID_ISAR1_EXTEND
# Description : Indicates the implemented Extend instructions
.equ	M33_ID_ISAR1_EXTEND_RESET, 0x5
.equ	M33_ID_ISAR1_EXTEND_BITS, 0x0000f000
.equ	M33_ID_ISAR1_EXTEND_MSB, 15
.equ	M33_ID_ISAR1_EXTEND_LSB, 12
# =============================================================================
# Register    : M33_ID_ISAR2
# Description : Provides information about the instruction set implemented by
#               the PE
.equ	M33_ID_ISAR2_OFFSET, 0x0000ed68
.equ	M33_ID_ISAR2_BITS, 0xf0ffffff
.equ	M33_ID_ISAR2_RESET, 0x30173426
# -----------------------------------------------------------------------------
# Field       : M33_ID_ISAR2_REVERSAL
# Description : Indicates the implemented Reversal instructions
.equ	M33_ID_ISAR2_REVERSAL_RESET, 0x3
.equ	M33_ID_ISAR2_REVERSAL_BITS, 0xf0000000
.equ	M33_ID_ISAR2_REVERSAL_MSB, 31
.equ	M33_ID_ISAR2_REVERSAL_LSB, 28
# -----------------------------------------------------------------------------
# Field       : M33_ID_ISAR2_MULTU
# Description : Indicates the implemented advanced unsigned Multiply
#               instructions
.equ	M33_ID_ISAR2_MULTU_RESET, 0x1
.equ	M33_ID_ISAR2_MULTU_BITS, 0x00f00000
.equ	M33_ID_ISAR2_MULTU_MSB, 23
.equ	M33_ID_ISAR2_MULTU_LSB, 20
# -----------------------------------------------------------------------------
# Field       : M33_ID_ISAR2_MULTS
# Description : Indicates the implemented advanced signed Multiply instructions
.equ	M33_ID_ISAR2_MULTS_RESET, 0x7
.equ	M33_ID_ISAR2_MULTS_BITS, 0x000f0000
.equ	M33_ID_ISAR2_MULTS_MSB, 19
.equ	M33_ID_ISAR2_MULTS_LSB, 16
# -----------------------------------------------------------------------------
# Field       : M33_ID_ISAR2_MULT
# Description : Indicates the implemented additional Multiply instructions
.equ	M33_ID_ISAR2_MULT_RESET, 0x3
.equ	M33_ID_ISAR2_MULT_BITS, 0x0000f000
.equ	M33_ID_ISAR2_MULT_MSB, 15
.equ	M33_ID_ISAR2_MULT_LSB, 12
# -----------------------------------------------------------------------------
# Field       : M33_ID_ISAR2_MULTIACCESSINT
# Description : Indicates the support for interruptible multi-access
#               instructions
.equ	M33_ID_ISAR2_MULTIACCESSINT_RESET, 0x4
.equ	M33_ID_ISAR2_MULTIACCESSINT_BITS, 0x00000f00
.equ	M33_ID_ISAR2_MULTIACCESSINT_MSB, 11
.equ	M33_ID_ISAR2_MULTIACCESSINT_LSB, 8
# -----------------------------------------------------------------------------
# Field       : M33_ID_ISAR2_MEMHINT
# Description : Indicates the implemented Memory Hint instructions
.equ	M33_ID_ISAR2_MEMHINT_RESET, 0x2
.equ	M33_ID_ISAR2_MEMHINT_BITS, 0x000000f0
.equ	M33_ID_ISAR2_MEMHINT_MSB, 7
.equ	M33_ID_ISAR2_MEMHINT_LSB, 4
# -----------------------------------------------------------------------------
# Field       : M33_ID_ISAR2_LOADSTORE
# Description : Indicates the implemented additional load/store instructions
.equ	M33_ID_ISAR2_LOADSTORE_RESET, 0x6
.equ	M33_ID_ISAR2_LOADSTORE_BITS, 0x0000000f
.equ	M33_ID_ISAR2_LOADSTORE_MSB, 3
.equ	M33_ID_ISAR2_LOADSTORE_LSB, 0
# =============================================================================
# Register    : M33_ID_ISAR3
# Description : Provides information about the instruction set implemented by
#               the PE
.equ	M33_ID_ISAR3_OFFSET, 0x0000ed6c
.equ	M33_ID_ISAR3_BITS, 0x0fffffff
.equ	M33_ID_ISAR3_RESET, 0x07895729
# -----------------------------------------------------------------------------
# Field       : M33_ID_ISAR3_TRUENOP
# Description : Indicates the implemented true NOP instructions
.equ	M33_ID_ISAR3_TRUENOP_RESET, 0x7
.equ	M33_ID_ISAR3_TRUENOP_BITS, 0x0f000000
.equ	M33_ID_ISAR3_TRUENOP_MSB, 27
.equ	M33_ID_ISAR3_TRUENOP_LSB, 24
# -----------------------------------------------------------------------------
# Field       : M33_ID_ISAR3_T32COPY
# Description : Indicates the support for T32 non flag-setting MOV instructions
.equ	M33_ID_ISAR3_T32COPY_RESET, 0x8
.equ	M33_ID_ISAR3_T32COPY_BITS, 0x00f00000
.equ	M33_ID_ISAR3_T32COPY_MSB, 23
.equ	M33_ID_ISAR3_T32COPY_LSB, 20
# -----------------------------------------------------------------------------
# Field       : M33_ID_ISAR3_TABBRANCH
# Description : Indicates the implemented Table Branch instructions
.equ	M33_ID_ISAR3_TABBRANCH_RESET, 0x9
.equ	M33_ID_ISAR3_TABBRANCH_BITS, 0x000f0000
.equ	M33_ID_ISAR3_TABBRANCH_MSB, 19
.equ	M33_ID_ISAR3_TABBRANCH_LSB, 16
# -----------------------------------------------------------------------------
# Field       : M33_ID_ISAR3_SYNCHPRIM
# Description : Used in conjunction with ID_ISAR4.SynchPrim_frac to indicate
#               the implemented Synchronization Primitive instructions
.equ	M33_ID_ISAR3_SYNCHPRIM_RESET, 0x5
.equ	M33_ID_ISAR3_SYNCHPRIM_BITS, 0x0000f000
.equ	M33_ID_ISAR3_SYNCHPRIM_MSB, 15
.equ	M33_ID_ISAR3_SYNCHPRIM_LSB, 12
# -----------------------------------------------------------------------------
# Field       : M33_ID_ISAR3_SVC
# Description : Indicates the implemented SVC instructions
.equ	M33_ID_ISAR3_SVC_RESET, 0x7
.equ	M33_ID_ISAR3_SVC_BITS, 0x00000f00
.equ	M33_ID_ISAR3_SVC_MSB, 11
.equ	M33_ID_ISAR3_SVC_LSB, 8
# -----------------------------------------------------------------------------
# Field       : M33_ID_ISAR3_SIMD
# Description : Indicates the implemented SIMD instructions
.equ	M33_ID_ISAR3_SIMD_RESET, 0x2
.equ	M33_ID_ISAR3_SIMD_BITS, 0x000000f0
.equ	M33_ID_ISAR3_SIMD_MSB, 7
.equ	M33_ID_ISAR3_SIMD_LSB, 4
# -----------------------------------------------------------------------------
# Field       : M33_ID_ISAR3_SATURATE
# Description : Indicates the implemented saturating instructions
.equ	M33_ID_ISAR3_SATURATE_RESET, 0x9
.equ	M33_ID_ISAR3_SATURATE_BITS, 0x0000000f
.equ	M33_ID_ISAR3_SATURATE_MSB, 3
.equ	M33_ID_ISAR3_SATURATE_LSB, 0
# =============================================================================
# Register    : M33_ID_ISAR4
# Description : Provides information about the instruction set implemented by
#               the PE
.equ	M33_ID_ISAR4_OFFSET, 0x0000ed70
.equ	M33_ID_ISAR4_BITS, 0x0fff0fff
.equ	M33_ID_ISAR4_RESET, 0x01310132
# -----------------------------------------------------------------------------
# Field       : M33_ID_ISAR4_PSR_M
# Description : Indicates the implemented M profile instructions to modify the
#               PSRs
.equ	M33_ID_ISAR4_PSR_M_RESET, 0x1
.equ	M33_ID_ISAR4_PSR_M_BITS, 0x0f000000
.equ	M33_ID_ISAR4_PSR_M_MSB, 27
.equ	M33_ID_ISAR4_PSR_M_LSB, 24
# -----------------------------------------------------------------------------
# Field       : M33_ID_ISAR4_SYNCPRIM_FRAC
# Description : Used in conjunction with ID_ISAR3.SynchPrim to indicate the
#               implemented Synchronization Primitive instructions
.equ	M33_ID_ISAR4_SYNCPRIM_FRAC_RESET, 0x3
.equ	M33_ID_ISAR4_SYNCPRIM_FRAC_BITS, 0x00f00000
.equ	M33_ID_ISAR4_SYNCPRIM_FRAC_MSB, 23
.equ	M33_ID_ISAR4_SYNCPRIM_FRAC_LSB, 20
# -----------------------------------------------------------------------------
# Field       : M33_ID_ISAR4_BARRIER
# Description : Indicates the implemented Barrier instructions
.equ	M33_ID_ISAR4_BARRIER_RESET, 0x1
.equ	M33_ID_ISAR4_BARRIER_BITS, 0x000f0000
.equ	M33_ID_ISAR4_BARRIER_MSB, 19
.equ	M33_ID_ISAR4_BARRIER_LSB, 16
# -----------------------------------------------------------------------------
# Field       : M33_ID_ISAR4_WRITEBACK
# Description : Indicates the support for writeback addressing modes
.equ	M33_ID_ISAR4_WRITEBACK_RESET, 0x1
.equ	M33_ID_ISAR4_WRITEBACK_BITS, 0x00000f00
.equ	M33_ID_ISAR4_WRITEBACK_MSB, 11
.equ	M33_ID_ISAR4_WRITEBACK_LSB, 8
# -----------------------------------------------------------------------------
# Field       : M33_ID_ISAR4_WITHSHIFTS
# Description : Indicates the support for writeback addressing modes
.equ	M33_ID_ISAR4_WITHSHIFTS_RESET, 0x3
.equ	M33_ID_ISAR4_WITHSHIFTS_BITS, 0x000000f0
.equ	M33_ID_ISAR4_WITHSHIFTS_MSB, 7
.equ	M33_ID_ISAR4_WITHSHIFTS_LSB, 4
# -----------------------------------------------------------------------------
# Field       : M33_ID_ISAR4_UNPRIV
# Description : Indicates the implemented unprivileged instructions
.equ	M33_ID_ISAR4_UNPRIV_RESET, 0x2
.equ	M33_ID_ISAR4_UNPRIV_BITS, 0x0000000f
.equ	M33_ID_ISAR4_UNPRIV_MSB, 3
.equ	M33_ID_ISAR4_UNPRIV_LSB, 0
# =============================================================================
# Register    : M33_ID_ISAR5
# Description : Provides information about the instruction set implemented by
#               the PE
.equ	M33_ID_ISAR5_OFFSET, 0x0000ed74
.equ	M33_ID_ISAR5_BITS, 0x00000000
.equ	M33_ID_ISAR5_RESET, 0x00000000
.equ	M33_ID_ISAR5_MSB, 31
.equ	M33_ID_ISAR5_LSB, 0
# =============================================================================
# Register    : M33_CTR
# Description : Provides information about the architecture of the caches. CTR
#               is RES0 if CLIDR is zero.
.equ	M33_CTR_OFFSET, 0x0000ed7c
.equ	M33_CTR_BITS, 0x8fffc00f
.equ	M33_CTR_RESET, 0x8000c000
# -----------------------------------------------------------------------------
# Field       : M33_CTR_RES1
# Description : Reserved, RES1
.equ	M33_CTR_RES1_RESET, 0x1
.equ	M33_CTR_RES1_BITS, 0x80000000
.equ	M33_CTR_RES1_MSB, 31
.equ	M33_CTR_RES1_LSB, 31
# -----------------------------------------------------------------------------
# Field       : M33_CTR_CWG
# Description : Log2 of the number of words of the maximum size of memory that
#               can be overwritten as a result of the eviction of a cache entry
#               that has had a memory location in it modified
.equ	M33_CTR_CWG_RESET, 0x0
.equ	M33_CTR_CWG_BITS, 0x0f000000
.equ	M33_CTR_CWG_MSB, 27
.equ	M33_CTR_CWG_LSB, 24
# -----------------------------------------------------------------------------
# Field       : M33_CTR_ERG
# Description : Log2 of the number of words of the maximum size of the
#               reservation granule that has been implemented for the Load-
#               Exclusive and Store-Exclusive instructions
.equ	M33_CTR_ERG_RESET, 0x0
.equ	M33_CTR_ERG_BITS, 0x00f00000
.equ	M33_CTR_ERG_MSB, 23
.equ	M33_CTR_ERG_LSB, 20
# -----------------------------------------------------------------------------
# Field       : M33_CTR_DMINLINE
# Description : Log2 of the number of words in the smallest cache line of all
#               the data caches and unified caches that are controlled by the
#               PE
.equ	M33_CTR_DMINLINE_RESET, 0x0
.equ	M33_CTR_DMINLINE_BITS, 0x000f0000
.equ	M33_CTR_DMINLINE_MSB, 19
.equ	M33_CTR_DMINLINE_LSB, 16
# -----------------------------------------------------------------------------
# Field       : M33_CTR_RES1_1
# Description : Reserved, RES1
.equ	M33_CTR_RES1_1_RESET, 0x3
.equ	M33_CTR_RES1_1_BITS, 0x0000c000
.equ	M33_CTR_RES1_1_MSB, 15
.equ	M33_CTR_RES1_1_LSB, 14
# -----------------------------------------------------------------------------
# Field       : M33_CTR_IMINLINE
# Description : Log2 of the number of words in the smallest cache line of all
#               the instruction caches that are controlled by the PE
.equ	M33_CTR_IMINLINE_RESET, 0x0
.equ	M33_CTR_IMINLINE_BITS, 0x0000000f
.equ	M33_CTR_IMINLINE_MSB, 3
.equ	M33_CTR_IMINLINE_LSB, 0
# =============================================================================
# Register    : M33_CPACR
# Description : Specifies the access privileges for coprocessors and the FP
#               Extension
.equ	M33_CPACR_OFFSET, 0x0000ed88
.equ	M33_CPACR_BITS, 0x00f0ffff
.equ	M33_CPACR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_CPACR_CP11
# Description : The value in this field is ignored. If the implementation does
#               not include the FP Extension, this field is RAZ/WI. If the
#               value of this bit is not programmed to the same value as the
#               CP10 field, then the value is UNKNOWN
.equ	M33_CPACR_CP11_RESET, 0x0
.equ	M33_CPACR_CP11_BITS, 0x00c00000
.equ	M33_CPACR_CP11_MSB, 23
.equ	M33_CPACR_CP11_LSB, 22
# -----------------------------------------------------------------------------
# Field       : M33_CPACR_CP10
# Description : Defines the access rights for the floating-point functionality
.equ	M33_CPACR_CP10_RESET, 0x0
.equ	M33_CPACR_CP10_BITS, 0x00300000
.equ	M33_CPACR_CP10_MSB, 21
.equ	M33_CPACR_CP10_LSB, 20
# -----------------------------------------------------------------------------
# Field       : M33_CPACR_CP7
# Description : Controls access privileges for coprocessor 7
.equ	M33_CPACR_CP7_RESET, 0x0
.equ	M33_CPACR_CP7_BITS, 0x0000c000
.equ	M33_CPACR_CP7_MSB, 15
.equ	M33_CPACR_CP7_LSB, 14
# -----------------------------------------------------------------------------
# Field       : M33_CPACR_CP6
# Description : Controls access privileges for coprocessor 6
.equ	M33_CPACR_CP6_RESET, 0x0
.equ	M33_CPACR_CP6_BITS, 0x00003000
.equ	M33_CPACR_CP6_MSB, 13
.equ	M33_CPACR_CP6_LSB, 12
# -----------------------------------------------------------------------------
# Field       : M33_CPACR_CP5
# Description : Controls access privileges for coprocessor 5
.equ	M33_CPACR_CP5_RESET, 0x0
.equ	M33_CPACR_CP5_BITS, 0x00000c00
.equ	M33_CPACR_CP5_MSB, 11
.equ	M33_CPACR_CP5_LSB, 10
# -----------------------------------------------------------------------------
# Field       : M33_CPACR_CP4
# Description : Controls access privileges for coprocessor 4
.equ	M33_CPACR_CP4_RESET, 0x0
.equ	M33_CPACR_CP4_BITS, 0x00000300
.equ	M33_CPACR_CP4_MSB, 9
.equ	M33_CPACR_CP4_LSB, 8
# -----------------------------------------------------------------------------
# Field       : M33_CPACR_CP3
# Description : Controls access privileges for coprocessor 3
.equ	M33_CPACR_CP3_RESET, 0x0
.equ	M33_CPACR_CP3_BITS, 0x000000c0
.equ	M33_CPACR_CP3_MSB, 7
.equ	M33_CPACR_CP3_LSB, 6
# -----------------------------------------------------------------------------
# Field       : M33_CPACR_CP2
# Description : Controls access privileges for coprocessor 2
.equ	M33_CPACR_CP2_RESET, 0x0
.equ	M33_CPACR_CP2_BITS, 0x00000030
.equ	M33_CPACR_CP2_MSB, 5
.equ	M33_CPACR_CP2_LSB, 4
# -----------------------------------------------------------------------------
# Field       : M33_CPACR_CP1
