konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/m33.inc
# Description : Controls access privileges for coprocessor 1
.equ	M33_CPACR_CP1_RESET, 0x0
.equ	M33_CPACR_CP1_BITS, 0x0000000c
.equ	M33_CPACR_CP1_MSB, 3
.equ	M33_CPACR_CP1_LSB, 2
# -----------------------------------------------------------------------------
# Field       : M33_CPACR_CP0
# Description : Controls access privileges for coprocessor 0
.equ	M33_CPACR_CP0_RESET, 0x0
.equ	M33_CPACR_CP0_BITS, 0x00000003
.equ	M33_CPACR_CP0_MSB, 1
.equ	M33_CPACR_CP0_LSB, 0
# =============================================================================
# Register    : M33_NSACR
# Description : Defines the Non-secure access permissions for both the FP
#               Extension and coprocessors CP0 to CP7
.equ	M33_NSACR_OFFSET, 0x0000ed8c
.equ	M33_NSACR_BITS, 0x00000cff
.equ	M33_NSACR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_NSACR_CP11
# Description : Enables Non-secure access to the Floating-point Extension
.equ	M33_NSACR_CP11_RESET, 0x0
.equ	M33_NSACR_CP11_BITS, 0x00000800
.equ	M33_NSACR_CP11_MSB, 11
.equ	M33_NSACR_CP11_LSB, 11
# -----------------------------------------------------------------------------
# Field       : M33_NSACR_CP10
# Description : Enables Non-secure access to the Floating-point Extension
.equ	M33_NSACR_CP10_RESET, 0x0
.equ	M33_NSACR_CP10_BITS, 0x00000400
.equ	M33_NSACR_CP10_MSB, 10
.equ	M33_NSACR_CP10_LSB, 10
# -----------------------------------------------------------------------------
# Field       : M33_NSACR_CP7
# Description : Enables Non-secure access to coprocessor CP7
.equ	M33_NSACR_CP7_RESET, 0x0
.equ	M33_NSACR_CP7_BITS, 0x00000080
.equ	M33_NSACR_CP7_MSB, 7
.equ	M33_NSACR_CP7_LSB, 7
# -----------------------------------------------------------------------------
# Field       : M33_NSACR_CP6
# Description : Enables Non-secure access to coprocessor CP6
.equ	M33_NSACR_CP6_RESET, 0x0
.equ	M33_NSACR_CP6_BITS, 0x00000040
.equ	M33_NSACR_CP6_MSB, 6
.equ	M33_NSACR_CP6_LSB, 6
# -----------------------------------------------------------------------------
# Field       : M33_NSACR_CP5
# Description : Enables Non-secure access to coprocessor CP5
.equ	M33_NSACR_CP5_RESET, 0x0
.equ	M33_NSACR_CP5_BITS, 0x00000020
.equ	M33_NSACR_CP5_MSB, 5
.equ	M33_NSACR_CP5_LSB, 5
# -----------------------------------------------------------------------------
# Field       : M33_NSACR_CP4
# Description : Enables Non-secure access to coprocessor CP4
.equ	M33_NSACR_CP4_RESET, 0x0
.equ	M33_NSACR_CP4_BITS, 0x00000010
.equ	M33_NSACR_CP4_MSB, 4
.equ	M33_NSACR_CP4_LSB, 4
# -----------------------------------------------------------------------------
# Field       : M33_NSACR_CP3
# Description : Enables Non-secure access to coprocessor CP3
.equ	M33_NSACR_CP3_RESET, 0x0
.equ	M33_NSACR_CP3_BITS, 0x00000008
.equ	M33_NSACR_CP3_MSB, 3
.equ	M33_NSACR_CP3_LSB, 3
# -----------------------------------------------------------------------------
# Field       : M33_NSACR_CP2
# Description : Enables Non-secure access to coprocessor CP2
.equ	M33_NSACR_CP2_RESET, 0x0
.equ	M33_NSACR_CP2_BITS, 0x00000004
.equ	M33_NSACR_CP2_MSB, 2
.equ	M33_NSACR_CP2_LSB, 2
# -----------------------------------------------------------------------------
# Field       : M33_NSACR_CP1
# Description : Enables Non-secure access to coprocessor CP1
.equ	M33_NSACR_CP1_RESET, 0x0
.equ	M33_NSACR_CP1_BITS, 0x00000002
.equ	M33_NSACR_CP1_MSB, 1
.equ	M33_NSACR_CP1_LSB, 1
# -----------------------------------------------------------------------------
# Field       : M33_NSACR_CP0
# Description : Enables Non-secure access to coprocessor CP0
.equ	M33_NSACR_CP0_RESET, 0x0
.equ	M33_NSACR_CP0_BITS, 0x00000001
.equ	M33_NSACR_CP0_MSB, 0
.equ	M33_NSACR_CP0_LSB, 0
# =============================================================================
# Register    : M33_MPU_TYPE
# Description : The MPU Type Register indicates how many regions the MPU `FTSSS
#               supports
.equ	M33_MPU_TYPE_OFFSET, 0x0000ed90
.equ	M33_MPU_TYPE_BITS, 0x0000ff01
.equ	M33_MPU_TYPE_RESET, 0x00000800
# -----------------------------------------------------------------------------
# Field       : M33_MPU_TYPE_DREGION
# Description : Number of regions supported by the MPU
.equ	M33_MPU_TYPE_DREGION_RESET, 0x08
.equ	M33_MPU_TYPE_DREGION_BITS, 0x0000ff00
.equ	M33_MPU_TYPE_DREGION_MSB, 15
.equ	M33_MPU_TYPE_DREGION_LSB, 8
# -----------------------------------------------------------------------------
# Field       : M33_MPU_TYPE_SEPARATE
# Description : Indicates support for separate instructions and data address
#               regions
.equ	M33_MPU_TYPE_SEPARATE_RESET, 0x0
.equ	M33_MPU_TYPE_SEPARATE_BITS, 0x00000001
.equ	M33_MPU_TYPE_SEPARATE_MSB, 0
.equ	M33_MPU_TYPE_SEPARATE_LSB, 0
# =============================================================================
# Register    : M33_MPU_CTRL
# Description : Enables the MPU and, when the MPU is enabled, controls whether
#               the default memory map is enabled as a background region for
#               privileged accesses, and whether the MPU is enabled for
#               HardFaults, NMIs, and exception handlers when FAULTMASK is set
#               to 1
.equ	M33_MPU_CTRL_OFFSET, 0x0000ed94
.equ	M33_MPU_CTRL_BITS, 0x00000007
.equ	M33_MPU_CTRL_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_MPU_CTRL_PRIVDEFENA
# Description : Controls whether the default memory map is enabled for
#               privileged software
.equ	M33_MPU_CTRL_PRIVDEFENA_RESET, 0x0
.equ	M33_MPU_CTRL_PRIVDEFENA_BITS, 0x00000004
.equ	M33_MPU_CTRL_PRIVDEFENA_MSB, 2
.equ	M33_MPU_CTRL_PRIVDEFENA_LSB, 2
# -----------------------------------------------------------------------------
# Field       : M33_MPU_CTRL_HFNMIENA
# Description : Controls whether handlers executing with priority less than 0
#               access memory with the MPU enabled or disabled. This applies to
#               HardFaults, NMIs, and exception handlers when FAULTMASK is set
#               to 1
.equ	M33_MPU_CTRL_HFNMIENA_RESET, 0x0
.equ	M33_MPU_CTRL_HFNMIENA_BITS, 0x00000002
.equ	M33_MPU_CTRL_HFNMIENA_MSB, 1
.equ	M33_MPU_CTRL_HFNMIENA_LSB, 1
# -----------------------------------------------------------------------------
# Field       : M33_MPU_CTRL_ENABLE
# Description : Enables the MPU
.equ	M33_MPU_CTRL_ENABLE_RESET, 0x0
.equ	M33_MPU_CTRL_ENABLE_BITS, 0x00000001
.equ	M33_MPU_CTRL_ENABLE_MSB, 0
.equ	M33_MPU_CTRL_ENABLE_LSB, 0
# =============================================================================
# Register    : M33_MPU_RNR
# Description : Selects the region currently accessed by MPU_RBAR and MPU_RLAR
.equ	M33_MPU_RNR_OFFSET, 0x0000ed98
.equ	M33_MPU_RNR_BITS, 0x00000007
.equ	M33_MPU_RNR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_MPU_RNR_REGION
# Description : Indicates the memory region accessed by MPU_RBAR and MPU_RLAR
.equ	M33_MPU_RNR_REGION_RESET, 0x0
.equ	M33_MPU_RNR_REGION_BITS, 0x00000007
.equ	M33_MPU_RNR_REGION_MSB, 2
.equ	M33_MPU_RNR_REGION_LSB, 0
# =============================================================================
# Register    : M33_MPU_RBAR
# Description : Provides indirect read and write access to the base address of
#               the currently selected MPU region `FTSSS
.equ	M33_MPU_RBAR_OFFSET, 0x0000ed9c
.equ	M33_MPU_RBAR_BITS, 0xffffffff
.equ	M33_MPU_RBAR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_MPU_RBAR_BASE
# Description : Contains bits [31:5] of the lower inclusive limit of the
#               selected MPU memory region. This value is zero extended to
#               provide the base address to be checked against
.equ	M33_MPU_RBAR_BASE_RESET, 0x0000000
.equ	M33_MPU_RBAR_BASE_BITS, 0xffffffe0
.equ	M33_MPU_RBAR_BASE_MSB, 31
.equ	M33_MPU_RBAR_BASE_LSB, 5
# -----------------------------------------------------------------------------
# Field       : M33_MPU_RBAR_SH
# Description : Defines the Shareability domain of this region for Normal
#               memory
.equ	M33_MPU_RBAR_SH_RESET, 0x0
.equ	M33_MPU_RBAR_SH_BITS, 0x00000018
.equ	M33_MPU_RBAR_SH_MSB, 4
.equ	M33_MPU_RBAR_SH_LSB, 3
# -----------------------------------------------------------------------------
# Field       : M33_MPU_RBAR_AP
# Description : Defines the access permissions for this region
.equ	M33_MPU_RBAR_AP_RESET, 0x0
.equ	M33_MPU_RBAR_AP_BITS, 0x00000006
.equ	M33_MPU_RBAR_AP_MSB, 2
.equ	M33_MPU_RBAR_AP_LSB, 1
# -----------------------------------------------------------------------------
# Field       : M33_MPU_RBAR_XN
# Description : Defines whether code can be executed from this region
.equ	M33_MPU_RBAR_XN_RESET, 0x0
.equ	M33_MPU_RBAR_XN_BITS, 0x00000001
.equ	M33_MPU_RBAR_XN_MSB, 0
.equ	M33_MPU_RBAR_XN_LSB, 0
# =============================================================================
# Register    : M33_MPU_RLAR
# Description : Provides indirect read and write access to the limit address of
#               the currently selected MPU region `FTSSS
.equ	M33_MPU_RLAR_OFFSET, 0x0000eda0
.equ	M33_MPU_RLAR_BITS, 0xffffffef
.equ	M33_MPU_RLAR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_MPU_RLAR_LIMIT
# Description : Contains bits [31:5] of the upper inclusive limit of the
#               selected MPU memory region. This value is postfixed with 0x1F
#               to provide the limit address to be checked against
.equ	M33_MPU_RLAR_LIMIT_RESET, 0x0000000
.equ	M33_MPU_RLAR_LIMIT_BITS, 0xffffffe0
.equ	M33_MPU_RLAR_LIMIT_MSB, 31
.equ	M33_MPU_RLAR_LIMIT_LSB, 5
# -----------------------------------------------------------------------------
# Field       : M33_MPU_RLAR_ATTRINDX
# Description : Associates a set of attributes in the MPU_MAIR0 and MPU_MAIR1
#               fields
.equ	M33_MPU_RLAR_ATTRINDX_RESET, 0x0
.equ	M33_MPU_RLAR_ATTRINDX_BITS, 0x0000000e
.equ	M33_MPU_RLAR_ATTRINDX_MSB, 3
.equ	M33_MPU_RLAR_ATTRINDX_LSB, 1
# -----------------------------------------------------------------------------
# Field       : M33_MPU_RLAR_EN
# Description : Region enable
.equ	M33_MPU_RLAR_EN_RESET, 0x0
.equ	M33_MPU_RLAR_EN_BITS, 0x00000001
.equ	M33_MPU_RLAR_EN_MSB, 0
.equ	M33_MPU_RLAR_EN_LSB, 0
# =============================================================================
# Register    : M33_MPU_RBAR_A1
# Description : Provides indirect read and write access to the base address of
#               the MPU region selected by MPU_RNR[7:2]:(1[1:0]) `FTSSS
.equ	M33_MPU_RBAR_A1_OFFSET, 0x0000eda4
.equ	M33_MPU_RBAR_A1_BITS, 0xffffffff
.equ	M33_MPU_RBAR_A1_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_MPU_RBAR_A1_BASE
# Description : Contains bits [31:5] of the lower inclusive limit of the
#               selected MPU memory region. This value is zero extended to
#               provide the base address to be checked against
.equ	M33_MPU_RBAR_A1_BASE_RESET, 0x0000000
.equ	M33_MPU_RBAR_A1_BASE_BITS, 0xffffffe0
.equ	M33_MPU_RBAR_A1_BASE_MSB, 31
.equ	M33_MPU_RBAR_A1_BASE_LSB, 5
# -----------------------------------------------------------------------------
# Field       : M33_MPU_RBAR_A1_SH
# Description : Defines the Shareability domain of this region for Normal
#               memory
.equ	M33_MPU_RBAR_A1_SH_RESET, 0x0
.equ	M33_MPU_RBAR_A1_SH_BITS, 0x00000018
.equ	M33_MPU_RBAR_A1_SH_MSB, 4
.equ	M33_MPU_RBAR_A1_SH_LSB, 3
# -----------------------------------------------------------------------------
# Field       : M33_MPU_RBAR_A1_AP
# Description : Defines the access permissions for this region
.equ	M33_MPU_RBAR_A1_AP_RESET, 0x0
.equ	M33_MPU_RBAR_A1_AP_BITS, 0x00000006
.equ	M33_MPU_RBAR_A1_AP_MSB, 2
.equ	M33_MPU_RBAR_A1_AP_LSB, 1
# -----------------------------------------------------------------------------
# Field       : M33_MPU_RBAR_A1_XN
# Description : Defines whether code can be executed from this region
.equ	M33_MPU_RBAR_A1_XN_RESET, 0x0
.equ	M33_MPU_RBAR_A1_XN_BITS, 0x00000001
.equ	M33_MPU_RBAR_A1_XN_MSB, 0
.equ	M33_MPU_RBAR_A1_XN_LSB, 0
# =============================================================================
# Register    : M33_MPU_RLAR_A1
# Description : Provides indirect read and write access to the limit address of
#               the currently selected MPU region selected by
#               MPU_RNR[7:2]:(1[1:0]) `FTSSS
.equ	M33_MPU_RLAR_A1_OFFSET, 0x0000eda8
.equ	M33_MPU_RLAR_A1_BITS, 0xffffffef
.equ	M33_MPU_RLAR_A1_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_MPU_RLAR_A1_LIMIT
# Description : Contains bits [31:5] of the upper inclusive limit of the
#               selected MPU memory region. This value is postfixed with 0x1F
#               to provide the limit address to be checked against
.equ	M33_MPU_RLAR_A1_LIMIT_RESET, 0x0000000
.equ	M33_MPU_RLAR_A1_LIMIT_BITS, 0xffffffe0
.equ	M33_MPU_RLAR_A1_LIMIT_MSB, 31
.equ	M33_MPU_RLAR_A1_LIMIT_LSB, 5
# -----------------------------------------------------------------------------
# Field       : M33_MPU_RLAR_A1_ATTRINDX
# Description : Associates a set of attributes in the MPU_MAIR0 and MPU_MAIR1
#               fields
.equ	M33_MPU_RLAR_A1_ATTRINDX_RESET, 0x0
.equ	M33_MPU_RLAR_A1_ATTRINDX_BITS, 0x0000000e
.equ	M33_MPU_RLAR_A1_ATTRINDX_MSB, 3
.equ	M33_MPU_RLAR_A1_ATTRINDX_LSB, 1
# -----------------------------------------------------------------------------
# Field       : M33_MPU_RLAR_A1_EN
# Description : Region enable
.equ	M33_MPU_RLAR_A1_EN_RESET, 0x0
.equ	M33_MPU_RLAR_A1_EN_BITS, 0x00000001
.equ	M33_MPU_RLAR_A1_EN_MSB, 0
.equ	M33_MPU_RLAR_A1_EN_LSB, 0
# =============================================================================
# Register    : M33_MPU_RBAR_A2
# Description : Provides indirect read and write access to the base address of
#               the MPU region selected by MPU_RNR[7:2]:(2[1:0]) `FTSSS
.equ	M33_MPU_RBAR_A2_OFFSET, 0x0000edac
.equ	M33_MPU_RBAR_A2_BITS, 0xffffffff
.equ	M33_MPU_RBAR_A2_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_MPU_RBAR_A2_BASE
# Description : Contains bits [31:5] of the lower inclusive limit of the
#               selected MPU memory region. This value is zero extended to
#               provide the base address to be checked against
.equ	M33_MPU_RBAR_A2_BASE_RESET, 0x0000000
.equ	M33_MPU_RBAR_A2_BASE_BITS, 0xffffffe0
.equ	M33_MPU_RBAR_A2_BASE_MSB, 31
.equ	M33_MPU_RBAR_A2_BASE_LSB, 5
# -----------------------------------------------------------------------------
# Field       : M33_MPU_RBAR_A2_SH
# Description : Defines the Shareability domain of this region for Normal
#               memory
.equ	M33_MPU_RBAR_A2_SH_RESET, 0x0
.equ	M33_MPU_RBAR_A2_SH_BITS, 0x00000018
.equ	M33_MPU_RBAR_A2_SH_MSB, 4
.equ	M33_MPU_RBAR_A2_SH_LSB, 3
# -----------------------------------------------------------------------------
# Field       : M33_MPU_RBAR_A2_AP
# Description : Defines the access permissions for this region
.equ	M33_MPU_RBAR_A2_AP_RESET, 0x0
.equ	M33_MPU_RBAR_A2_AP_BITS, 0x00000006
.equ	M33_MPU_RBAR_A2_AP_MSB, 2
.equ	M33_MPU_RBAR_A2_AP_LSB, 1
# -----------------------------------------------------------------------------
# Field       : M33_MPU_RBAR_A2_XN
# Description : Defines whether code can be executed from this region
.equ	M33_MPU_RBAR_A2_XN_RESET, 0x0
.equ	M33_MPU_RBAR_A2_XN_BITS, 0x00000001
.equ	M33_MPU_RBAR_A2_XN_MSB, 0
.equ	M33_MPU_RBAR_A2_XN_LSB, 0
# =============================================================================
# Register    : M33_MPU_RLAR_A2
# Description : Provides indirect read and write access to the limit address of
#               the currently selected MPU region selected by
#               MPU_RNR[7:2]:(2[1:0]) `FTSSS
.equ	M33_MPU_RLAR_A2_OFFSET, 0x0000edb0
.equ	M33_MPU_RLAR_A2_BITS, 0xffffffef
.equ	M33_MPU_RLAR_A2_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_MPU_RLAR_A2_LIMIT
# Description : Contains bits [31:5] of the upper inclusive limit of the
#               selected MPU memory region. This value is postfixed with 0x1F
#               to provide the limit address to be checked against
.equ	M33_MPU_RLAR_A2_LIMIT_RESET, 0x0000000
.equ	M33_MPU_RLAR_A2_LIMIT_BITS, 0xffffffe0
.equ	M33_MPU_RLAR_A2_LIMIT_MSB, 31
.equ	M33_MPU_RLAR_A2_LIMIT_LSB, 5
# -----------------------------------------------------------------------------
# Field       : M33_MPU_RLAR_A2_ATTRINDX
# Description : Associates a set of attributes in the MPU_MAIR0 and MPU_MAIR1
#               fields
.equ	M33_MPU_RLAR_A2_ATTRINDX_RESET, 0x0
.equ	M33_MPU_RLAR_A2_ATTRINDX_BITS, 0x0000000e
.equ	M33_MPU_RLAR_A2_ATTRINDX_MSB, 3
.equ	M33_MPU_RLAR_A2_ATTRINDX_LSB, 1
# -----------------------------------------------------------------------------
# Field       : M33_MPU_RLAR_A2_EN
# Description : Region enable
.equ	M33_MPU_RLAR_A2_EN_RESET, 0x0
.equ	M33_MPU_RLAR_A2_EN_BITS, 0x00000001
.equ	M33_MPU_RLAR_A2_EN_MSB, 0
.equ	M33_MPU_RLAR_A2_EN_LSB, 0
# =============================================================================
# Register    : M33_MPU_RBAR_A3
# Description : Provides indirect read and write access to the base address of
#               the MPU region selected by MPU_RNR[7:2]:(3[1:0]) `FTSSS
.equ	M33_MPU_RBAR_A3_OFFSET, 0x0000edb4
.equ	M33_MPU_RBAR_A3_BITS, 0xffffffff
.equ	M33_MPU_RBAR_A3_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_MPU_RBAR_A3_BASE
# Description : Contains bits [31:5] of the lower inclusive limit of the
#               selected MPU memory region. This value is zero extended to
#               provide the base address to be checked against
.equ	M33_MPU_RBAR_A3_BASE_RESET, 0x0000000
.equ	M33_MPU_RBAR_A3_BASE_BITS, 0xffffffe0
.equ	M33_MPU_RBAR_A3_BASE_MSB, 31
.equ	M33_MPU_RBAR_A3_BASE_LSB, 5
# -----------------------------------------------------------------------------
# Field       : M33_MPU_RBAR_A3_SH
# Description : Defines the Shareability domain of this region for Normal
#               memory
.equ	M33_MPU_RBAR_A3_SH_RESET, 0x0
.equ	M33_MPU_RBAR_A3_SH_BITS, 0x00000018
.equ	M33_MPU_RBAR_A3_SH_MSB, 4
.equ	M33_MPU_RBAR_A3_SH_LSB, 3
# -----------------------------------------------------------------------------
# Field       : M33_MPU_RBAR_A3_AP
# Description : Defines the access permissions for this region
.equ	M33_MPU_RBAR_A3_AP_RESET, 0x0
.equ	M33_MPU_RBAR_A3_AP_BITS, 0x00000006
.equ	M33_MPU_RBAR_A3_AP_MSB, 2
.equ	M33_MPU_RBAR_A3_AP_LSB, 1
# -----------------------------------------------------------------------------
# Field       : M33_MPU_RBAR_A3_XN
# Description : Defines whether code can be executed from this region
.equ	M33_MPU_RBAR_A3_XN_RESET, 0x0
.equ	M33_MPU_RBAR_A3_XN_BITS, 0x00000001
.equ	M33_MPU_RBAR_A3_XN_MSB, 0
.equ	M33_MPU_RBAR_A3_XN_LSB, 0
# =============================================================================
# Register    : M33_MPU_RLAR_A3
# Description : Provides indirect read and write access to the limit address of
#               the currently selected MPU region selected by
#               MPU_RNR[7:2]:(3[1:0]) `FTSSS
.equ	M33_MPU_RLAR_A3_OFFSET, 0x0000edb8
.equ	M33_MPU_RLAR_A3_BITS, 0xffffffef
.equ	M33_MPU_RLAR_A3_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_MPU_RLAR_A3_LIMIT
# Description : Contains bits [31:5] of the upper inclusive limit of the
#               selected MPU memory region. This value is postfixed with 0x1F
#               to provide the limit address to be checked against
.equ	M33_MPU_RLAR_A3_LIMIT_RESET, 0x0000000
.equ	M33_MPU_RLAR_A3_LIMIT_BITS, 0xffffffe0
.equ	M33_MPU_RLAR_A3_LIMIT_MSB, 31
.equ	M33_MPU_RLAR_A3_LIMIT_LSB, 5
# -----------------------------------------------------------------------------
# Field       : M33_MPU_RLAR_A3_ATTRINDX
# Description : Associates a set of attributes in the MPU_MAIR0 and MPU_MAIR1
#               fields
.equ	M33_MPU_RLAR_A3_ATTRINDX_RESET, 0x0
.equ	M33_MPU_RLAR_A3_ATTRINDX_BITS, 0x0000000e
.equ	M33_MPU_RLAR_A3_ATTRINDX_MSB, 3
.equ	M33_MPU_RLAR_A3_ATTRINDX_LSB, 1
# -----------------------------------------------------------------------------
# Field       : M33_MPU_RLAR_A3_EN
# Description : Region enable
.equ	M33_MPU_RLAR_A3_EN_RESET, 0x0
.equ	M33_MPU_RLAR_A3_EN_BITS, 0x00000001
.equ	M33_MPU_RLAR_A3_EN_MSB, 0
.equ	M33_MPU_RLAR_A3_EN_LSB, 0
# =============================================================================
# Register    : M33_MPU_MAIR0
# Description : Along with MPU_MAIR1, provides the memory attribute encodings
#               corresponding to the AttrIndex values
.equ	M33_MPU_MAIR0_OFFSET, 0x0000edc0
.equ	M33_MPU_MAIR0_BITS, 0xffffffff
.equ	M33_MPU_MAIR0_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_MPU_MAIR0_ATTR3
# Description : Memory attribute encoding for MPU regions with an AttrIndex of
#               3
.equ	M33_MPU_MAIR0_ATTR3_RESET, 0x00
.equ	M33_MPU_MAIR0_ATTR3_BITS, 0xff000000
.equ	M33_MPU_MAIR0_ATTR3_MSB, 31
.equ	M33_MPU_MAIR0_ATTR3_LSB, 24
# -----------------------------------------------------------------------------
# Field       : M33_MPU_MAIR0_ATTR2
# Description : Memory attribute encoding for MPU regions with an AttrIndex of
#               2
.equ	M33_MPU_MAIR0_ATTR2_RESET, 0x00
.equ	M33_MPU_MAIR0_ATTR2_BITS, 0x00ff0000
.equ	M33_MPU_MAIR0_ATTR2_MSB, 23
.equ	M33_MPU_MAIR0_ATTR2_LSB, 16
# -----------------------------------------------------------------------------
# Field       : M33_MPU_MAIR0_ATTR1
# Description : Memory attribute encoding for MPU regions with an AttrIndex of
#               1
.equ	M33_MPU_MAIR0_ATTR1_RESET, 0x00
.equ	M33_MPU_MAIR0_ATTR1_BITS, 0x0000ff00
.equ	M33_MPU_MAIR0_ATTR1_MSB, 15
.equ	M33_MPU_MAIR0_ATTR1_LSB, 8
# -----------------------------------------------------------------------------
# Field       : M33_MPU_MAIR0_ATTR0
# Description : Memory attribute encoding for MPU regions with an AttrIndex of
#               0
.equ	M33_MPU_MAIR0_ATTR0_RESET, 0x00
.equ	M33_MPU_MAIR0_ATTR0_BITS, 0x000000ff
.equ	M33_MPU_MAIR0_ATTR0_MSB, 7
.equ	M33_MPU_MAIR0_ATTR0_LSB, 0
# =============================================================================
# Register    : M33_MPU_MAIR1
# Description : Along with MPU_MAIR0, provides the memory attribute encodings
#               corresponding to the AttrIndex values
.equ	M33_MPU_MAIR1_OFFSET, 0x0000edc4
.equ	M33_MPU_MAIR1_BITS, 0xffffffff
.equ	M33_MPU_MAIR1_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_MPU_MAIR1_ATTR7
# Description : Memory attribute encoding for MPU regions with an AttrIndex of
#               7
.equ	M33_MPU_MAIR1_ATTR7_RESET, 0x00
.equ	M33_MPU_MAIR1_ATTR7_BITS, 0xff000000
.equ	M33_MPU_MAIR1_ATTR7_MSB, 31
.equ	M33_MPU_MAIR1_ATTR7_LSB, 24
# -----------------------------------------------------------------------------
# Field       : M33_MPU_MAIR1_ATTR6
# Description : Memory attribute encoding for MPU regions with an AttrIndex of
#               6
.equ	M33_MPU_MAIR1_ATTR6_RESET, 0x00
.equ	M33_MPU_MAIR1_ATTR6_BITS, 0x00ff0000
.equ	M33_MPU_MAIR1_ATTR6_MSB, 23
.equ	M33_MPU_MAIR1_ATTR6_LSB, 16
# -----------------------------------------------------------------------------
# Field       : M33_MPU_MAIR1_ATTR5
# Description : Memory attribute encoding for MPU regions with an AttrIndex of
#               5
.equ	M33_MPU_MAIR1_ATTR5_RESET, 0x00
.equ	M33_MPU_MAIR1_ATTR5_BITS, 0x0000ff00
.equ	M33_MPU_MAIR1_ATTR5_MSB, 15
.equ	M33_MPU_MAIR1_ATTR5_LSB, 8
# -----------------------------------------------------------------------------
# Field       : M33_MPU_MAIR1_ATTR4
