konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/m33.inc
# Description : Memory attribute encoding for MPU regions with an AttrIndex of
#               4
.equ	M33_MPU_MAIR1_ATTR4_RESET, 0x00
.equ	M33_MPU_MAIR1_ATTR4_BITS, 0x000000ff
.equ	M33_MPU_MAIR1_ATTR4_MSB, 7
.equ	M33_MPU_MAIR1_ATTR4_LSB, 0
# =============================================================================
# Register    : M33_SAU_CTRL
# Description : Allows enabling of the Security Attribution Unit
.equ	M33_SAU_CTRL_OFFSET, 0x0000edd0
.equ	M33_SAU_CTRL_BITS, 0x00000003
.equ	M33_SAU_CTRL_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_SAU_CTRL_ALLNS
# Description : When SAU_CTRL.ENABLE is 0 this bit controls if the memory is
#               marked as Non-secure or Secure
.equ	M33_SAU_CTRL_ALLNS_RESET, 0x0
.equ	M33_SAU_CTRL_ALLNS_BITS, 0x00000002
.equ	M33_SAU_CTRL_ALLNS_MSB, 1
.equ	M33_SAU_CTRL_ALLNS_LSB, 1
# -----------------------------------------------------------------------------
# Field       : M33_SAU_CTRL_ENABLE
# Description : Enables the SAU
.equ	M33_SAU_CTRL_ENABLE_RESET, 0x0
.equ	M33_SAU_CTRL_ENABLE_BITS, 0x00000001
.equ	M33_SAU_CTRL_ENABLE_MSB, 0
.equ	M33_SAU_CTRL_ENABLE_LSB, 0
# =============================================================================
# Register    : M33_SAU_TYPE
# Description : Indicates the number of regions implemented by the Security
#               Attribution Unit
.equ	M33_SAU_TYPE_OFFSET, 0x0000edd4
.equ	M33_SAU_TYPE_BITS, 0x000000ff
.equ	M33_SAU_TYPE_RESET, 0x00000008
# -----------------------------------------------------------------------------
# Field       : M33_SAU_TYPE_SREGION
# Description : The number of implemented SAU regions
.equ	M33_SAU_TYPE_SREGION_RESET, 0x08
.equ	M33_SAU_TYPE_SREGION_BITS, 0x000000ff
.equ	M33_SAU_TYPE_SREGION_MSB, 7
.equ	M33_SAU_TYPE_SREGION_LSB, 0
# =============================================================================
# Register    : M33_SAU_RNR
# Description : Selects the region currently accessed by SAU_RBAR and SAU_RLAR
.equ	M33_SAU_RNR_OFFSET, 0x0000edd8
.equ	M33_SAU_RNR_BITS, 0x000000ff
.equ	M33_SAU_RNR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_SAU_RNR_REGION
# Description : Indicates the SAU region accessed by SAU_RBAR and SAU_RLAR
.equ	M33_SAU_RNR_REGION_RESET, 0x00
.equ	M33_SAU_RNR_REGION_BITS, 0x000000ff
.equ	M33_SAU_RNR_REGION_MSB, 7
.equ	M33_SAU_RNR_REGION_LSB, 0
# =============================================================================
# Register    : M33_SAU_RBAR
# Description : Provides indirect read and write access to the base address of
#               the currently selected SAU region
.equ	M33_SAU_RBAR_OFFSET, 0x0000eddc
.equ	M33_SAU_RBAR_BITS, 0xffffffe0
.equ	M33_SAU_RBAR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_SAU_RBAR_BADDR
# Description : Holds bits [31:5] of the base address for the selected SAU
#               region
.equ	M33_SAU_RBAR_BADDR_RESET, 0x0000000
.equ	M33_SAU_RBAR_BADDR_BITS, 0xffffffe0
.equ	M33_SAU_RBAR_BADDR_MSB, 31
.equ	M33_SAU_RBAR_BADDR_LSB, 5
# =============================================================================
# Register    : M33_SAU_RLAR
# Description : Provides indirect read and write access to the limit address of
#               the currently selected SAU region
.equ	M33_SAU_RLAR_OFFSET, 0x0000ede0
.equ	M33_SAU_RLAR_BITS, 0xffffffe3
.equ	M33_SAU_RLAR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_SAU_RLAR_LADDR
# Description : Holds bits [31:5] of the limit address for the selected SAU
#               region
.equ	M33_SAU_RLAR_LADDR_RESET, 0x0000000
.equ	M33_SAU_RLAR_LADDR_BITS, 0xffffffe0
.equ	M33_SAU_RLAR_LADDR_MSB, 31
.equ	M33_SAU_RLAR_LADDR_LSB, 5
# -----------------------------------------------------------------------------
# Field       : M33_SAU_RLAR_NSC
# Description : Controls whether Non-secure state is permitted to execute an SG
#               instruction from this region
.equ	M33_SAU_RLAR_NSC_RESET, 0x0
.equ	M33_SAU_RLAR_NSC_BITS, 0x00000002
.equ	M33_SAU_RLAR_NSC_MSB, 1
.equ	M33_SAU_RLAR_NSC_LSB, 1
# -----------------------------------------------------------------------------
# Field       : M33_SAU_RLAR_ENABLE
# Description : SAU region enable
.equ	M33_SAU_RLAR_ENABLE_RESET, 0x0
.equ	M33_SAU_RLAR_ENABLE_BITS, 0x00000001
.equ	M33_SAU_RLAR_ENABLE_MSB, 0
.equ	M33_SAU_RLAR_ENABLE_LSB, 0
# =============================================================================
# Register    : M33_SFSR
# Description : Provides information about any security related faults
.equ	M33_SFSR_OFFSET, 0x0000ede4
.equ	M33_SFSR_BITS, 0x000000ff
.equ	M33_SFSR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_SFSR_LSERR
# Description : Sticky flag indicating that an error occurred during lazy state
#               activation or deactivation
.equ	M33_SFSR_LSERR_RESET, 0x0
.equ	M33_SFSR_LSERR_BITS, 0x00000080
.equ	M33_SFSR_LSERR_MSB, 7
.equ	M33_SFSR_LSERR_LSB, 7
# -----------------------------------------------------------------------------
# Field       : M33_SFSR_SFARVALID
# Description : This bit is set when the SFAR register contains a valid value.
#               As with similar fields, such as BFSR.BFARVALID and
#               MMFSR.MMARVALID, this bit can be cleared by other exceptions,
#               such as BusFault
.equ	M33_SFSR_SFARVALID_RESET, 0x0
.equ	M33_SFSR_SFARVALID_BITS, 0x00000040
.equ	M33_SFSR_SFARVALID_MSB, 6
.equ	M33_SFSR_SFARVALID_LSB, 6
# -----------------------------------------------------------------------------
# Field       : M33_SFSR_LSPERR
# Description : Stick flag indicating that an SAU or IDAU violation occurred
#               during the lazy preservation of floating-point state
.equ	M33_SFSR_LSPERR_RESET, 0x0
.equ	M33_SFSR_LSPERR_BITS, 0x00000020
.equ	M33_SFSR_LSPERR_MSB, 5
.equ	M33_SFSR_LSPERR_LSB, 5
# -----------------------------------------------------------------------------
# Field       : M33_SFSR_INVTRAN
# Description : Sticky flag indicating that an exception was raised due to a
#               branch that was not flagged as being domain crossing causing a
#               transition from Secure to Non-secure memory
.equ	M33_SFSR_INVTRAN_RESET, 0x0
.equ	M33_SFSR_INVTRAN_BITS, 0x00000010
.equ	M33_SFSR_INVTRAN_MSB, 4
.equ	M33_SFSR_INVTRAN_LSB, 4
# -----------------------------------------------------------------------------
# Field       : M33_SFSR_AUVIOL
# Description : Sticky flag indicating that an attempt was made to access parts
#               of the address space that are marked as Secure with NS-Req for
#               the transaction set to Non-secure. This bit is not set if the
#               violation occurred during lazy state preservation. See LSPERR
.equ	M33_SFSR_AUVIOL_RESET, 0x0
.equ	M33_SFSR_AUVIOL_BITS, 0x00000008
.equ	M33_SFSR_AUVIOL_MSB, 3
.equ	M33_SFSR_AUVIOL_LSB, 3
# -----------------------------------------------------------------------------
# Field       : M33_SFSR_INVER
# Description : This can be caused by EXC_RETURN.DCRS being set to 0 when
#               returning from an exception in the Non-secure state, or by
#               EXC_RETURN.ES being set to 1 when returning from an exception
#               in the Non-secure state
.equ	M33_SFSR_INVER_RESET, 0x0
.equ	M33_SFSR_INVER_BITS, 0x00000004
.equ	M33_SFSR_INVER_MSB, 2
.equ	M33_SFSR_INVER_LSB, 2
# -----------------------------------------------------------------------------
# Field       : M33_SFSR_INVIS
# Description : This bit is set if the integrity signature in an exception
#               stack frame is found to be invalid during the unstacking
#               operation
.equ	M33_SFSR_INVIS_RESET, 0x0
.equ	M33_SFSR_INVIS_BITS, 0x00000002
.equ	M33_SFSR_INVIS_MSB, 1
.equ	M33_SFSR_INVIS_LSB, 1
# -----------------------------------------------------------------------------
# Field       : M33_SFSR_INVEP
# Description : This bit is set if a function call from the Non-secure state or
#               exception targets a non-SG instruction in the Secure state.
#               This bit is also set if the target address is a SG instruction,
#               but there is no matching SAU/IDAU region with the NSC flag set
.equ	M33_SFSR_INVEP_RESET, 0x0
.equ	M33_SFSR_INVEP_BITS, 0x00000001
.equ	M33_SFSR_INVEP_MSB, 0
.equ	M33_SFSR_INVEP_LSB, 0
# =============================================================================
# Register    : M33_SFAR
# Description : Shows the address of the memory location that caused a Security
#               violation
.equ	M33_SFAR_OFFSET, 0x0000ede8
.equ	M33_SFAR_BITS, 0xffffffff
.equ	M33_SFAR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_SFAR_ADDRESS
# Description : The address of an access that caused a attribution unit
#               violation. This field is only valid when SFSR.SFARVALID is set.
#               This allows the actual flip flops associated with this register
#               to be shared with other fault address registers. If an
#               implementation chooses to share the storage in this way, care
#               must be taken to not leak Secure address information to the
#               Non-secure state. One way of achieving this is to share the
#               SFAR register with the MMFAR_S register, which is not
#               accessible to the Non-secure state
.equ	M33_SFAR_ADDRESS_RESET, 0x00000000
.equ	M33_SFAR_ADDRESS_BITS, 0xffffffff
.equ	M33_SFAR_ADDRESS_MSB, 31
.equ	M33_SFAR_ADDRESS_LSB, 0
# =============================================================================
# Register    : M33_DHCSR
# Description : Controls halting debug
.equ	M33_DHCSR_OFFSET, 0x0000edf0
.equ	M33_DHCSR_BITS, 0x071f002f
.equ	M33_DHCSR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_DHCSR_S_RESTART_ST
# Description : Indicates the PE has processed a request to clear DHCSR.C_HALT
#               to 0. That is, either a write to DHCSR that clears DHCSR.C_HALT
#               from 1 to 0, or an External Restart Request
.equ	M33_DHCSR_S_RESTART_ST_RESET, 0x0
.equ	M33_DHCSR_S_RESTART_ST_BITS, 0x04000000
.equ	M33_DHCSR_S_RESTART_ST_MSB, 26
.equ	M33_DHCSR_S_RESTART_ST_LSB, 26
# -----------------------------------------------------------------------------
# Field       : M33_DHCSR_S_RESET_ST
# Description : Indicates whether the PE has been reset since the last read of
#               the DHCSR
.equ	M33_DHCSR_S_RESET_ST_RESET, 0x0
.equ	M33_DHCSR_S_RESET_ST_BITS, 0x02000000
.equ	M33_DHCSR_S_RESET_ST_MSB, 25
.equ	M33_DHCSR_S_RESET_ST_LSB, 25
# -----------------------------------------------------------------------------
# Field       : M33_DHCSR_S_RETIRE_ST
# Description : Set to 1 every time the PE retires one of more instructions
.equ	M33_DHCSR_S_RETIRE_ST_RESET, 0x0
.equ	M33_DHCSR_S_RETIRE_ST_BITS, 0x01000000
.equ	M33_DHCSR_S_RETIRE_ST_MSB, 24
.equ	M33_DHCSR_S_RETIRE_ST_LSB, 24
# -----------------------------------------------------------------------------
# Field       : M33_DHCSR_S_SDE
# Description : Indicates whether Secure invasive debug is allowed
.equ	M33_DHCSR_S_SDE_RESET, 0x0
.equ	M33_DHCSR_S_SDE_BITS, 0x00100000
.equ	M33_DHCSR_S_SDE_MSB, 20
.equ	M33_DHCSR_S_SDE_LSB, 20
# -----------------------------------------------------------------------------
# Field       : M33_DHCSR_S_LOCKUP
# Description : Indicates whether the PE is in Lockup state
.equ	M33_DHCSR_S_LOCKUP_RESET, 0x0
.equ	M33_DHCSR_S_LOCKUP_BITS, 0x00080000
.equ	M33_DHCSR_S_LOCKUP_MSB, 19
.equ	M33_DHCSR_S_LOCKUP_LSB, 19
# -----------------------------------------------------------------------------
# Field       : M33_DHCSR_S_SLEEP
# Description : Indicates whether the PE is sleeping
.equ	M33_DHCSR_S_SLEEP_RESET, 0x0
.equ	M33_DHCSR_S_SLEEP_BITS, 0x00040000
.equ	M33_DHCSR_S_SLEEP_MSB, 18
.equ	M33_DHCSR_S_SLEEP_LSB, 18
# -----------------------------------------------------------------------------
# Field       : M33_DHCSR_S_HALT
# Description : Indicates whether the PE is in Debug state
.equ	M33_DHCSR_S_HALT_RESET, 0x0
.equ	M33_DHCSR_S_HALT_BITS, 0x00020000
.equ	M33_DHCSR_S_HALT_MSB, 17
.equ	M33_DHCSR_S_HALT_LSB, 17
# -----------------------------------------------------------------------------
# Field       : M33_DHCSR_S_REGRDY
# Description : Handshake flag to transfers through the DCRDR
.equ	M33_DHCSR_S_REGRDY_RESET, 0x0
.equ	M33_DHCSR_S_REGRDY_BITS, 0x00010000
.equ	M33_DHCSR_S_REGRDY_MSB, 16
.equ	M33_DHCSR_S_REGRDY_LSB, 16
# -----------------------------------------------------------------------------
# Field       : M33_DHCSR_C_SNAPSTALL
# Description : Allow imprecise entry to Debug state
.equ	M33_DHCSR_C_SNAPSTALL_RESET, 0x0
.equ	M33_DHCSR_C_SNAPSTALL_BITS, 0x00000020
.equ	M33_DHCSR_C_SNAPSTALL_MSB, 5
.equ	M33_DHCSR_C_SNAPSTALL_LSB, 5
# -----------------------------------------------------------------------------
# Field       : M33_DHCSR_C_MASKINTS
# Description : When debug is enabled, the debugger can write to this bit to
#               mask PendSV, SysTick and external configurable interrupts
.equ	M33_DHCSR_C_MASKINTS_RESET, 0x0
.equ	M33_DHCSR_C_MASKINTS_BITS, 0x00000008
.equ	M33_DHCSR_C_MASKINTS_MSB, 3
.equ	M33_DHCSR_C_MASKINTS_LSB, 3
# -----------------------------------------------------------------------------
# Field       : M33_DHCSR_C_STEP
# Description : Enable single instruction step
.equ	M33_DHCSR_C_STEP_RESET, 0x0
.equ	M33_DHCSR_C_STEP_BITS, 0x00000004
.equ	M33_DHCSR_C_STEP_MSB, 2
.equ	M33_DHCSR_C_STEP_LSB, 2
# -----------------------------------------------------------------------------
# Field       : M33_DHCSR_C_HALT
# Description : PE enter Debug state halt request
.equ	M33_DHCSR_C_HALT_RESET, 0x0
.equ	M33_DHCSR_C_HALT_BITS, 0x00000002
.equ	M33_DHCSR_C_HALT_MSB, 1
.equ	M33_DHCSR_C_HALT_LSB, 1
# -----------------------------------------------------------------------------
# Field       : M33_DHCSR_C_DEBUGEN
# Description : Enable Halting debug
.equ	M33_DHCSR_C_DEBUGEN_RESET, 0x0
.equ	M33_DHCSR_C_DEBUGEN_BITS, 0x00000001
.equ	M33_DHCSR_C_DEBUGEN_MSB, 0
.equ	M33_DHCSR_C_DEBUGEN_LSB, 0
# =============================================================================
# Register    : M33_DCRSR
# Description : With the DCRDR, provides debug access to the general-purpose
#               registers, special-purpose registers, and the FP extension
#               registers. A write to the DCRSR specifies the register to
#               transfer, whether the transfer is a read or write, and starts
#               the transfer
.equ	M33_DCRSR_OFFSET, 0x0000edf4
.equ	M33_DCRSR_BITS, 0x0001007f
.equ	M33_DCRSR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_DCRSR_REGWNR
# Description : Specifies the access type for the transfer
.equ	M33_DCRSR_REGWNR_RESET, 0x0
.equ	M33_DCRSR_REGWNR_BITS, 0x00010000
.equ	M33_DCRSR_REGWNR_MSB, 16
.equ	M33_DCRSR_REGWNR_LSB, 16
# -----------------------------------------------------------------------------
# Field       : M33_DCRSR_REGSEL
# Description : Specifies the general-purpose register, special-purpose
#               register, or FP register to transfer
.equ	M33_DCRSR_REGSEL_RESET, 0x00
.equ	M33_DCRSR_REGSEL_BITS, 0x0000007f
.equ	M33_DCRSR_REGSEL_MSB, 6
.equ	M33_DCRSR_REGSEL_LSB, 0
# =============================================================================
# Register    : M33_DCRDR
# Description : With the DCRSR, provides debug access to the general-purpose
#               registers, special-purpose registers, and the FP Extension
#               registers. If the Main Extension is implemented, it can also be
#               used for message passing between an external debugger and a
#               debug agent running on the PE
.equ	M33_DCRDR_OFFSET, 0x0000edf8
.equ	M33_DCRDR_BITS, 0xffffffff
.equ	M33_DCRDR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_DCRDR_DBGTMP
# Description : Provides debug access for reading and writing the general-
#               purpose registers, special-purpose registers, and Floating-
#               point Extension registers
.equ	M33_DCRDR_DBGTMP_RESET, 0x00000000
.equ	M33_DCRDR_DBGTMP_BITS, 0xffffffff
.equ	M33_DCRDR_DBGTMP_MSB, 31
.equ	M33_DCRDR_DBGTMP_LSB, 0
# =============================================================================
# Register    : M33_DEMCR
# Description : Manages vector catch behavior and DebugMonitor handling when
#               debugging
.equ	M33_DEMCR_OFFSET, 0x0000edfc
.equ	M33_DEMCR_BITS, 0x011f0ff1
.equ	M33_DEMCR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_DEMCR_TRCENA
# Description : Global enable for all DWT and ITM features
.equ	M33_DEMCR_TRCENA_RESET, 0x0
.equ	M33_DEMCR_TRCENA_BITS, 0x01000000
.equ	M33_DEMCR_TRCENA_MSB, 24
.equ	M33_DEMCR_TRCENA_LSB, 24
# -----------------------------------------------------------------------------
# Field       : M33_DEMCR_SDME
# Description : Indicates whether the DebugMonitor targets the Secure or the
#               Non-secure state and whether debug events are allowed in Secure
#               state
.equ	M33_DEMCR_SDME_RESET, 0x0
.equ	M33_DEMCR_SDME_BITS, 0x00100000
.equ	M33_DEMCR_SDME_MSB, 20
.equ	M33_DEMCR_SDME_LSB, 20
# -----------------------------------------------------------------------------
# Field       : M33_DEMCR_MON_REQ
# Description : DebugMonitor semaphore bit
.equ	M33_DEMCR_MON_REQ_RESET, 0x0
.equ	M33_DEMCR_MON_REQ_BITS, 0x00080000
.equ	M33_DEMCR_MON_REQ_MSB, 19
.equ	M33_DEMCR_MON_REQ_LSB, 19
# -----------------------------------------------------------------------------
# Field       : M33_DEMCR_MON_STEP
# Description : Enable DebugMonitor stepping
.equ	M33_DEMCR_MON_STEP_RESET, 0x0
.equ	M33_DEMCR_MON_STEP_BITS, 0x00040000
.equ	M33_DEMCR_MON_STEP_MSB, 18
.equ	M33_DEMCR_MON_STEP_LSB, 18
# -----------------------------------------------------------------------------
# Field       : M33_DEMCR_MON_PEND
# Description : Sets or clears the pending state of the DebugMonitor exception
.equ	M33_DEMCR_MON_PEND_RESET, 0x0
.equ	M33_DEMCR_MON_PEND_BITS, 0x00020000
.equ	M33_DEMCR_MON_PEND_MSB, 17
.equ	M33_DEMCR_MON_PEND_LSB, 17
# -----------------------------------------------------------------------------
# Field       : M33_DEMCR_MON_EN
# Description : Enable the DebugMonitor exception
.equ	M33_DEMCR_MON_EN_RESET, 0x0
.equ	M33_DEMCR_MON_EN_BITS, 0x00010000
.equ	M33_DEMCR_MON_EN_MSB, 16
.equ	M33_DEMCR_MON_EN_LSB, 16
# -----------------------------------------------------------------------------
# Field       : M33_DEMCR_VC_SFERR
# Description : SecureFault exception halting debug vector catch enable
.equ	M33_DEMCR_VC_SFERR_RESET, 0x0
.equ	M33_DEMCR_VC_SFERR_BITS, 0x00000800
.equ	M33_DEMCR_VC_SFERR_MSB, 11
.equ	M33_DEMCR_VC_SFERR_LSB, 11
# -----------------------------------------------------------------------------
# Field       : M33_DEMCR_VC_HARDERR
# Description : HardFault exception halting debug vector catch enable
.equ	M33_DEMCR_VC_HARDERR_RESET, 0x0
.equ	M33_DEMCR_VC_HARDERR_BITS, 0x00000400
.equ	M33_DEMCR_VC_HARDERR_MSB, 10
.equ	M33_DEMCR_VC_HARDERR_LSB, 10
# -----------------------------------------------------------------------------
# Field       : M33_DEMCR_VC_INTERR
# Description : Enable halting debug vector catch for faults during exception
#               entry and return
.equ	M33_DEMCR_VC_INTERR_RESET, 0x0
.equ	M33_DEMCR_VC_INTERR_BITS, 0x00000200
.equ	M33_DEMCR_VC_INTERR_MSB, 9
.equ	M33_DEMCR_VC_INTERR_LSB, 9
# -----------------------------------------------------------------------------
# Field       : M33_DEMCR_VC_BUSERR
# Description : BusFault exception halting debug vector catch enable
.equ	M33_DEMCR_VC_BUSERR_RESET, 0x0
.equ	M33_DEMCR_VC_BUSERR_BITS, 0x00000100
.equ	M33_DEMCR_VC_BUSERR_MSB, 8
.equ	M33_DEMCR_VC_BUSERR_LSB, 8
# -----------------------------------------------------------------------------
# Field       : M33_DEMCR_VC_STATERR
# Description : Enable halting debug trap on a UsageFault exception caused by a
#               state information error, for example an Undefined Instruction
#               exception
.equ	M33_DEMCR_VC_STATERR_RESET, 0x0
.equ	M33_DEMCR_VC_STATERR_BITS, 0x00000080
.equ	M33_DEMCR_VC_STATERR_MSB, 7
.equ	M33_DEMCR_VC_STATERR_LSB, 7
# -----------------------------------------------------------------------------
# Field       : M33_DEMCR_VC_CHKERR
# Description : Enable halting debug trap on a UsageFault exception caused by a
#               checking error, for example an alignment check error
.equ	M33_DEMCR_VC_CHKERR_RESET, 0x0
.equ	M33_DEMCR_VC_CHKERR_BITS, 0x00000040
.equ	M33_DEMCR_VC_CHKERR_MSB, 6
.equ	M33_DEMCR_VC_CHKERR_LSB, 6
# -----------------------------------------------------------------------------
# Field       : M33_DEMCR_VC_NOCPERR
# Description : Enable halting debug trap on a UsageFault caused by an access
#               to a coprocessor
.equ	M33_DEMCR_VC_NOCPERR_RESET, 0x0
.equ	M33_DEMCR_VC_NOCPERR_BITS, 0x00000020
.equ	M33_DEMCR_VC_NOCPERR_MSB, 5
.equ	M33_DEMCR_VC_NOCPERR_LSB, 5
# -----------------------------------------------------------------------------
# Field       : M33_DEMCR_VC_MMERR
# Description : Enable halting debug trap on a MemManage exception
.equ	M33_DEMCR_VC_MMERR_RESET, 0x0
.equ	M33_DEMCR_VC_MMERR_BITS, 0x00000010
.equ	M33_DEMCR_VC_MMERR_MSB, 4
.equ	M33_DEMCR_VC_MMERR_LSB, 4
# -----------------------------------------------------------------------------
# Field       : M33_DEMCR_VC_CORERESET
# Description : Enable Reset Vector Catch. This causes a warm reset to halt a
#               running system
.equ	M33_DEMCR_VC_CORERESET_RESET, 0x0
.equ	M33_DEMCR_VC_CORERESET_BITS, 0x00000001
.equ	M33_DEMCR_VC_CORERESET_MSB, 0
.equ	M33_DEMCR_VC_CORERESET_LSB, 0
# =============================================================================
# Register    : M33_DSCSR
# Description : Provides control and status information for Secure debug
.equ	M33_DSCSR_OFFSET, 0x0000ee08
.equ	M33_DSCSR_BITS, 0x00030003
.equ	M33_DSCSR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_DSCSR_CDSKEY
# Description : Writes to the CDS bit are ignored unless CDSKEY is concurrently
#               written to zero
.equ	M33_DSCSR_CDSKEY_RESET, 0x0
.equ	M33_DSCSR_CDSKEY_BITS, 0x00020000
.equ	M33_DSCSR_CDSKEY_MSB, 17
.equ	M33_DSCSR_CDSKEY_LSB, 17
# -----------------------------------------------------------------------------
# Field       : M33_DSCSR_CDS
# Description : This field indicates the current Security state of the
#               processor
.equ	M33_DSCSR_CDS_RESET, 0x0
.equ	M33_DSCSR_CDS_BITS, 0x00010000
.equ	M33_DSCSR_CDS_MSB, 16
.equ	M33_DSCSR_CDS_LSB, 16
# -----------------------------------------------------------------------------
# Field       : M33_DSCSR_SBRSEL
# Description : If SBRSELEN is 1 this bit selects whether the Non-secure or the
#               Secure version of the memory-mapped Banked registers are
#               accessible to the debugger
.equ	M33_DSCSR_SBRSEL_RESET, 0x0
.equ	M33_DSCSR_SBRSEL_BITS, 0x00000002
.equ	M33_DSCSR_SBRSEL_MSB, 1
.equ	M33_DSCSR_SBRSEL_LSB, 1
# -----------------------------------------------------------------------------
# Field       : M33_DSCSR_SBRSELEN
# Description : Controls whether the SBRSEL field or the current Security state
#               of the processor selects which version of the memory-mapped
#               Banked registers are accessed to the debugger
.equ	M33_DSCSR_SBRSELEN_RESET, 0x0
.equ	M33_DSCSR_SBRSELEN_BITS, 0x00000001
.equ	M33_DSCSR_SBRSELEN_MSB, 0
.equ	M33_DSCSR_SBRSELEN_LSB, 0
