konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/m33.inc
# =============================================================================
# Register    : M33_STIR
# Description : Provides a mechanism for software to generate an interrupt
.equ	M33_STIR_OFFSET, 0x0000ef00
.equ	M33_STIR_BITS, 0x000001ff
.equ	M33_STIR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_STIR_INTID
# Description : Indicates the interrupt to be pended. The value written is
#               (ExceptionNumber - 16)
.equ	M33_STIR_INTID_RESET, 0x000
.equ	M33_STIR_INTID_BITS, 0x000001ff
.equ	M33_STIR_INTID_MSB, 8
.equ	M33_STIR_INTID_LSB, 0
# =============================================================================
# Register    : M33_FPCCR
# Description : Holds control data for the Floating-point extension
.equ	M33_FPCCR_OFFSET, 0x0000ef34
.equ	M33_FPCCR_BITS, 0xfc0007ff
.equ	M33_FPCCR_RESET, 0x20000472
# -----------------------------------------------------------------------------
# Field       : M33_FPCCR_ASPEN
# Description : When this bit is set to 1, execution of a floating-point
#               instruction sets the CONTROL.FPCA bit to 1
.equ	M33_FPCCR_ASPEN_RESET, 0x0
.equ	M33_FPCCR_ASPEN_BITS, 0x80000000
.equ	M33_FPCCR_ASPEN_MSB, 31
.equ	M33_FPCCR_ASPEN_LSB, 31
# -----------------------------------------------------------------------------
# Field       : M33_FPCCR_LSPEN
# Description : Enables lazy context save of floating-point state
.equ	M33_FPCCR_LSPEN_RESET, 0x0
.equ	M33_FPCCR_LSPEN_BITS, 0x40000000
.equ	M33_FPCCR_LSPEN_MSB, 30
.equ	M33_FPCCR_LSPEN_LSB, 30
# -----------------------------------------------------------------------------
# Field       : M33_FPCCR_LSPENS
# Description : This bit controls whether the LSPEN bit is writeable from the
#               Non-secure state
.equ	M33_FPCCR_LSPENS_RESET, 0x1
.equ	M33_FPCCR_LSPENS_BITS, 0x20000000
.equ	M33_FPCCR_LSPENS_MSB, 29
.equ	M33_FPCCR_LSPENS_LSB, 29
# -----------------------------------------------------------------------------
# Field       : M33_FPCCR_CLRONRET
# Description : Clear floating-point caller saved registers on exception return
.equ	M33_FPCCR_CLRONRET_RESET, 0x0
.equ	M33_FPCCR_CLRONRET_BITS, 0x10000000
.equ	M33_FPCCR_CLRONRET_MSB, 28
.equ	M33_FPCCR_CLRONRET_LSB, 28
# -----------------------------------------------------------------------------
# Field       : M33_FPCCR_CLRONRETS
# Description : This bit controls whether the CLRONRET bit is writeable from
#               the Non-secure state
.equ	M33_FPCCR_CLRONRETS_RESET, 0x0
.equ	M33_FPCCR_CLRONRETS_BITS, 0x08000000
.equ	M33_FPCCR_CLRONRETS_MSB, 27
.equ	M33_FPCCR_CLRONRETS_LSB, 27
# -----------------------------------------------------------------------------
# Field       : M33_FPCCR_TS
# Description : Treat floating-point registers as Secure enable
.equ	M33_FPCCR_TS_RESET, 0x0
.equ	M33_FPCCR_TS_BITS, 0x04000000
.equ	M33_FPCCR_TS_MSB, 26
.equ	M33_FPCCR_TS_LSB, 26
# -----------------------------------------------------------------------------
# Field       : M33_FPCCR_UFRDY
# Description : Indicates whether the software executing when the PE allocated
#               the floating-point stack frame was able to set the UsageFault
#               exception to pending
.equ	M33_FPCCR_UFRDY_RESET, 0x1
.equ	M33_FPCCR_UFRDY_BITS, 0x00000400
.equ	M33_FPCCR_UFRDY_MSB, 10
.equ	M33_FPCCR_UFRDY_LSB, 10
# -----------------------------------------------------------------------------
# Field       : M33_FPCCR_SPLIMVIOL
# Description : This bit is banked between the Security states and indicates
#               whether the floating-point context violates the stack pointer
#               limit that was active when lazy state preservation was
#               activated. SPLIMVIOL modifies the lazy floating-point state
#               preservation behavior
.equ	M33_FPCCR_SPLIMVIOL_RESET, 0x0
.equ	M33_FPCCR_SPLIMVIOL_BITS, 0x00000200
.equ	M33_FPCCR_SPLIMVIOL_MSB, 9
.equ	M33_FPCCR_SPLIMVIOL_LSB, 9
# -----------------------------------------------------------------------------
# Field       : M33_FPCCR_MONRDY
# Description : Indicates whether the software executing when the PE allocated
#               the floating-point stack frame was able to set the DebugMonitor
#               exception to pending
.equ	M33_FPCCR_MONRDY_RESET, 0x0
.equ	M33_FPCCR_MONRDY_BITS, 0x00000100
.equ	M33_FPCCR_MONRDY_MSB, 8
.equ	M33_FPCCR_MONRDY_LSB, 8
# -----------------------------------------------------------------------------
# Field       : M33_FPCCR_SFRDY
# Description : Indicates whether the software executing when the PE allocated
#               the floating-point stack frame was able to set the SecureFault
#               exception to pending. This bit is only present in the Secure
#               version of the register, and behaves as RAZ/WI when accessed
#               from the Non-secure state
.equ	M33_FPCCR_SFRDY_RESET, 0x0
.equ	M33_FPCCR_SFRDY_BITS, 0x00000080
.equ	M33_FPCCR_SFRDY_MSB, 7
.equ	M33_FPCCR_SFRDY_LSB, 7
# -----------------------------------------------------------------------------
# Field       : M33_FPCCR_BFRDY
# Description : Indicates whether the software executing when the PE allocated
#               the floating-point stack frame was able to set the BusFault
#               exception to pending
.equ	M33_FPCCR_BFRDY_RESET, 0x1
.equ	M33_FPCCR_BFRDY_BITS, 0x00000040
.equ	M33_FPCCR_BFRDY_MSB, 6
.equ	M33_FPCCR_BFRDY_LSB, 6
# -----------------------------------------------------------------------------
# Field       : M33_FPCCR_MMRDY
# Description : Indicates whether the software executing when the PE allocated
#               the floating-point stack frame was able to set the MemManage
#               exception to pending
.equ	M33_FPCCR_MMRDY_RESET, 0x1
.equ	M33_FPCCR_MMRDY_BITS, 0x00000020
.equ	M33_FPCCR_MMRDY_MSB, 5
.equ	M33_FPCCR_MMRDY_LSB, 5
# -----------------------------------------------------------------------------
# Field       : M33_FPCCR_HFRDY
# Description : Indicates whether the software executing when the PE allocated
#               the floating-point stack frame was able to set the HardFault
#               exception to pending
.equ	M33_FPCCR_HFRDY_RESET, 0x1
.equ	M33_FPCCR_HFRDY_BITS, 0x00000010
.equ	M33_FPCCR_HFRDY_MSB, 4
.equ	M33_FPCCR_HFRDY_LSB, 4
# -----------------------------------------------------------------------------
# Field       : M33_FPCCR_THREAD
# Description : Indicates the PE mode when it allocated the floating-point
#               stack frame
.equ	M33_FPCCR_THREAD_RESET, 0x0
.equ	M33_FPCCR_THREAD_BITS, 0x00000008
.equ	M33_FPCCR_THREAD_MSB, 3
.equ	M33_FPCCR_THREAD_LSB, 3
# -----------------------------------------------------------------------------
# Field       : M33_FPCCR_S
# Description : Security status of the floating-point context. This bit is only
#               present in the Secure version of the register, and behaves as
#               RAZ/WI when accessed from the Non-secure state. This bit is
#               updated whenever lazy state preservation is activated, or when
#               a floating-point instruction is executed
.equ	M33_FPCCR_S_RESET, 0x0
.equ	M33_FPCCR_S_BITS, 0x00000004
.equ	M33_FPCCR_S_MSB, 2
.equ	M33_FPCCR_S_LSB, 2
# -----------------------------------------------------------------------------
# Field       : M33_FPCCR_USER
# Description : Indicates the privilege level of the software executing when
#               the PE allocated the floating-point stack frame
.equ	M33_FPCCR_USER_RESET, 0x1
.equ	M33_FPCCR_USER_BITS, 0x00000002
.equ	M33_FPCCR_USER_MSB, 1
.equ	M33_FPCCR_USER_LSB, 1
# -----------------------------------------------------------------------------
# Field       : M33_FPCCR_LSPACT
# Description : Indicates whether lazy preservation of the floating-point state
#               is active
.equ	M33_FPCCR_LSPACT_RESET, 0x0
.equ	M33_FPCCR_LSPACT_BITS, 0x00000001
.equ	M33_FPCCR_LSPACT_MSB, 0
.equ	M33_FPCCR_LSPACT_LSB, 0
# =============================================================================
# Register    : M33_FPCAR
# Description : Holds the location of the unpopulated floating-point register
#               space allocated on an exception stack frame
.equ	M33_FPCAR_OFFSET, 0x0000ef38
.equ	M33_FPCAR_BITS, 0xfffffff8
.equ	M33_FPCAR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_FPCAR_ADDRESS
# Description : The location of the unpopulated floating-point register space
#               allocated on an exception stack frame
.equ	M33_FPCAR_ADDRESS_RESET, 0x00000000
.equ	M33_FPCAR_ADDRESS_BITS, 0xfffffff8
.equ	M33_FPCAR_ADDRESS_MSB, 31
.equ	M33_FPCAR_ADDRESS_LSB, 3
# =============================================================================
# Register    : M33_FPDSCR
# Description : Holds the default values for the floating-point status control
#               data that the PE assigns to the FPSCR when it creates a new
#               floating-point context
.equ	M33_FPDSCR_OFFSET, 0x0000ef3c
.equ	M33_FPDSCR_BITS, 0x07c00000
.equ	M33_FPDSCR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_FPDSCR_AHP
# Description : Default value for FPSCR.AHP
.equ	M33_FPDSCR_AHP_RESET, 0x0
.equ	M33_FPDSCR_AHP_BITS, 0x04000000
.equ	M33_FPDSCR_AHP_MSB, 26
.equ	M33_FPDSCR_AHP_LSB, 26
# -----------------------------------------------------------------------------
# Field       : M33_FPDSCR_DN
# Description : Default value for FPSCR.DN
.equ	M33_FPDSCR_DN_RESET, 0x0
.equ	M33_FPDSCR_DN_BITS, 0x02000000
.equ	M33_FPDSCR_DN_MSB, 25
.equ	M33_FPDSCR_DN_LSB, 25
# -----------------------------------------------------------------------------
# Field       : M33_FPDSCR_FZ
# Description : Default value for FPSCR.FZ
.equ	M33_FPDSCR_FZ_RESET, 0x0
.equ	M33_FPDSCR_FZ_BITS, 0x01000000
.equ	M33_FPDSCR_FZ_MSB, 24
.equ	M33_FPDSCR_FZ_LSB, 24
# -----------------------------------------------------------------------------
# Field       : M33_FPDSCR_RMODE
# Description : Default value for FPSCR.RMode
.equ	M33_FPDSCR_RMODE_RESET, 0x0
.equ	M33_FPDSCR_RMODE_BITS, 0x00c00000
.equ	M33_FPDSCR_RMODE_MSB, 23
.equ	M33_FPDSCR_RMODE_LSB, 22
# =============================================================================
# Register    : M33_MVFR0
# Description : Describes the features provided by the Floating-point Extension
.equ	M33_MVFR0_OFFSET, 0x0000ef40
.equ	M33_MVFR0_BITS, 0xf0ff0fff
.equ	M33_MVFR0_RESET, 0x60540601
# -----------------------------------------------------------------------------
# Field       : M33_MVFR0_FPROUND
# Description : Indicates the rounding modes supported by the FP Extension
.equ	M33_MVFR0_FPROUND_RESET, 0x6
.equ	M33_MVFR0_FPROUND_BITS, 0xf0000000
.equ	M33_MVFR0_FPROUND_MSB, 31
.equ	M33_MVFR0_FPROUND_LSB, 28
# -----------------------------------------------------------------------------
# Field       : M33_MVFR0_FPSQRT
# Description : Indicates the support for FP square root operations
.equ	M33_MVFR0_FPSQRT_RESET, 0x5
.equ	M33_MVFR0_FPSQRT_BITS, 0x00f00000
.equ	M33_MVFR0_FPSQRT_MSB, 23
.equ	M33_MVFR0_FPSQRT_LSB, 20
# -----------------------------------------------------------------------------
# Field       : M33_MVFR0_FPDIVIDE
# Description : Indicates the support for FP divide operations
.equ	M33_MVFR0_FPDIVIDE_RESET, 0x4
.equ	M33_MVFR0_FPDIVIDE_BITS, 0x000f0000
.equ	M33_MVFR0_FPDIVIDE_MSB, 19
.equ	M33_MVFR0_FPDIVIDE_LSB, 16
# -----------------------------------------------------------------------------
# Field       : M33_MVFR0_FPDP
# Description : Indicates support for FP double-precision operations
.equ	M33_MVFR0_FPDP_RESET, 0x6
.equ	M33_MVFR0_FPDP_BITS, 0x00000f00
.equ	M33_MVFR0_FPDP_MSB, 11
.equ	M33_MVFR0_FPDP_LSB, 8
# -----------------------------------------------------------------------------
# Field       : M33_MVFR0_FPSP
# Description : Indicates support for FP single-precision operations
.equ	M33_MVFR0_FPSP_RESET, 0x0
.equ	M33_MVFR0_FPSP_BITS, 0x000000f0
.equ	M33_MVFR0_FPSP_MSB, 7
.equ	M33_MVFR0_FPSP_LSB, 4
# -----------------------------------------------------------------------------
# Field       : M33_MVFR0_SIMDREG
# Description : Indicates size of FP register file
.equ	M33_MVFR0_SIMDREG_RESET, 0x1
.equ	M33_MVFR0_SIMDREG_BITS, 0x0000000f
.equ	M33_MVFR0_SIMDREG_MSB, 3
.equ	M33_MVFR0_SIMDREG_LSB, 0
# =============================================================================
# Register    : M33_MVFR1
# Description : Describes the features provided by the Floating-point Extension
.equ	M33_MVFR1_OFFSET, 0x0000ef44
.equ	M33_MVFR1_BITS, 0xff0000ff
.equ	M33_MVFR1_RESET, 0x85000089
# -----------------------------------------------------------------------------
# Field       : M33_MVFR1_FMAC
# Description : Indicates whether the FP Extension implements the fused
#               multiply accumulate instructions
.equ	M33_MVFR1_FMAC_RESET, 0x8
.equ	M33_MVFR1_FMAC_BITS, 0xf0000000
.equ	M33_MVFR1_FMAC_MSB, 31
.equ	M33_MVFR1_FMAC_LSB, 28
# -----------------------------------------------------------------------------
# Field       : M33_MVFR1_FPHP
# Description : Indicates whether the FP Extension implements half-precision FP
#               conversion instructions
.equ	M33_MVFR1_FPHP_RESET, 0x5
.equ	M33_MVFR1_FPHP_BITS, 0x0f000000
.equ	M33_MVFR1_FPHP_MSB, 27
.equ	M33_MVFR1_FPHP_LSB, 24
# -----------------------------------------------------------------------------
# Field       : M33_MVFR1_FPDNAN
# Description : Indicates whether the FP hardware implementation supports NaN
#               propagation
.equ	M33_MVFR1_FPDNAN_RESET, 0x8
.equ	M33_MVFR1_FPDNAN_BITS, 0x000000f0
.equ	M33_MVFR1_FPDNAN_MSB, 7
.equ	M33_MVFR1_FPDNAN_LSB, 4
# -----------------------------------------------------------------------------
# Field       : M33_MVFR1_FPFTZ
# Description : Indicates whether subnormals are always flushed-to-zero
.equ	M33_MVFR1_FPFTZ_RESET, 0x9
.equ	M33_MVFR1_FPFTZ_BITS, 0x0000000f
.equ	M33_MVFR1_FPFTZ_MSB, 3
.equ	M33_MVFR1_FPFTZ_LSB, 0
# =============================================================================
# Register    : M33_MVFR2
# Description : Describes the features provided by the Floating-point Extension
.equ	M33_MVFR2_OFFSET, 0x0000ef48
.equ	M33_MVFR2_BITS, 0x000000f0
.equ	M33_MVFR2_RESET, 0x00000060
# -----------------------------------------------------------------------------
# Field       : M33_MVFR2_FPMISC
# Description : Indicates support for miscellaneous FP features
.equ	M33_MVFR2_FPMISC_RESET, 0x6
.equ	M33_MVFR2_FPMISC_BITS, 0x000000f0
.equ	M33_MVFR2_FPMISC_MSB, 7
.equ	M33_MVFR2_FPMISC_LSB, 4
# =============================================================================
# Register    : M33_DDEVARCH
# Description : Provides CoreSight discovery information for the SCS
.equ	M33_DDEVARCH_OFFSET, 0x0000efbc
.equ	M33_DDEVARCH_BITS, 0xffffffff
.equ	M33_DDEVARCH_RESET, 0x47702a04
# -----------------------------------------------------------------------------
# Field       : M33_DDEVARCH_ARCHITECT
# Description : Defines the architect of the component. Bits [31:28] are the
#               JEP106 continuation code (JEP106 bank ID, minus 1) and bits
#               [27:21] are the JEP106 ID code.
.equ	M33_DDEVARCH_ARCHITECT_RESET, 0x23b
.equ	M33_DDEVARCH_ARCHITECT_BITS, 0xffe00000
.equ	M33_DDEVARCH_ARCHITECT_MSB, 31
.equ	M33_DDEVARCH_ARCHITECT_LSB, 21
# -----------------------------------------------------------------------------
# Field       : M33_DDEVARCH_PRESENT
# Description : Defines that the DEVARCH register is present
.equ	M33_DDEVARCH_PRESENT_RESET, 0x1
.equ	M33_DDEVARCH_PRESENT_BITS, 0x00100000
.equ	M33_DDEVARCH_PRESENT_MSB, 20
.equ	M33_DDEVARCH_PRESENT_LSB, 20
# -----------------------------------------------------------------------------
# Field       : M33_DDEVARCH_REVISION
# Description : Defines the architecture revision of the component
.equ	M33_DDEVARCH_REVISION_RESET, 0x0
.equ	M33_DDEVARCH_REVISION_BITS, 0x000f0000
.equ	M33_DDEVARCH_REVISION_MSB, 19
.equ	M33_DDEVARCH_REVISION_LSB, 16
# -----------------------------------------------------------------------------
# Field       : M33_DDEVARCH_ARCHVER
# Description : Defines the architecture version of the component
.equ	M33_DDEVARCH_ARCHVER_RESET, 0x2
.equ	M33_DDEVARCH_ARCHVER_BITS, 0x0000f000
.equ	M33_DDEVARCH_ARCHVER_MSB, 15
.equ	M33_DDEVARCH_ARCHVER_LSB, 12
# -----------------------------------------------------------------------------
# Field       : M33_DDEVARCH_ARCHPART
# Description : Defines the architecture of the component
.equ	M33_DDEVARCH_ARCHPART_RESET, 0xa04
.equ	M33_DDEVARCH_ARCHPART_BITS, 0x00000fff
.equ	M33_DDEVARCH_ARCHPART_MSB, 11
.equ	M33_DDEVARCH_ARCHPART_LSB, 0
# =============================================================================
# Register    : M33_DDEVTYPE
# Description : Provides CoreSight discovery information for the SCS
.equ	M33_DDEVTYPE_OFFSET, 0x0000efcc
.equ	M33_DDEVTYPE_BITS, 0x000000ff
.equ	M33_DDEVTYPE_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_DDEVTYPE_SUB
# Description : Component sub-type
.equ	M33_DDEVTYPE_SUB_RESET, 0x0
.equ	M33_DDEVTYPE_SUB_BITS, 0x000000f0
.equ	M33_DDEVTYPE_SUB_MSB, 7
.equ	M33_DDEVTYPE_SUB_LSB, 4
# -----------------------------------------------------------------------------
# Field       : M33_DDEVTYPE_MAJOR
# Description : CoreSight major type
.equ	M33_DDEVTYPE_MAJOR_RESET, 0x0
.equ	M33_DDEVTYPE_MAJOR_BITS, 0x0000000f
.equ	M33_DDEVTYPE_MAJOR_MSB, 3
.equ	M33_DDEVTYPE_MAJOR_LSB, 0
# =============================================================================
# Register    : M33_DPIDR4
# Description : Provides CoreSight discovery information for the SCS
.equ	M33_DPIDR4_OFFSET, 0x0000efd0
.equ	M33_DPIDR4_BITS, 0x000000ff
.equ	M33_DPIDR4_RESET, 0x00000004
# -----------------------------------------------------------------------------
# Field       : M33_DPIDR4_SIZE
# Description : See CoreSight Architecture Specification
.equ	M33_DPIDR4_SIZE_RESET, 0x0
.equ	M33_DPIDR4_SIZE_BITS, 0x000000f0
.equ	M33_DPIDR4_SIZE_MSB, 7
.equ	M33_DPIDR4_SIZE_LSB, 4
# -----------------------------------------------------------------------------
# Field       : M33_DPIDR4_DES_2
# Description : See CoreSight Architecture Specification
.equ	M33_DPIDR4_DES_2_RESET, 0x4
.equ	M33_DPIDR4_DES_2_BITS, 0x0000000f
.equ	M33_DPIDR4_DES_2_MSB, 3
.equ	M33_DPIDR4_DES_2_LSB, 0
# =============================================================================
# Register    : M33_DPIDR5
# Description : Provides CoreSight discovery information for the SCS
.equ	M33_DPIDR5_OFFSET, 0x0000efd4
.equ	M33_DPIDR5_BITS, 0x00000000
.equ	M33_DPIDR5_RESET, 0x00000000
.equ	M33_DPIDR5_MSB, 31
.equ	M33_DPIDR5_LSB, 0
# =============================================================================
# Register    : M33_DPIDR6
# Description : Provides CoreSight discovery information for the SCS
.equ	M33_DPIDR6_OFFSET, 0x0000efd8
.equ	M33_DPIDR6_BITS, 0x00000000
.equ	M33_DPIDR6_RESET, 0x00000000
.equ	M33_DPIDR6_MSB, 31
.equ	M33_DPIDR6_LSB, 0
# =============================================================================
# Register    : M33_DPIDR7
# Description : Provides CoreSight discovery information for the SCS
.equ	M33_DPIDR7_OFFSET, 0x0000efdc
.equ	M33_DPIDR7_BITS, 0x00000000
.equ	M33_DPIDR7_RESET, 0x00000000
.equ	M33_DPIDR7_MSB, 31
.equ	M33_DPIDR7_LSB, 0
# =============================================================================
# Register    : M33_DPIDR0
# Description : Provides CoreSight discovery information for the SCS
.equ	M33_DPIDR0_OFFSET, 0x0000efe0
.equ	M33_DPIDR0_BITS, 0x000000ff
.equ	M33_DPIDR0_RESET, 0x00000021
# -----------------------------------------------------------------------------
# Field       : M33_DPIDR0_PART_0
# Description : See CoreSight Architecture Specification
.equ	M33_DPIDR0_PART_0_RESET, 0x21
.equ	M33_DPIDR0_PART_0_BITS, 0x000000ff
.equ	M33_DPIDR0_PART_0_MSB, 7
.equ	M33_DPIDR0_PART_0_LSB, 0
# =============================================================================
# Register    : M33_DPIDR1
# Description : Provides CoreSight discovery information for the SCS
.equ	M33_DPIDR1_OFFSET, 0x0000efe4
.equ	M33_DPIDR1_BITS, 0x000000ff
.equ	M33_DPIDR1_RESET, 0x000000bd
# -----------------------------------------------------------------------------
# Field       : M33_DPIDR1_DES_0
# Description : See CoreSight Architecture Specification
.equ	M33_DPIDR1_DES_0_RESET, 0xb
.equ	M33_DPIDR1_DES_0_BITS, 0x000000f0
.equ	M33_DPIDR1_DES_0_MSB, 7
.equ	M33_DPIDR1_DES_0_LSB, 4
# -----------------------------------------------------------------------------
# Field       : M33_DPIDR1_PART_1
# Description : See CoreSight Architecture Specification
.equ	M33_DPIDR1_PART_1_RESET, 0xd
.equ	M33_DPIDR1_PART_1_BITS, 0x0000000f
.equ	M33_DPIDR1_PART_1_MSB, 3
.equ	M33_DPIDR1_PART_1_LSB, 0
# =============================================================================
# Register    : M33_DPIDR2
# Description : Provides CoreSight discovery information for the SCS
.equ	M33_DPIDR2_OFFSET, 0x0000efe8
.equ	M33_DPIDR2_BITS, 0x000000ff
.equ	M33_DPIDR2_RESET, 0x0000000b
# -----------------------------------------------------------------------------
# Field       : M33_DPIDR2_REVISION
# Description : See CoreSight Architecture Specification
.equ	M33_DPIDR2_REVISION_RESET, 0x0
.equ	M33_DPIDR2_REVISION_BITS, 0x000000f0
.equ	M33_DPIDR2_REVISION_MSB, 7
.equ	M33_DPIDR2_REVISION_LSB, 4
# -----------------------------------------------------------------------------
# Field       : M33_DPIDR2_JEDEC
# Description : See CoreSight Architecture Specification
.equ	M33_DPIDR2_JEDEC_RESET, 0x1
.equ	M33_DPIDR2_JEDEC_BITS, 0x00000008
.equ	M33_DPIDR2_JEDEC_MSB, 3
.equ	M33_DPIDR2_JEDEC_LSB, 3
# -----------------------------------------------------------------------------
# Field       : M33_DPIDR2_DES_1
# Description : See CoreSight Architecture Specification
.equ	M33_DPIDR2_DES_1_RESET, 0x3
.equ	M33_DPIDR2_DES_1_BITS, 0x00000007
.equ	M33_DPIDR2_DES_1_MSB, 2
.equ	M33_DPIDR2_DES_1_LSB, 0
# =============================================================================
# Register    : M33_DPIDR3
# Description : Provides CoreSight discovery information for the SCS
.equ	M33_DPIDR3_OFFSET, 0x0000efec
.equ	M33_DPIDR3_BITS, 0x000000ff
.equ	M33_DPIDR3_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_DPIDR3_REVAND
# Description : See CoreSight Architecture Specification
.equ	M33_DPIDR3_REVAND_RESET, 0x0
.equ	M33_DPIDR3_REVAND_BITS, 0x000000f0
.equ	M33_DPIDR3_REVAND_MSB, 7
.equ	M33_DPIDR3_REVAND_LSB, 4
# -----------------------------------------------------------------------------
# Field       : M33_DPIDR3_CMOD
# Description : See CoreSight Architecture Specification
.equ	M33_DPIDR3_CMOD_RESET, 0x0
.equ	M33_DPIDR3_CMOD_BITS, 0x0000000f
.equ	M33_DPIDR3_CMOD_MSB, 3
.equ	M33_DPIDR3_CMOD_LSB, 0
# =============================================================================
# Register    : M33_DCIDR0
# Description : Provides CoreSight discovery information for the SCS
.equ	M33_DCIDR0_OFFSET, 0x0000eff0
.equ	M33_DCIDR0_BITS, 0x000000ff
.equ	M33_DCIDR0_RESET, 0x0000000d
# -----------------------------------------------------------------------------
# Field       : M33_DCIDR0_PRMBL_0
# Description : See CoreSight Architecture Specification
.equ	M33_DCIDR0_PRMBL_0_RESET, 0x0d
.equ	M33_DCIDR0_PRMBL_0_BITS, 0x000000ff
.equ	M33_DCIDR0_PRMBL_0_MSB, 7
.equ	M33_DCIDR0_PRMBL_0_LSB, 0
# =============================================================================
# Register    : M33_DCIDR1
# Description : Provides CoreSight discovery information for the SCS
.equ	M33_DCIDR1_OFFSET, 0x0000eff4
.equ	M33_DCIDR1_BITS, 0x000000ff
.equ	M33_DCIDR1_RESET, 0x00000090
# -----------------------------------------------------------------------------
# Field       : M33_DCIDR1_CLASS
# Description : See CoreSight Architecture Specification
.equ	M33_DCIDR1_CLASS_RESET, 0x9
