konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/m33.inc
.equ	M33_DCIDR1_CLASS_BITS, 0x000000f0
.equ	M33_DCIDR1_CLASS_MSB, 7
.equ	M33_DCIDR1_CLASS_LSB, 4
# -----------------------------------------------------------------------------
# Field       : M33_DCIDR1_PRMBL_1
# Description : See CoreSight Architecture Specification
.equ	M33_DCIDR1_PRMBL_1_RESET, 0x0
.equ	M33_DCIDR1_PRMBL_1_BITS, 0x0000000f
.equ	M33_DCIDR1_PRMBL_1_MSB, 3
.equ	M33_DCIDR1_PRMBL_1_LSB, 0
# =============================================================================
# Register    : M33_DCIDR2
# Description : Provides CoreSight discovery information for the SCS
.equ	M33_DCIDR2_OFFSET, 0x0000eff8
.equ	M33_DCIDR2_BITS, 0x000000ff
.equ	M33_DCIDR2_RESET, 0x00000005
# -----------------------------------------------------------------------------
# Field       : M33_DCIDR2_PRMBL_2
# Description : See CoreSight Architecture Specification
.equ	M33_DCIDR2_PRMBL_2_RESET, 0x05
.equ	M33_DCIDR2_PRMBL_2_BITS, 0x000000ff
.equ	M33_DCIDR2_PRMBL_2_MSB, 7
.equ	M33_DCIDR2_PRMBL_2_LSB, 0
# =============================================================================
# Register    : M33_DCIDR3
# Description : Provides CoreSight discovery information for the SCS
.equ	M33_DCIDR3_OFFSET, 0x0000effc
.equ	M33_DCIDR3_BITS, 0x000000ff
.equ	M33_DCIDR3_RESET, 0x000000b1
# -----------------------------------------------------------------------------
# Field       : M33_DCIDR3_PRMBL_3
# Description : See CoreSight Architecture Specification
.equ	M33_DCIDR3_PRMBL_3_RESET, 0xb1
.equ	M33_DCIDR3_PRMBL_3_BITS, 0x000000ff
.equ	M33_DCIDR3_PRMBL_3_MSB, 7
.equ	M33_DCIDR3_PRMBL_3_LSB, 0
# =============================================================================
# Register    : M33_TRCPRGCTLR
# Description : Programming Control Register
.equ	M33_TRCPRGCTLR_OFFSET, 0x00041004
.equ	M33_TRCPRGCTLR_BITS, 0x00000001
.equ	M33_TRCPRGCTLR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_TRCPRGCTLR_EN
# Description : Trace Unit Enable
.equ	M33_TRCPRGCTLR_EN_RESET, 0x0
.equ	M33_TRCPRGCTLR_EN_BITS, 0x00000001
.equ	M33_TRCPRGCTLR_EN_MSB, 0
.equ	M33_TRCPRGCTLR_EN_LSB, 0
# =============================================================================
# Register    : M33_TRCSTATR
# Description : The TRCSTATR indicates the ETM-Teal status
.equ	M33_TRCSTATR_OFFSET, 0x0004100c
.equ	M33_TRCSTATR_BITS, 0x00000003
.equ	M33_TRCSTATR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_TRCSTATR_PMSTABLE
# Description : Indicates whether the ETM-Teal registers are stable and can be
#               read
.equ	M33_TRCSTATR_PMSTABLE_RESET, 0x0
.equ	M33_TRCSTATR_PMSTABLE_BITS, 0x00000002
.equ	M33_TRCSTATR_PMSTABLE_MSB, 1
.equ	M33_TRCSTATR_PMSTABLE_LSB, 1
# -----------------------------------------------------------------------------
# Field       : M33_TRCSTATR_IDLE
# Description : Indicates that the trace unit is inactive
.equ	M33_TRCSTATR_IDLE_RESET, 0x0
.equ	M33_TRCSTATR_IDLE_BITS, 0x00000001
.equ	M33_TRCSTATR_IDLE_MSB, 0
.equ	M33_TRCSTATR_IDLE_LSB, 0
# =============================================================================
# Register    : M33_TRCCONFIGR
# Description : The TRCCONFIGR sets the basic tracing options for the trace
#               unit
.equ	M33_TRCCONFIGR_OFFSET, 0x00041010
.equ	M33_TRCCONFIGR_BITS, 0x00001ff8
.equ	M33_TRCCONFIGR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_TRCCONFIGR_RS
# Description : Return stack enable
.equ	M33_TRCCONFIGR_RS_RESET, 0x0
.equ	M33_TRCCONFIGR_RS_BITS, 0x00001000
.equ	M33_TRCCONFIGR_RS_MSB, 12
.equ	M33_TRCCONFIGR_RS_LSB, 12
# -----------------------------------------------------------------------------
# Field       : M33_TRCCONFIGR_TS
# Description : Global timestamp tracing
.equ	M33_TRCCONFIGR_TS_RESET, 0x0
.equ	M33_TRCCONFIGR_TS_BITS, 0x00000800
.equ	M33_TRCCONFIGR_TS_MSB, 11
.equ	M33_TRCCONFIGR_TS_LSB, 11
# -----------------------------------------------------------------------------
# Field       : M33_TRCCONFIGR_COND
# Description : Conditional instruction tracing
.equ	M33_TRCCONFIGR_COND_RESET, 0x00
.equ	M33_TRCCONFIGR_COND_BITS, 0x000007e0
.equ	M33_TRCCONFIGR_COND_MSB, 10
.equ	M33_TRCCONFIGR_COND_LSB, 5
# -----------------------------------------------------------------------------
# Field       : M33_TRCCONFIGR_CCI
# Description : Cycle counting in instruction trace
.equ	M33_TRCCONFIGR_CCI_RESET, 0x0
.equ	M33_TRCCONFIGR_CCI_BITS, 0x00000010
.equ	M33_TRCCONFIGR_CCI_MSB, 4
.equ	M33_TRCCONFIGR_CCI_LSB, 4
# -----------------------------------------------------------------------------
# Field       : M33_TRCCONFIGR_BB
# Description : Branch broadcast mode
.equ	M33_TRCCONFIGR_BB_RESET, 0x0
.equ	M33_TRCCONFIGR_BB_BITS, 0x00000008
.equ	M33_TRCCONFIGR_BB_MSB, 3
.equ	M33_TRCCONFIGR_BB_LSB, 3
# =============================================================================
# Register    : M33_TRCEVENTCTL0R
# Description : The TRCEVENTCTL0R controls the tracing of events in the trace
#               stream. The events also drive the ETM-Teal external outputs.
.equ	M33_TRCEVENTCTL0R_OFFSET, 0x00041020
.equ	M33_TRCEVENTCTL0R_BITS, 0x00008787
.equ	M33_TRCEVENTCTL0R_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_TRCEVENTCTL0R_TYPE1
# Description : Selects the resource type for event 1
.equ	M33_TRCEVENTCTL0R_TYPE1_RESET, 0x0
.equ	M33_TRCEVENTCTL0R_TYPE1_BITS, 0x00008000
.equ	M33_TRCEVENTCTL0R_TYPE1_MSB, 15
.equ	M33_TRCEVENTCTL0R_TYPE1_LSB, 15
# -----------------------------------------------------------------------------
# Field       : M33_TRCEVENTCTL0R_SEL1
# Description : Selects the resource number, based on the value of TYPE1: When
#               TYPE1 is 0, selects a single selected resource from 0-15
#               defined by SEL1[2:0].  When TYPE1 is 1, selects a Boolean
#               combined resource pair from 0-7 defined by SEL1[2:0]
.equ	M33_TRCEVENTCTL0R_SEL1_RESET, 0x0
.equ	M33_TRCEVENTCTL0R_SEL1_BITS, 0x00000700
.equ	M33_TRCEVENTCTL0R_SEL1_MSB, 10
.equ	M33_TRCEVENTCTL0R_SEL1_LSB, 8
# -----------------------------------------------------------------------------
# Field       : M33_TRCEVENTCTL0R_TYPE0
# Description : Selects the resource type for event 0
.equ	M33_TRCEVENTCTL0R_TYPE0_RESET, 0x0
.equ	M33_TRCEVENTCTL0R_TYPE0_BITS, 0x00000080
.equ	M33_TRCEVENTCTL0R_TYPE0_MSB, 7
.equ	M33_TRCEVENTCTL0R_TYPE0_LSB, 7
# -----------------------------------------------------------------------------
# Field       : M33_TRCEVENTCTL0R_SEL0
# Description : Selects the resource number, based on the value of TYPE0: When
#               TYPE1 is 0, selects a single selected resource from 0-15
#               defined by SEL0[2:0].  When TYPE1 is 1, selects a Boolean
#               combined resource pair from 0-7 defined by SEL0[2:0]
.equ	M33_TRCEVENTCTL0R_SEL0_RESET, 0x0
.equ	M33_TRCEVENTCTL0R_SEL0_BITS, 0x00000007
.equ	M33_TRCEVENTCTL0R_SEL0_MSB, 2
.equ	M33_TRCEVENTCTL0R_SEL0_LSB, 0
# =============================================================================
# Register    : M33_TRCEVENTCTL1R
# Description : The TRCEVENTCTL1R controls how the events selected by
#               TRCEVENTCTL0R behave
.equ	M33_TRCEVENTCTL1R_OFFSET, 0x00041024
.equ	M33_TRCEVENTCTL1R_BITS, 0x00001803
.equ	M33_TRCEVENTCTL1R_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_TRCEVENTCTL1R_LPOVERRIDE
# Description : Low power state behavior override
.equ	M33_TRCEVENTCTL1R_LPOVERRIDE_RESET, 0x0
.equ	M33_TRCEVENTCTL1R_LPOVERRIDE_BITS, 0x00001000
.equ	M33_TRCEVENTCTL1R_LPOVERRIDE_MSB, 12
.equ	M33_TRCEVENTCTL1R_LPOVERRIDE_LSB, 12
# -----------------------------------------------------------------------------
# Field       : M33_TRCEVENTCTL1R_ATB
# Description : ATB enabled
.equ	M33_TRCEVENTCTL1R_ATB_RESET, 0x0
.equ	M33_TRCEVENTCTL1R_ATB_BITS, 0x00000800
.equ	M33_TRCEVENTCTL1R_ATB_MSB, 11
.equ	M33_TRCEVENTCTL1R_ATB_LSB, 11
# -----------------------------------------------------------------------------
# Field       : M33_TRCEVENTCTL1R_INSTEN1
# Description : One bit per event, to enable generation of an event element in
#               the instruction trace stream when the selected event occurs
.equ	M33_TRCEVENTCTL1R_INSTEN1_RESET, 0x0
.equ	M33_TRCEVENTCTL1R_INSTEN1_BITS, 0x00000002
.equ	M33_TRCEVENTCTL1R_INSTEN1_MSB, 1
.equ	M33_TRCEVENTCTL1R_INSTEN1_LSB, 1
# -----------------------------------------------------------------------------
# Field       : M33_TRCEVENTCTL1R_INSTEN0
# Description : One bit per event, to enable generation of an event element in
#               the instruction trace stream when the selected event occurs
.equ	M33_TRCEVENTCTL1R_INSTEN0_RESET, 0x0
.equ	M33_TRCEVENTCTL1R_INSTEN0_BITS, 0x00000001
.equ	M33_TRCEVENTCTL1R_INSTEN0_MSB, 0
.equ	M33_TRCEVENTCTL1R_INSTEN0_LSB, 0
# =============================================================================
# Register    : M33_TRCSTALLCTLR
# Description : The TRCSTALLCTLR enables ETM-Teal to stall the processor if the
#               ETM-Teal FIFO goes over the programmed level to minimize risk
#               of overflow
.equ	M33_TRCSTALLCTLR_OFFSET, 0x0004102c
.equ	M33_TRCSTALLCTLR_BITS, 0x0000050c
.equ	M33_TRCSTALLCTLR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_TRCSTALLCTLR_INSTPRIORITY
# Description : Reserved, RES0
.equ	M33_TRCSTALLCTLR_INSTPRIORITY_RESET, 0x0
.equ	M33_TRCSTALLCTLR_INSTPRIORITY_BITS, 0x00000400
.equ	M33_TRCSTALLCTLR_INSTPRIORITY_MSB, 10
.equ	M33_TRCSTALLCTLR_INSTPRIORITY_LSB, 10
# -----------------------------------------------------------------------------
# Field       : M33_TRCSTALLCTLR_ISTALL
# Description : Stall processor based on instruction trace buffer space
.equ	M33_TRCSTALLCTLR_ISTALL_RESET, 0x0
.equ	M33_TRCSTALLCTLR_ISTALL_BITS, 0x00000100
.equ	M33_TRCSTALLCTLR_ISTALL_MSB, 8
.equ	M33_TRCSTALLCTLR_ISTALL_LSB, 8
# -----------------------------------------------------------------------------
# Field       : M33_TRCSTALLCTLR_LEVEL
# Description : Threshold at which stalling becomes active. This provides four
#               levels. This level can be varied to optimize the level of
#               invasion caused by stalling, balanced against the risk of a
#               FIFO overflow
.equ	M33_TRCSTALLCTLR_LEVEL_RESET, 0x0
.equ	M33_TRCSTALLCTLR_LEVEL_BITS, 0x0000000c
.equ	M33_TRCSTALLCTLR_LEVEL_MSB, 3
.equ	M33_TRCSTALLCTLR_LEVEL_LSB, 2
# =============================================================================
# Register    : M33_TRCTSCTLR
# Description : The TRCTSCTLR controls the insertion of global timestamps into
#               the trace stream. A timestamp is always inserted into the
#               instruction trace stream
.equ	M33_TRCTSCTLR_OFFSET, 0x00041030
.equ	M33_TRCTSCTLR_BITS, 0x00000083
.equ	M33_TRCTSCTLR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_TRCTSCTLR_TYPE0
# Description : Selects the resource type for event 0
.equ	M33_TRCTSCTLR_TYPE0_RESET, 0x0
.equ	M33_TRCTSCTLR_TYPE0_BITS, 0x00000080
.equ	M33_TRCTSCTLR_TYPE0_MSB, 7
.equ	M33_TRCTSCTLR_TYPE0_LSB, 7
# -----------------------------------------------------------------------------
# Field       : M33_TRCTSCTLR_SEL0
# Description : Selects the resource number, based on the value of TYPE0: When
#               TYPE1 is 0, selects a single selected resource from 0-15
#               defined by SEL0[2:0].  When TYPE1 is 1, selects a Boolean
#               combined resource pair from 0-7 defined by SEL0[2:0]
.equ	M33_TRCTSCTLR_SEL0_RESET, 0x0
.equ	M33_TRCTSCTLR_SEL0_BITS, 0x00000003
.equ	M33_TRCTSCTLR_SEL0_MSB, 1
.equ	M33_TRCTSCTLR_SEL0_LSB, 0
# =============================================================================
# Register    : M33_TRCSYNCPR
# Description : The TRCSYNCPR specifies the period of trace synchronization of
#               the trace streams. TRCSYNCPR defines a number of bytes of trace
#               between requests for trace synchronization. This value is
#               always a power of two
.equ	M33_TRCSYNCPR_OFFSET, 0x00041034
.equ	M33_TRCSYNCPR_BITS, 0x0000001f
.equ	M33_TRCSYNCPR_RESET, 0x0000000a
# -----------------------------------------------------------------------------
# Field       : M33_TRCSYNCPR_PERIOD
# Description : Defines the number of bytes of trace between trace
#               synchronization requests as a total of the number of bytes
#               generated by the instruction stream. The number of bytes is 2N
#               where N is the value of this field: - A value of zero disables
#               these periodic trace synchronization requests, but does not
#               disable other trace synchronization requests.  - The minimum
#               value that can be programmed, other than zero, is 8, providing
#               a minimum trace synchronization period of 256 bytes.  - The
#               maximum value is 20, providing a maximum trace synchronization
#               period of 2^20 bytes
.equ	M33_TRCSYNCPR_PERIOD_RESET, 0x0a
.equ	M33_TRCSYNCPR_PERIOD_BITS, 0x0000001f
.equ	M33_TRCSYNCPR_PERIOD_MSB, 4
.equ	M33_TRCSYNCPR_PERIOD_LSB, 0
# =============================================================================
# Register    : M33_TRCCCCTLR
# Description : The TRCCCCTLR sets the threshold value for instruction trace
#               cycle counting. The threshold represents the minimum interval
#               between cycle count trace packets
.equ	M33_TRCCCCTLR_OFFSET, 0x00041038
.equ	M33_TRCCCCTLR_BITS, 0x00000fff
.equ	M33_TRCCCCTLR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_TRCCCCTLR_THRESHOLD
# Description : Instruction trace cycle count threshold
.equ	M33_TRCCCCTLR_THRESHOLD_RESET, 0x000
.equ	M33_TRCCCCTLR_THRESHOLD_BITS, 0x00000fff
.equ	M33_TRCCCCTLR_THRESHOLD_MSB, 11
.equ	M33_TRCCCCTLR_THRESHOLD_LSB, 0
# =============================================================================
# Register    : M33_TRCVICTLR
# Description : The TRCVICTLR controls instruction trace filtering
.equ	M33_TRCVICTLR_OFFSET, 0x00041080
.equ	M33_TRCVICTLR_BITS, 0x00090e83
.equ	M33_TRCVICTLR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_TRCVICTLR_EXLEVEL_S3
# Description : In Secure state, each bit controls whether instruction tracing
#               is enabled for the corresponding exception level
.equ	M33_TRCVICTLR_EXLEVEL_S3_RESET, 0x0
.equ	M33_TRCVICTLR_EXLEVEL_S3_BITS, 0x00080000
.equ	M33_TRCVICTLR_EXLEVEL_S3_MSB, 19
.equ	M33_TRCVICTLR_EXLEVEL_S3_LSB, 19
# -----------------------------------------------------------------------------
# Field       : M33_TRCVICTLR_EXLEVEL_S0
# Description : In Secure state, each bit controls whether instruction tracing
#               is enabled for the corresponding exception level
.equ	M33_TRCVICTLR_EXLEVEL_S0_RESET, 0x0
.equ	M33_TRCVICTLR_EXLEVEL_S0_BITS, 0x00010000
.equ	M33_TRCVICTLR_EXLEVEL_S0_MSB, 16
.equ	M33_TRCVICTLR_EXLEVEL_S0_LSB, 16
# -----------------------------------------------------------------------------
# Field       : M33_TRCVICTLR_TRCERR
# Description : Selects whether a system error exception must always be traced
.equ	M33_TRCVICTLR_TRCERR_RESET, 0x0
.equ	M33_TRCVICTLR_TRCERR_BITS, 0x00000800
.equ	M33_TRCVICTLR_TRCERR_MSB, 11
.equ	M33_TRCVICTLR_TRCERR_LSB, 11
# -----------------------------------------------------------------------------
# Field       : M33_TRCVICTLR_TRCRESET
# Description : Selects whether a reset exception must always be traced
.equ	M33_TRCVICTLR_TRCRESET_RESET, 0x0
.equ	M33_TRCVICTLR_TRCRESET_BITS, 0x00000400
.equ	M33_TRCVICTLR_TRCRESET_MSB, 10
.equ	M33_TRCVICTLR_TRCRESET_LSB, 10
# -----------------------------------------------------------------------------
# Field       : M33_TRCVICTLR_SSSTATUS
# Description : Indicates the current status of the start/stop logic
.equ	M33_TRCVICTLR_SSSTATUS_RESET, 0x0
.equ	M33_TRCVICTLR_SSSTATUS_BITS, 0x00000200
.equ	M33_TRCVICTLR_SSSTATUS_MSB, 9
.equ	M33_TRCVICTLR_SSSTATUS_LSB, 9
# -----------------------------------------------------------------------------
# Field       : M33_TRCVICTLR_TYPE0
# Description : Selects the resource type for event 0
.equ	M33_TRCVICTLR_TYPE0_RESET, 0x0
.equ	M33_TRCVICTLR_TYPE0_BITS, 0x00000080
.equ	M33_TRCVICTLR_TYPE0_MSB, 7
.equ	M33_TRCVICTLR_TYPE0_LSB, 7
# -----------------------------------------------------------------------------
# Field       : M33_TRCVICTLR_SEL0
# Description : Selects the resource number, based on the value of TYPE0: When
#               TYPE1 is 0, selects a single selected resource from 0-15
#               defined by SEL0[2:0].  When TYPE1 is 1, selects a Boolean
#               combined resource pair from 0-7 defined by SEL0[2:0]
.equ	M33_TRCVICTLR_SEL0_RESET, 0x0
.equ	M33_TRCVICTLR_SEL0_BITS, 0x00000003
.equ	M33_TRCVICTLR_SEL0_MSB, 1
.equ	M33_TRCVICTLR_SEL0_LSB, 0
# =============================================================================
# Register    : M33_TRCCNTRLDVR0
# Description : The TRCCNTRLDVR defines the reload value for the reduced
#               function counter
.equ	M33_TRCCNTRLDVR0_OFFSET, 0x00041140
.equ	M33_TRCCNTRLDVR0_BITS, 0x0000ffff
.equ	M33_TRCCNTRLDVR0_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_TRCCNTRLDVR0_VALUE
# Description : Defines the reload value for the counter. This value is loaded
#               into the counter each time the reload event occurs
.equ	M33_TRCCNTRLDVR0_VALUE_RESET, 0x0000
.equ	M33_TRCCNTRLDVR0_VALUE_BITS, 0x0000ffff
.equ	M33_TRCCNTRLDVR0_VALUE_MSB, 15
.equ	M33_TRCCNTRLDVR0_VALUE_LSB, 0
# =============================================================================
# Register    : M33_TRCIDR8
# Description : TRCIDR8
.equ	M33_TRCIDR8_OFFSET, 0x00041180
.equ	M33_TRCIDR8_BITS, 0xffffffff
.equ	M33_TRCIDR8_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_TRCIDR8_MAXSPEC
# Description : reads as `ImpDef
.equ	M33_TRCIDR8_MAXSPEC_RESET, 0x00000000
.equ	M33_TRCIDR8_MAXSPEC_BITS, 0xffffffff
.equ	M33_TRCIDR8_MAXSPEC_MSB, 31
.equ	M33_TRCIDR8_MAXSPEC_LSB, 0
# =============================================================================
# Register    : M33_TRCIDR9
# Description : TRCIDR9
.equ	M33_TRCIDR9_OFFSET, 0x00041184
.equ	M33_TRCIDR9_BITS, 0xffffffff
.equ	M33_TRCIDR9_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_TRCIDR9_NUMP0KEY
# Description : reads as `ImpDef
.equ	M33_TRCIDR9_NUMP0KEY_RESET, 0x00000000
.equ	M33_TRCIDR9_NUMP0KEY_BITS, 0xffffffff
.equ	M33_TRCIDR9_NUMP0KEY_MSB, 31
.equ	M33_TRCIDR9_NUMP0KEY_LSB, 0
# =============================================================================
# Register    : M33_TRCIDR10
# Description : TRCIDR10
.equ	M33_TRCIDR10_OFFSET, 0x00041188
.equ	M33_TRCIDR10_BITS, 0xffffffff
.equ	M33_TRCIDR10_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_TRCIDR10_NUMP1KEY
# Description : reads as `ImpDef
.equ	M33_TRCIDR10_NUMP1KEY_RESET, 0x00000000
.equ	M33_TRCIDR10_NUMP1KEY_BITS, 0xffffffff
.equ	M33_TRCIDR10_NUMP1KEY_MSB, 31
.equ	M33_TRCIDR10_NUMP1KEY_LSB, 0
# =============================================================================
# Register    : M33_TRCIDR11
# Description : TRCIDR11
.equ	M33_TRCIDR11_OFFSET, 0x0004118c
.equ	M33_TRCIDR11_BITS, 0xffffffff
.equ	M33_TRCIDR11_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_TRCIDR11_NUMP1SPC
# Description : reads as `ImpDef
.equ	M33_TRCIDR11_NUMP1SPC_RESET, 0x00000000
.equ	M33_TRCIDR11_NUMP1SPC_BITS, 0xffffffff
.equ	M33_TRCIDR11_NUMP1SPC_MSB, 31
.equ	M33_TRCIDR11_NUMP1SPC_LSB, 0
# =============================================================================
# Register    : M33_TRCIDR12
# Description : TRCIDR12
.equ	M33_TRCIDR12_OFFSET, 0x00041190
.equ	M33_TRCIDR12_BITS, 0xffffffff
.equ	M33_TRCIDR12_RESET, 0x00000001
# -----------------------------------------------------------------------------
# Field       : M33_TRCIDR12_NUMCONDKEY
# Description : reads as `ImpDef
.equ	M33_TRCIDR12_NUMCONDKEY_RESET, 0x00000001
.equ	M33_TRCIDR12_NUMCONDKEY_BITS, 0xffffffff
.equ	M33_TRCIDR12_NUMCONDKEY_MSB, 31
.equ	M33_TRCIDR12_NUMCONDKEY_LSB, 0
# =============================================================================
# Register    : M33_TRCIDR13
# Description : TRCIDR13
.equ	M33_TRCIDR13_OFFSET, 0x00041194
.equ	M33_TRCIDR13_BITS, 0xffffffff
.equ	M33_TRCIDR13_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_TRCIDR13_NUMCONDSPC
# Description : reads as `ImpDef
.equ	M33_TRCIDR13_NUMCONDSPC_RESET, 0x00000000
.equ	M33_TRCIDR13_NUMCONDSPC_BITS, 0xffffffff
.equ	M33_TRCIDR13_NUMCONDSPC_MSB, 31
.equ	M33_TRCIDR13_NUMCONDSPC_LSB, 0
# =============================================================================
# Register    : M33_TRCIMSPEC
# Description : The TRCIMSPEC shows the presence of any IMPLEMENTATION SPECIFIC
#               features, and enables any features that are provided
.equ	M33_TRCIMSPEC_OFFSET, 0x000411c0
.equ	M33_TRCIMSPEC_BITS, 0x0000000f
.equ	M33_TRCIMSPEC_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_TRCIMSPEC_SUPPORT
# Description : Reserved, RES0
.equ	M33_TRCIMSPEC_SUPPORT_RESET, 0x0
.equ	M33_TRCIMSPEC_SUPPORT_BITS, 0x0000000f
.equ	M33_TRCIMSPEC_SUPPORT_MSB, 3
.equ	M33_TRCIMSPEC_SUPPORT_LSB, 0
# =============================================================================
# Register    : M33_TRCIDR0
# Description : TRCIDR0
.equ	M33_TRCIDR0_OFFSET, 0x000411e0
.equ	M33_TRCIDR0_BITS, 0x3f03feff
.equ	M33_TRCIDR0_RESET, 0x280006e1
# -----------------------------------------------------------------------------
# Field       : M33_TRCIDR0_COMMOPT
# Description : reads as `ImpDef
.equ	M33_TRCIDR0_COMMOPT_RESET, 0x1
.equ	M33_TRCIDR0_COMMOPT_BITS, 0x20000000
.equ	M33_TRCIDR0_COMMOPT_MSB, 29
.equ	M33_TRCIDR0_COMMOPT_LSB, 29
# -----------------------------------------------------------------------------
# Field       : M33_TRCIDR0_TSSIZE
# Description : reads as `ImpDef
.equ	M33_TRCIDR0_TSSIZE_RESET, 0x08
.equ	M33_TRCIDR0_TSSIZE_BITS, 0x1f000000
.equ	M33_TRCIDR0_TSSIZE_MSB, 28
.equ	M33_TRCIDR0_TSSIZE_LSB, 24
# -----------------------------------------------------------------------------
# Field       : M33_TRCIDR0_TRCEXDATA
# Description : reads as `ImpDef
.equ	M33_TRCIDR0_TRCEXDATA_RESET, 0x0
.equ	M33_TRCIDR0_TRCEXDATA_BITS, 0x00020000
.equ	M33_TRCIDR0_TRCEXDATA_MSB, 17
.equ	M33_TRCIDR0_TRCEXDATA_LSB, 17
# -----------------------------------------------------------------------------
# Field       : M33_TRCIDR0_QSUPP
# Description : reads as `ImpDef
.equ	M33_TRCIDR0_QSUPP_RESET, 0x0
.equ	M33_TRCIDR0_QSUPP_BITS, 0x00018000
.equ	M33_TRCIDR0_QSUPP_MSB, 16
.equ	M33_TRCIDR0_QSUPP_LSB, 15
# -----------------------------------------------------------------------------
# Field       : M33_TRCIDR0_QFILT
# Description : reads as `ImpDef
.equ	M33_TRCIDR0_QFILT_RESET, 0x0
.equ	M33_TRCIDR0_QFILT_BITS, 0x00004000
.equ	M33_TRCIDR0_QFILT_MSB, 14
.equ	M33_TRCIDR0_QFILT_LSB, 14
# -----------------------------------------------------------------------------
# Field       : M33_TRCIDR0_CONDTYPE
# Description : reads as `ImpDef
.equ	M33_TRCIDR0_CONDTYPE_RESET, 0x0
.equ	M33_TRCIDR0_CONDTYPE_BITS, 0x00003000
.equ	M33_TRCIDR0_CONDTYPE_MSB, 13
.equ	M33_TRCIDR0_CONDTYPE_LSB, 12
# -----------------------------------------------------------------------------
# Field       : M33_TRCIDR0_NUMEVENT
