konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/m33.inc
# Description : reads as `ImpDef
.equ	M33_TRCIDR0_NUMEVENT_RESET, 0x1
.equ	M33_TRCIDR0_NUMEVENT_BITS, 0x00000c00
.equ	M33_TRCIDR0_NUMEVENT_MSB, 11
.equ	M33_TRCIDR0_NUMEVENT_LSB, 10
# -----------------------------------------------------------------------------
# Field       : M33_TRCIDR0_RETSTACK
# Description : reads as `ImpDef
.equ	M33_TRCIDR0_RETSTACK_RESET, 0x1
.equ	M33_TRCIDR0_RETSTACK_BITS, 0x00000200
.equ	M33_TRCIDR0_RETSTACK_MSB, 9
.equ	M33_TRCIDR0_RETSTACK_LSB, 9
# -----------------------------------------------------------------------------
# Field       : M33_TRCIDR0_TRCCCI
# Description : reads as `ImpDef
.equ	M33_TRCIDR0_TRCCCI_RESET, 0x1
.equ	M33_TRCIDR0_TRCCCI_BITS, 0x00000080
.equ	M33_TRCIDR0_TRCCCI_MSB, 7
.equ	M33_TRCIDR0_TRCCCI_LSB, 7
# -----------------------------------------------------------------------------
# Field       : M33_TRCIDR0_TRCCOND
# Description : reads as `ImpDef
.equ	M33_TRCIDR0_TRCCOND_RESET, 0x1
.equ	M33_TRCIDR0_TRCCOND_BITS, 0x00000040
.equ	M33_TRCIDR0_TRCCOND_MSB, 6
.equ	M33_TRCIDR0_TRCCOND_LSB, 6
# -----------------------------------------------------------------------------
# Field       : M33_TRCIDR0_TRCBB
# Description : reads as `ImpDef
.equ	M33_TRCIDR0_TRCBB_RESET, 0x1
.equ	M33_TRCIDR0_TRCBB_BITS, 0x00000020
.equ	M33_TRCIDR0_TRCBB_MSB, 5
.equ	M33_TRCIDR0_TRCBB_LSB, 5
# -----------------------------------------------------------------------------
# Field       : M33_TRCIDR0_TRCDATA
# Description : reads as `ImpDef
.equ	M33_TRCIDR0_TRCDATA_RESET, 0x0
.equ	M33_TRCIDR0_TRCDATA_BITS, 0x00000018
.equ	M33_TRCIDR0_TRCDATA_MSB, 4
.equ	M33_TRCIDR0_TRCDATA_LSB, 3
# -----------------------------------------------------------------------------
# Field       : M33_TRCIDR0_INSTP0
# Description : reads as `ImpDef
.equ	M33_TRCIDR0_INSTP0_RESET, 0x0
.equ	M33_TRCIDR0_INSTP0_BITS, 0x00000006
.equ	M33_TRCIDR0_INSTP0_MSB, 2
.equ	M33_TRCIDR0_INSTP0_LSB, 1
# -----------------------------------------------------------------------------
# Field       : M33_TRCIDR0_RES1
# Description : Reserved, RES1
.equ	M33_TRCIDR0_RES1_RESET, 0x1
.equ	M33_TRCIDR0_RES1_BITS, 0x00000001
.equ	M33_TRCIDR0_RES1_MSB, 0
.equ	M33_TRCIDR0_RES1_LSB, 0
# =============================================================================
# Register    : M33_TRCIDR1
# Description : TRCIDR1
.equ	M33_TRCIDR1_OFFSET, 0x000411e4
.equ	M33_TRCIDR1_BITS, 0xff00ffff
.equ	M33_TRCIDR1_RESET, 0x4100f421
# -----------------------------------------------------------------------------
# Field       : M33_TRCIDR1_DESIGNER
# Description : reads as `ImpDef
.equ	M33_TRCIDR1_DESIGNER_RESET, 0x41
.equ	M33_TRCIDR1_DESIGNER_BITS, 0xff000000
.equ	M33_TRCIDR1_DESIGNER_MSB, 31
.equ	M33_TRCIDR1_DESIGNER_LSB, 24
# -----------------------------------------------------------------------------
# Field       : M33_TRCIDR1_RES1
# Description : Reserved, RES1
.equ	M33_TRCIDR1_RES1_RESET, 0xf
.equ	M33_TRCIDR1_RES1_BITS, 0x0000f000
.equ	M33_TRCIDR1_RES1_MSB, 15
.equ	M33_TRCIDR1_RES1_LSB, 12
# -----------------------------------------------------------------------------
# Field       : M33_TRCIDR1_TRCARCHMAJ
# Description : reads as 0b0100
.equ	M33_TRCIDR1_TRCARCHMAJ_RESET, 0x4
.equ	M33_TRCIDR1_TRCARCHMAJ_BITS, 0x00000f00
.equ	M33_TRCIDR1_TRCARCHMAJ_MSB, 11
.equ	M33_TRCIDR1_TRCARCHMAJ_LSB, 8
# -----------------------------------------------------------------------------
# Field       : M33_TRCIDR1_TRCARCHMIN
# Description : reads as 0b0000
.equ	M33_TRCIDR1_TRCARCHMIN_RESET, 0x2
.equ	M33_TRCIDR1_TRCARCHMIN_BITS, 0x000000f0
.equ	M33_TRCIDR1_TRCARCHMIN_MSB, 7
.equ	M33_TRCIDR1_TRCARCHMIN_LSB, 4
# -----------------------------------------------------------------------------
# Field       : M33_TRCIDR1_REVISION
# Description : reads as `ImpDef
.equ	M33_TRCIDR1_REVISION_RESET, 0x1
.equ	M33_TRCIDR1_REVISION_BITS, 0x0000000f
.equ	M33_TRCIDR1_REVISION_MSB, 3
.equ	M33_TRCIDR1_REVISION_LSB, 0
# =============================================================================
# Register    : M33_TRCIDR2
# Description : TRCIDR2
.equ	M33_TRCIDR2_OFFSET, 0x000411e8
.equ	M33_TRCIDR2_BITS, 0x1fffffff
.equ	M33_TRCIDR2_RESET, 0x00000004
# -----------------------------------------------------------------------------
# Field       : M33_TRCIDR2_CCSIZE
# Description : reads as `ImpDef
.equ	M33_TRCIDR2_CCSIZE_RESET, 0x0
.equ	M33_TRCIDR2_CCSIZE_BITS, 0x1e000000
.equ	M33_TRCIDR2_CCSIZE_MSB, 28
.equ	M33_TRCIDR2_CCSIZE_LSB, 25
# -----------------------------------------------------------------------------
# Field       : M33_TRCIDR2_DVSIZE
# Description : reads as `ImpDef
.equ	M33_TRCIDR2_DVSIZE_RESET, 0x00
.equ	M33_TRCIDR2_DVSIZE_BITS, 0x01f00000
.equ	M33_TRCIDR2_DVSIZE_MSB, 24
.equ	M33_TRCIDR2_DVSIZE_LSB, 20
# -----------------------------------------------------------------------------
# Field       : M33_TRCIDR2_DASIZE
# Description : reads as `ImpDef
.equ	M33_TRCIDR2_DASIZE_RESET, 0x00
.equ	M33_TRCIDR2_DASIZE_BITS, 0x000f8000
.equ	M33_TRCIDR2_DASIZE_MSB, 19
.equ	M33_TRCIDR2_DASIZE_LSB, 15
# -----------------------------------------------------------------------------
# Field       : M33_TRCIDR2_VMIDSIZE
# Description : reads as `ImpDef
.equ	M33_TRCIDR2_VMIDSIZE_RESET, 0x00
.equ	M33_TRCIDR2_VMIDSIZE_BITS, 0x00007c00
.equ	M33_TRCIDR2_VMIDSIZE_MSB, 14
.equ	M33_TRCIDR2_VMIDSIZE_LSB, 10
# -----------------------------------------------------------------------------
# Field       : M33_TRCIDR2_CIDSIZE
# Description : reads as `ImpDef
.equ	M33_TRCIDR2_CIDSIZE_RESET, 0x00
.equ	M33_TRCIDR2_CIDSIZE_BITS, 0x000003e0
.equ	M33_TRCIDR2_CIDSIZE_MSB, 9
.equ	M33_TRCIDR2_CIDSIZE_LSB, 5
# -----------------------------------------------------------------------------
# Field       : M33_TRCIDR2_IASIZE
# Description : reads as `ImpDef
.equ	M33_TRCIDR2_IASIZE_RESET, 0x04
.equ	M33_TRCIDR2_IASIZE_BITS, 0x0000001f
.equ	M33_TRCIDR2_IASIZE_MSB, 4
.equ	M33_TRCIDR2_IASIZE_LSB, 0
# =============================================================================
# Register    : M33_TRCIDR3
# Description : TRCIDR3
.equ	M33_TRCIDR3_OFFSET, 0x000411ec
.equ	M33_TRCIDR3_BITS, 0xffff0fff
.equ	M33_TRCIDR3_RESET, 0x0f090004
# -----------------------------------------------------------------------------
# Field       : M33_TRCIDR3_NOOVERFLOW
# Description : reads as `ImpDef
.equ	M33_TRCIDR3_NOOVERFLOW_RESET, 0x0
.equ	M33_TRCIDR3_NOOVERFLOW_BITS, 0x80000000
.equ	M33_TRCIDR3_NOOVERFLOW_MSB, 31
.equ	M33_TRCIDR3_NOOVERFLOW_LSB, 31
# -----------------------------------------------------------------------------
# Field       : M33_TRCIDR3_NUMPROC
# Description : reads as `ImpDef
.equ	M33_TRCIDR3_NUMPROC_RESET, 0x0
.equ	M33_TRCIDR3_NUMPROC_BITS, 0x70000000
.equ	M33_TRCIDR3_NUMPROC_MSB, 30
.equ	M33_TRCIDR3_NUMPROC_LSB, 28
# -----------------------------------------------------------------------------
# Field       : M33_TRCIDR3_SYSSTALL
# Description : reads as `ImpDef
.equ	M33_TRCIDR3_SYSSTALL_RESET, 0x1
.equ	M33_TRCIDR3_SYSSTALL_BITS, 0x08000000
.equ	M33_TRCIDR3_SYSSTALL_MSB, 27
.equ	M33_TRCIDR3_SYSSTALL_LSB, 27
# -----------------------------------------------------------------------------
# Field       : M33_TRCIDR3_STALLCTL
# Description : reads as `ImpDef
.equ	M33_TRCIDR3_STALLCTL_RESET, 0x1
.equ	M33_TRCIDR3_STALLCTL_BITS, 0x04000000
.equ	M33_TRCIDR3_STALLCTL_MSB, 26
.equ	M33_TRCIDR3_STALLCTL_LSB, 26
# -----------------------------------------------------------------------------
# Field       : M33_TRCIDR3_SYNCPR
# Description : reads as `ImpDef
.equ	M33_TRCIDR3_SYNCPR_RESET, 0x1
.equ	M33_TRCIDR3_SYNCPR_BITS, 0x02000000
.equ	M33_TRCIDR3_SYNCPR_MSB, 25
.equ	M33_TRCIDR3_SYNCPR_LSB, 25
# -----------------------------------------------------------------------------
# Field       : M33_TRCIDR3_TRCERR
# Description : reads as `ImpDef
.equ	M33_TRCIDR3_TRCERR_RESET, 0x1
.equ	M33_TRCIDR3_TRCERR_BITS, 0x01000000
.equ	M33_TRCIDR3_TRCERR_MSB, 24
.equ	M33_TRCIDR3_TRCERR_LSB, 24
# -----------------------------------------------------------------------------
# Field       : M33_TRCIDR3_EXLEVEL_NS
# Description : reads as `ImpDef
.equ	M33_TRCIDR3_EXLEVEL_NS_RESET, 0x0
.equ	M33_TRCIDR3_EXLEVEL_NS_BITS, 0x00f00000
.equ	M33_TRCIDR3_EXLEVEL_NS_MSB, 23
.equ	M33_TRCIDR3_EXLEVEL_NS_LSB, 20
# -----------------------------------------------------------------------------
# Field       : M33_TRCIDR3_EXLEVEL_S
# Description : reads as `ImpDef
.equ	M33_TRCIDR3_EXLEVEL_S_RESET, 0x9
.equ	M33_TRCIDR3_EXLEVEL_S_BITS, 0x000f0000
.equ	M33_TRCIDR3_EXLEVEL_S_MSB, 19
.equ	M33_TRCIDR3_EXLEVEL_S_LSB, 16
# -----------------------------------------------------------------------------
# Field       : M33_TRCIDR3_CCITMIN
# Description : reads as `ImpDef
.equ	M33_TRCIDR3_CCITMIN_RESET, 0x004
.equ	M33_TRCIDR3_CCITMIN_BITS, 0x00000fff
.equ	M33_TRCIDR3_CCITMIN_MSB, 11
.equ	M33_TRCIDR3_CCITMIN_LSB, 0
# =============================================================================
# Register    : M33_TRCIDR4
# Description : TRCIDR4
.equ	M33_TRCIDR4_OFFSET, 0x000411f0
.equ	M33_TRCIDR4_BITS, 0xfffff1ff
.equ	M33_TRCIDR4_RESET, 0x00114000
# -----------------------------------------------------------------------------
# Field       : M33_TRCIDR4_NUMVMIDC
# Description : reads as `ImpDef
.equ	M33_TRCIDR4_NUMVMIDC_RESET, 0x0
.equ	M33_TRCIDR4_NUMVMIDC_BITS, 0xf0000000
.equ	M33_TRCIDR4_NUMVMIDC_MSB, 31
.equ	M33_TRCIDR4_NUMVMIDC_LSB, 28
# -----------------------------------------------------------------------------
# Field       : M33_TRCIDR4_NUMCIDC
# Description : reads as `ImpDef
.equ	M33_TRCIDR4_NUMCIDC_RESET, 0x0
.equ	M33_TRCIDR4_NUMCIDC_BITS, 0x0f000000
.equ	M33_TRCIDR4_NUMCIDC_MSB, 27
.equ	M33_TRCIDR4_NUMCIDC_LSB, 24
# -----------------------------------------------------------------------------
# Field       : M33_TRCIDR4_NUMSSCC
# Description : reads as `ImpDef
.equ	M33_TRCIDR4_NUMSSCC_RESET, 0x1
.equ	M33_TRCIDR4_NUMSSCC_BITS, 0x00f00000
.equ	M33_TRCIDR4_NUMSSCC_MSB, 23
.equ	M33_TRCIDR4_NUMSSCC_LSB, 20
# -----------------------------------------------------------------------------
# Field       : M33_TRCIDR4_NUMRSPAIR
# Description : reads as `ImpDef
.equ	M33_TRCIDR4_NUMRSPAIR_RESET, 0x1
.equ	M33_TRCIDR4_NUMRSPAIR_BITS, 0x000f0000
.equ	M33_TRCIDR4_NUMRSPAIR_MSB, 19
.equ	M33_TRCIDR4_NUMRSPAIR_LSB, 16
# -----------------------------------------------------------------------------
# Field       : M33_TRCIDR4_NUMPC
# Description : reads as `ImpDef
.equ	M33_TRCIDR4_NUMPC_RESET, 0x4
.equ	M33_TRCIDR4_NUMPC_BITS, 0x0000f000
.equ	M33_TRCIDR4_NUMPC_MSB, 15
.equ	M33_TRCIDR4_NUMPC_LSB, 12
# -----------------------------------------------------------------------------
# Field       : M33_TRCIDR4_SUPPDAC
# Description : reads as `ImpDef
.equ	M33_TRCIDR4_SUPPDAC_RESET, 0x0
.equ	M33_TRCIDR4_SUPPDAC_BITS, 0x00000100
.equ	M33_TRCIDR4_SUPPDAC_MSB, 8
.equ	M33_TRCIDR4_SUPPDAC_LSB, 8
# -----------------------------------------------------------------------------
# Field       : M33_TRCIDR4_NUMDVC
# Description : reads as `ImpDef
.equ	M33_TRCIDR4_NUMDVC_RESET, 0x0
.equ	M33_TRCIDR4_NUMDVC_BITS, 0x000000f0
.equ	M33_TRCIDR4_NUMDVC_MSB, 7
.equ	M33_TRCIDR4_NUMDVC_LSB, 4
# -----------------------------------------------------------------------------
# Field       : M33_TRCIDR4_NUMACPAIRS
# Description : reads as `ImpDef
.equ	M33_TRCIDR4_NUMACPAIRS_RESET, 0x0
.equ	M33_TRCIDR4_NUMACPAIRS_BITS, 0x0000000f
.equ	M33_TRCIDR4_NUMACPAIRS_MSB, 3
.equ	M33_TRCIDR4_NUMACPAIRS_LSB, 0
# =============================================================================
# Register    : M33_TRCIDR5
# Description : TRCIDR5
.equ	M33_TRCIDR5_OFFSET, 0x000411f4
.equ	M33_TRCIDR5_BITS, 0xfeff0fff
.equ	M33_TRCIDR5_RESET, 0x90c70004
# -----------------------------------------------------------------------------
# Field       : M33_TRCIDR5_REDFUNCNTR
# Description : reads as `ImpDef
.equ	M33_TRCIDR5_REDFUNCNTR_RESET, 0x1
.equ	M33_TRCIDR5_REDFUNCNTR_BITS, 0x80000000
.equ	M33_TRCIDR5_REDFUNCNTR_MSB, 31
.equ	M33_TRCIDR5_REDFUNCNTR_LSB, 31
# -----------------------------------------------------------------------------
# Field       : M33_TRCIDR5_NUMCNTR
# Description : reads as `ImpDef
.equ	M33_TRCIDR5_NUMCNTR_RESET, 0x1
.equ	M33_TRCIDR5_NUMCNTR_BITS, 0x70000000
.equ	M33_TRCIDR5_NUMCNTR_MSB, 30
.equ	M33_TRCIDR5_NUMCNTR_LSB, 28
# -----------------------------------------------------------------------------
# Field       : M33_TRCIDR5_NUMSEQSTATE
# Description : reads as `ImpDef
.equ	M33_TRCIDR5_NUMSEQSTATE_RESET, 0x0
.equ	M33_TRCIDR5_NUMSEQSTATE_BITS, 0x0e000000
.equ	M33_TRCIDR5_NUMSEQSTATE_MSB, 27
.equ	M33_TRCIDR5_NUMSEQSTATE_LSB, 25
# -----------------------------------------------------------------------------
# Field       : M33_TRCIDR5_LPOVERRIDE
# Description : reads as `ImpDef
.equ	M33_TRCIDR5_LPOVERRIDE_RESET, 0x1
.equ	M33_TRCIDR5_LPOVERRIDE_BITS, 0x00800000
.equ	M33_TRCIDR5_LPOVERRIDE_MSB, 23
.equ	M33_TRCIDR5_LPOVERRIDE_LSB, 23
# -----------------------------------------------------------------------------
# Field       : M33_TRCIDR5_ATBTRIG
# Description : reads as `ImpDef
.equ	M33_TRCIDR5_ATBTRIG_RESET, 0x1
.equ	M33_TRCIDR5_ATBTRIG_BITS, 0x00400000
.equ	M33_TRCIDR5_ATBTRIG_MSB, 22
.equ	M33_TRCIDR5_ATBTRIG_LSB, 22
# -----------------------------------------------------------------------------
# Field       : M33_TRCIDR5_TRACEIDSIZE
# Description : reads as 0x07
.equ	M33_TRCIDR5_TRACEIDSIZE_RESET, 0x07
.equ	M33_TRCIDR5_TRACEIDSIZE_BITS, 0x003f0000
.equ	M33_TRCIDR5_TRACEIDSIZE_MSB, 21
.equ	M33_TRCIDR5_TRACEIDSIZE_LSB, 16
# -----------------------------------------------------------------------------
# Field       : M33_TRCIDR5_NUMEXTINSEL
# Description : reads as `ImpDef
.equ	M33_TRCIDR5_NUMEXTINSEL_RESET, 0x0
.equ	M33_TRCIDR5_NUMEXTINSEL_BITS, 0x00000e00
.equ	M33_TRCIDR5_NUMEXTINSEL_MSB, 11
.equ	M33_TRCIDR5_NUMEXTINSEL_LSB, 9
# -----------------------------------------------------------------------------
# Field       : M33_TRCIDR5_NUMEXTIN
# Description : reads as `ImpDef
.equ	M33_TRCIDR5_NUMEXTIN_RESET, 0x004
.equ	M33_TRCIDR5_NUMEXTIN_BITS, 0x000001ff
.equ	M33_TRCIDR5_NUMEXTIN_MSB, 8
.equ	M33_TRCIDR5_NUMEXTIN_LSB, 0
# =============================================================================
# Register    : M33_TRCIDR6
# Description : TRCIDR6
.equ	M33_TRCIDR6_OFFSET, 0x000411f8
.equ	M33_TRCIDR6_BITS, 0x00000000
.equ	M33_TRCIDR6_RESET, 0x00000000
.equ	M33_TRCIDR6_MSB, 31
.equ	M33_TRCIDR6_LSB, 0
# =============================================================================
# Register    : M33_TRCIDR7
# Description : TRCIDR7
.equ	M33_TRCIDR7_OFFSET, 0x000411fc
.equ	M33_TRCIDR7_BITS, 0x00000000
.equ	M33_TRCIDR7_RESET, 0x00000000
.equ	M33_TRCIDR7_MSB, 31
.equ	M33_TRCIDR7_LSB, 0
# =============================================================================
# Register    : M33_TRCRSCTLR2
# Description : The TRCRSCTLR controls the trace resources
.equ	M33_TRCRSCTLR2_OFFSET, 0x00041208
.equ	M33_TRCRSCTLR2_BITS, 0x003700ff
.equ	M33_TRCRSCTLR2_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_TRCRSCTLR2_PAIRINV
# Description : Inverts the result of a combined pair of resources.  This bit
#               is only implemented on the lower register for a pair of
#               resource selectors
.equ	M33_TRCRSCTLR2_PAIRINV_RESET, 0x0
.equ	M33_TRCRSCTLR2_PAIRINV_BITS, 0x00200000
.equ	M33_TRCRSCTLR2_PAIRINV_MSB, 21
.equ	M33_TRCRSCTLR2_PAIRINV_LSB, 21
# -----------------------------------------------------------------------------
# Field       : M33_TRCRSCTLR2_INV
# Description : Inverts the selected resources
.equ	M33_TRCRSCTLR2_INV_RESET, 0x0
.equ	M33_TRCRSCTLR2_INV_BITS, 0x00100000
.equ	M33_TRCRSCTLR2_INV_MSB, 20
.equ	M33_TRCRSCTLR2_INV_LSB, 20
# -----------------------------------------------------------------------------
# Field       : M33_TRCRSCTLR2_GROUP
# Description : Selects a group of resource
.equ	M33_TRCRSCTLR2_GROUP_RESET, 0x0
.equ	M33_TRCRSCTLR2_GROUP_BITS, 0x00070000
.equ	M33_TRCRSCTLR2_GROUP_MSB, 18
.equ	M33_TRCRSCTLR2_GROUP_LSB, 16
# -----------------------------------------------------------------------------
# Field       : M33_TRCRSCTLR2_SELECT
# Description : Selects one or more resources from the wanted group. One bit is
#               provided per resource from the group
.equ	M33_TRCRSCTLR2_SELECT_RESET, 0x00
.equ	M33_TRCRSCTLR2_SELECT_BITS, 0x000000ff
.equ	M33_TRCRSCTLR2_SELECT_MSB, 7
.equ	M33_TRCRSCTLR2_SELECT_LSB, 0
# =============================================================================
# Register    : M33_TRCRSCTLR3
# Description : The TRCRSCTLR controls the trace resources
.equ	M33_TRCRSCTLR3_OFFSET, 0x0004120c
.equ	M33_TRCRSCTLR3_BITS, 0x003700ff
.equ	M33_TRCRSCTLR3_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_TRCRSCTLR3_PAIRINV
# Description : Inverts the result of a combined pair of resources.  This bit
#               is only implemented on the lower register for a pair of
#               resource selectors
.equ	M33_TRCRSCTLR3_PAIRINV_RESET, 0x0
.equ	M33_TRCRSCTLR3_PAIRINV_BITS, 0x00200000
.equ	M33_TRCRSCTLR3_PAIRINV_MSB, 21
.equ	M33_TRCRSCTLR3_PAIRINV_LSB, 21
# -----------------------------------------------------------------------------
# Field       : M33_TRCRSCTLR3_INV
# Description : Inverts the selected resources
.equ	M33_TRCRSCTLR3_INV_RESET, 0x0
.equ	M33_TRCRSCTLR3_INV_BITS, 0x00100000
.equ	M33_TRCRSCTLR3_INV_MSB, 20
.equ	M33_TRCRSCTLR3_INV_LSB, 20
# -----------------------------------------------------------------------------
# Field       : M33_TRCRSCTLR3_GROUP
# Description : Selects a group of resource
.equ	M33_TRCRSCTLR3_GROUP_RESET, 0x0
.equ	M33_TRCRSCTLR3_GROUP_BITS, 0x00070000
.equ	M33_TRCRSCTLR3_GROUP_MSB, 18
.equ	M33_TRCRSCTLR3_GROUP_LSB, 16
# -----------------------------------------------------------------------------
# Field       : M33_TRCRSCTLR3_SELECT
# Description : Selects one or more resources from the wanted group. One bit is
#               provided per resource from the group
.equ	M33_TRCRSCTLR3_SELECT_RESET, 0x00
.equ	M33_TRCRSCTLR3_SELECT_BITS, 0x000000ff
.equ	M33_TRCRSCTLR3_SELECT_MSB, 7
.equ	M33_TRCRSCTLR3_SELECT_LSB, 0
# =============================================================================
# Register    : M33_TRCSSCSR
# Description : Controls the corresponding single-shot comparator resource
.equ	M33_TRCSSCSR_OFFSET, 0x000412a0
.equ	M33_TRCSSCSR_BITS, 0x8000000f
.equ	M33_TRCSSCSR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_TRCSSCSR_STATUS
# Description : Single-shot status bit. Indicates if any of the comparators,
#               that TRCSSCCRn.SAC or TRCSSCCRn.ARC selects, have matched
.equ	M33_TRCSSCSR_STATUS_RESET, 0x0
.equ	M33_TRCSSCSR_STATUS_BITS, 0x80000000
.equ	M33_TRCSSCSR_STATUS_MSB, 31
.equ	M33_TRCSSCSR_STATUS_LSB, 31
# -----------------------------------------------------------------------------
# Field       : M33_TRCSSCSR_PC
# Description : Reserved, RES1
.equ	M33_TRCSSCSR_PC_RESET, 0x0
.equ	M33_TRCSSCSR_PC_BITS, 0x00000008
.equ	M33_TRCSSCSR_PC_MSB, 3
.equ	M33_TRCSSCSR_PC_LSB, 3
# -----------------------------------------------------------------------------
# Field       : M33_TRCSSCSR_DV
# Description : Reserved, RES0
.equ	M33_TRCSSCSR_DV_RESET, 0x0
.equ	M33_TRCSSCSR_DV_BITS, 0x00000004
.equ	M33_TRCSSCSR_DV_MSB, 2
.equ	M33_TRCSSCSR_DV_LSB, 2
# -----------------------------------------------------------------------------
# Field       : M33_TRCSSCSR_DA
# Description : Reserved, RES0
.equ	M33_TRCSSCSR_DA_RESET, 0x0
.equ	M33_TRCSSCSR_DA_BITS, 0x00000002
.equ	M33_TRCSSCSR_DA_MSB, 1
.equ	M33_TRCSSCSR_DA_LSB, 1
# -----------------------------------------------------------------------------
# Field       : M33_TRCSSCSR_INST
# Description : Reserved, RES0
.equ	M33_TRCSSCSR_INST_RESET, 0x0
.equ	M33_TRCSSCSR_INST_BITS, 0x00000001
.equ	M33_TRCSSCSR_INST_MSB, 0
.equ	M33_TRCSSCSR_INST_LSB, 0
# =============================================================================
# Register    : M33_TRCSSPCICR
# Description : Selects the PE comparator inputs for Single-shot control
.equ	M33_TRCSSPCICR_OFFSET, 0x000412c0
.equ	M33_TRCSSPCICR_BITS, 0x0000000f
.equ	M33_TRCSSPCICR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_TRCSSPCICR_PC
# Description : Selects one or more PE comparator inputs for Single-shot
#               control.  TRCIDR4.NUMPC defines the size of the PC field.  1
#               bit is provided for each implemented PE comparator input.  For
#               example, if bit[1] == 1 this selects PE comparator input 1 for
#               Single-shot control
.equ	M33_TRCSSPCICR_PC_RESET, 0x0
.equ	M33_TRCSSPCICR_PC_BITS, 0x0000000f
.equ	M33_TRCSSPCICR_PC_MSB, 3
.equ	M33_TRCSSPCICR_PC_LSB, 0
# =============================================================================
# Register    : M33_TRCPDCR
# Description : Requests the system to provide power to the trace unit
.equ	M33_TRCPDCR_OFFSET, 0x00041310
.equ	M33_TRCPDCR_BITS, 0x00000008
.equ	M33_TRCPDCR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_TRCPDCR_PU
# Description : Powerup request bit:
.equ	M33_TRCPDCR_PU_RESET, 0x0
.equ	M33_TRCPDCR_PU_BITS, 0x00000008
.equ	M33_TRCPDCR_PU_MSB, 3
.equ	M33_TRCPDCR_PU_LSB, 3
# =============================================================================
# Register    : M33_TRCPDSR
# Description : Returns the following information about the trace unit: - OS
#               Lock status.  - Core power domain status.  - Power interruption
#               status
.equ	M33_TRCPDSR_OFFSET, 0x00041314
.equ	M33_TRCPDSR_BITS, 0x00000023
.equ	M33_TRCPDSR_RESET, 0x00000003
# -----------------------------------------------------------------------------
# Field       : M33_TRCPDSR_OSLK
# Description : OS Lock status bit:
.equ	M33_TRCPDSR_OSLK_RESET, 0x0
.equ	M33_TRCPDSR_OSLK_BITS, 0x00000020
.equ	M33_TRCPDSR_OSLK_MSB, 5
.equ	M33_TRCPDSR_OSLK_LSB, 5
# -----------------------------------------------------------------------------
# Field       : M33_TRCPDSR_STICKYPD
# Description : Sticky powerdown status bit. Indicates whether the trace
#               register state is valid:
.equ	M33_TRCPDSR_STICKYPD_RESET, 0x1
.equ	M33_TRCPDSR_STICKYPD_BITS, 0x00000002
.equ	M33_TRCPDSR_STICKYPD_MSB, 1
.equ	M33_TRCPDSR_STICKYPD_LSB, 1
# -----------------------------------------------------------------------------
# Field       : M33_TRCPDSR_POWER
# Description : Power status bit:
.equ	M33_TRCPDSR_POWER_RESET, 0x1
.equ	M33_TRCPDSR_POWER_BITS, 0x00000001
.equ	M33_TRCPDSR_POWER_MSB, 0
.equ	M33_TRCPDSR_POWER_LSB, 0
# =============================================================================
# Register    : M33_TRCITATBIDR
# Description : Trace Integration ATB Identification Register
.equ	M33_TRCITATBIDR_OFFSET, 0x00041ee4
.equ	M33_TRCITATBIDR_BITS, 0x0000007f
.equ	M33_TRCITATBIDR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_TRCITATBIDR_ID
# Description : Trace ID
.equ	M33_TRCITATBIDR_ID_RESET, 0x00
.equ	M33_TRCITATBIDR_ID_BITS, 0x0000007f
.equ	M33_TRCITATBIDR_ID_MSB, 6
.equ	M33_TRCITATBIDR_ID_LSB, 0
# =============================================================================
# Register    : M33_TRCITIATBINR
# Description : Trace Integration Instruction ATB In Register
.equ	M33_TRCITIATBINR_OFFSET, 0x00041ef4
.equ	M33_TRCITIATBINR_BITS, 0x00000003
.equ	M33_TRCITIATBINR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_TRCITIATBINR_AFVALIDM
# Description : Integration Mode instruction AFVALIDM in
.equ	M33_TRCITIATBINR_AFVALIDM_RESET, 0x0
.equ	M33_TRCITIATBINR_AFVALIDM_BITS, 0x00000002
.equ	M33_TRCITIATBINR_AFVALIDM_MSB, 1
.equ	M33_TRCITIATBINR_AFVALIDM_LSB, 1
