konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/m33.inc
# -----------------------------------------------------------------------------
# Field       : M33_TRCITIATBINR_ATREADYM
# Description : Integration Mode instruction ATREADYM in
.equ	M33_TRCITIATBINR_ATREADYM_RESET, 0x0
.equ	M33_TRCITIATBINR_ATREADYM_BITS, 0x00000001
.equ	M33_TRCITIATBINR_ATREADYM_MSB, 0
.equ	M33_TRCITIATBINR_ATREADYM_LSB, 0
# =============================================================================
# Register    : M33_TRCITIATBOUTR
# Description : Trace Integration Instruction ATB Out Register
.equ	M33_TRCITIATBOUTR_OFFSET, 0x00041efc
.equ	M33_TRCITIATBOUTR_BITS, 0x00000003
.equ	M33_TRCITIATBOUTR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_TRCITIATBOUTR_AFREADY
# Description : Integration Mode instruction AFREADY out
.equ	M33_TRCITIATBOUTR_AFREADY_RESET, 0x0
.equ	M33_TRCITIATBOUTR_AFREADY_BITS, 0x00000002
.equ	M33_TRCITIATBOUTR_AFREADY_MSB, 1
.equ	M33_TRCITIATBOUTR_AFREADY_LSB, 1
# -----------------------------------------------------------------------------
# Field       : M33_TRCITIATBOUTR_ATVALID
# Description : Integration Mode instruction ATVALID out
.equ	M33_TRCITIATBOUTR_ATVALID_RESET, 0x0
.equ	M33_TRCITIATBOUTR_ATVALID_BITS, 0x00000001
.equ	M33_TRCITIATBOUTR_ATVALID_MSB, 0
.equ	M33_TRCITIATBOUTR_ATVALID_LSB, 0
# =============================================================================
# Register    : M33_TRCCLAIMSET
# Description : Claim Tag Set Register
.equ	M33_TRCCLAIMSET_OFFSET, 0x00041fa0
.equ	M33_TRCCLAIMSET_BITS, 0x0000000f
.equ	M33_TRCCLAIMSET_RESET, 0x0000000f
# -----------------------------------------------------------------------------
# Field       : M33_TRCCLAIMSET_SET3
# Description : When a write to one of these bits occurs, with the value:
.equ	M33_TRCCLAIMSET_SET3_RESET, 0x1
.equ	M33_TRCCLAIMSET_SET3_BITS, 0x00000008
.equ	M33_TRCCLAIMSET_SET3_MSB, 3
.equ	M33_TRCCLAIMSET_SET3_LSB, 3
# -----------------------------------------------------------------------------
# Field       : M33_TRCCLAIMSET_SET2
# Description : When a write to one of these bits occurs, with the value:
.equ	M33_TRCCLAIMSET_SET2_RESET, 0x1
.equ	M33_TRCCLAIMSET_SET2_BITS, 0x00000004
.equ	M33_TRCCLAIMSET_SET2_MSB, 2
.equ	M33_TRCCLAIMSET_SET2_LSB, 2
# -----------------------------------------------------------------------------
# Field       : M33_TRCCLAIMSET_SET1
# Description : When a write to one of these bits occurs, with the value:
.equ	M33_TRCCLAIMSET_SET1_RESET, 0x1
.equ	M33_TRCCLAIMSET_SET1_BITS, 0x00000002
.equ	M33_TRCCLAIMSET_SET1_MSB, 1
.equ	M33_TRCCLAIMSET_SET1_LSB, 1
# -----------------------------------------------------------------------------
# Field       : M33_TRCCLAIMSET_SET0
# Description : When a write to one of these bits occurs, with the value:
.equ	M33_TRCCLAIMSET_SET0_RESET, 0x1
.equ	M33_TRCCLAIMSET_SET0_BITS, 0x00000001
.equ	M33_TRCCLAIMSET_SET0_MSB, 0
.equ	M33_TRCCLAIMSET_SET0_LSB, 0
# =============================================================================
# Register    : M33_TRCCLAIMCLR
# Description : Claim Tag Clear Register
.equ	M33_TRCCLAIMCLR_OFFSET, 0x00041fa4
.equ	M33_TRCCLAIMCLR_BITS, 0x0000000f
.equ	M33_TRCCLAIMCLR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_TRCCLAIMCLR_CLR3
# Description : When a write to one of these bits occurs, with the value:
.equ	M33_TRCCLAIMCLR_CLR3_RESET, 0x0
.equ	M33_TRCCLAIMCLR_CLR3_BITS, 0x00000008
.equ	M33_TRCCLAIMCLR_CLR3_MSB, 3
.equ	M33_TRCCLAIMCLR_CLR3_LSB, 3
# -----------------------------------------------------------------------------
# Field       : M33_TRCCLAIMCLR_CLR2
# Description : When a write to one of these bits occurs, with the value:
.equ	M33_TRCCLAIMCLR_CLR2_RESET, 0x0
.equ	M33_TRCCLAIMCLR_CLR2_BITS, 0x00000004
.equ	M33_TRCCLAIMCLR_CLR2_MSB, 2
.equ	M33_TRCCLAIMCLR_CLR2_LSB, 2
# -----------------------------------------------------------------------------
# Field       : M33_TRCCLAIMCLR_CLR1
# Description : When a write to one of these bits occurs, with the value:
.equ	M33_TRCCLAIMCLR_CLR1_RESET, 0x0
.equ	M33_TRCCLAIMCLR_CLR1_BITS, 0x00000002
.equ	M33_TRCCLAIMCLR_CLR1_MSB, 1
.equ	M33_TRCCLAIMCLR_CLR1_LSB, 1
# -----------------------------------------------------------------------------
# Field       : M33_TRCCLAIMCLR_CLR0
# Description : When a write to one of these bits occurs, with the value:
.equ	M33_TRCCLAIMCLR_CLR0_RESET, 0x0
.equ	M33_TRCCLAIMCLR_CLR0_BITS, 0x00000001
.equ	M33_TRCCLAIMCLR_CLR0_MSB, 0
.equ	M33_TRCCLAIMCLR_CLR0_LSB, 0
# =============================================================================
# Register    : M33_TRCAUTHSTATUS
# Description : Returns the level of tracing that the trace unit can support
.equ	M33_TRCAUTHSTATUS_OFFSET, 0x00041fb8
.equ	M33_TRCAUTHSTATUS_BITS, 0x000000ff
.equ	M33_TRCAUTHSTATUS_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_TRCAUTHSTATUS_SNID
# Description : Indicates whether the system enables the trace unit to support
#               Secure non-invasive debug:
.equ	M33_TRCAUTHSTATUS_SNID_RESET, 0x0
.equ	M33_TRCAUTHSTATUS_SNID_BITS, 0x000000c0
.equ	M33_TRCAUTHSTATUS_SNID_MSB, 7
.equ	M33_TRCAUTHSTATUS_SNID_LSB, 6
# -----------------------------------------------------------------------------
# Field       : M33_TRCAUTHSTATUS_SID
# Description : Indicates whether the trace unit supports Secure invasive
#               debug:
.equ	M33_TRCAUTHSTATUS_SID_RESET, 0x0
.equ	M33_TRCAUTHSTATUS_SID_BITS, 0x00000030
.equ	M33_TRCAUTHSTATUS_SID_MSB, 5
.equ	M33_TRCAUTHSTATUS_SID_LSB, 4
# -----------------------------------------------------------------------------
# Field       : M33_TRCAUTHSTATUS_NSNID
# Description : Indicates whether the system enables the trace unit to support
#               Non-secure non-invasive debug:
.equ	M33_TRCAUTHSTATUS_NSNID_RESET, 0x0
.equ	M33_TRCAUTHSTATUS_NSNID_BITS, 0x0000000c
.equ	M33_TRCAUTHSTATUS_NSNID_MSB, 3
.equ	M33_TRCAUTHSTATUS_NSNID_LSB, 2
# -----------------------------------------------------------------------------
# Field       : M33_TRCAUTHSTATUS_NSID
# Description : Indicates whether the trace unit supports Non-secure invasive
#               debug:
.equ	M33_TRCAUTHSTATUS_NSID_RESET, 0x0
.equ	M33_TRCAUTHSTATUS_NSID_BITS, 0x00000003
.equ	M33_TRCAUTHSTATUS_NSID_MSB, 1
.equ	M33_TRCAUTHSTATUS_NSID_LSB, 0
# =============================================================================
# Register    : M33_TRCDEVARCH
# Description : TRCDEVARCH
.equ	M33_TRCDEVARCH_OFFSET, 0x00041fbc
.equ	M33_TRCDEVARCH_BITS, 0xffffffff
.equ	M33_TRCDEVARCH_RESET, 0x47724a13
# -----------------------------------------------------------------------------
# Field       : M33_TRCDEVARCH_ARCHITECT
# Description : reads as 0b01000111011
.equ	M33_TRCDEVARCH_ARCHITECT_RESET, 0x23b
.equ	M33_TRCDEVARCH_ARCHITECT_BITS, 0xffe00000
.equ	M33_TRCDEVARCH_ARCHITECT_MSB, 31
.equ	M33_TRCDEVARCH_ARCHITECT_LSB, 21
# -----------------------------------------------------------------------------
# Field       : M33_TRCDEVARCH_PRESENT
# Description : reads as 0b1
.equ	M33_TRCDEVARCH_PRESENT_RESET, 0x1
.equ	M33_TRCDEVARCH_PRESENT_BITS, 0x00100000
.equ	M33_TRCDEVARCH_PRESENT_MSB, 20
.equ	M33_TRCDEVARCH_PRESENT_LSB, 20
# -----------------------------------------------------------------------------
# Field       : M33_TRCDEVARCH_REVISION
# Description : reads as 0b0000
.equ	M33_TRCDEVARCH_REVISION_RESET, 0x2
.equ	M33_TRCDEVARCH_REVISION_BITS, 0x000f0000
.equ	M33_TRCDEVARCH_REVISION_MSB, 19
.equ	M33_TRCDEVARCH_REVISION_LSB, 16
# -----------------------------------------------------------------------------
# Field       : M33_TRCDEVARCH_ARCHID
# Description : reads as 0b0100101000010011
.equ	M33_TRCDEVARCH_ARCHID_RESET, 0x4a13
.equ	M33_TRCDEVARCH_ARCHID_BITS, 0x0000ffff
.equ	M33_TRCDEVARCH_ARCHID_MSB, 15
.equ	M33_TRCDEVARCH_ARCHID_LSB, 0
# =============================================================================
# Register    : M33_TRCDEVID
# Description : TRCDEVID
.equ	M33_TRCDEVID_OFFSET, 0x00041fc8
.equ	M33_TRCDEVID_BITS, 0x00000000
.equ	M33_TRCDEVID_RESET, 0x00000000
.equ	M33_TRCDEVID_MSB, 31
.equ	M33_TRCDEVID_LSB, 0
# =============================================================================
# Register    : M33_TRCDEVTYPE
# Description : TRCDEVTYPE
.equ	M33_TRCDEVTYPE_OFFSET, 0x00041fcc
.equ	M33_TRCDEVTYPE_BITS, 0x000000ff
.equ	M33_TRCDEVTYPE_RESET, 0x00000013
# -----------------------------------------------------------------------------
# Field       : M33_TRCDEVTYPE_SUB
# Description : reads as 0b0001
.equ	M33_TRCDEVTYPE_SUB_RESET, 0x1
.equ	M33_TRCDEVTYPE_SUB_BITS, 0x000000f0
.equ	M33_TRCDEVTYPE_SUB_MSB, 7
.equ	M33_TRCDEVTYPE_SUB_LSB, 4
# -----------------------------------------------------------------------------
# Field       : M33_TRCDEVTYPE_MAJOR
# Description : reads as 0b0011
.equ	M33_TRCDEVTYPE_MAJOR_RESET, 0x3
.equ	M33_TRCDEVTYPE_MAJOR_BITS, 0x0000000f
.equ	M33_TRCDEVTYPE_MAJOR_MSB, 3
.equ	M33_TRCDEVTYPE_MAJOR_LSB, 0
# =============================================================================
# Register    : M33_TRCPIDR4
# Description : TRCPIDR4
.equ	M33_TRCPIDR4_OFFSET, 0x00041fd0
.equ	M33_TRCPIDR4_BITS, 0x000000ff
.equ	M33_TRCPIDR4_RESET, 0x00000004
# -----------------------------------------------------------------------------
# Field       : M33_TRCPIDR4_SIZE
# Description : reads as `ImpDef
.equ	M33_TRCPIDR4_SIZE_RESET, 0x0
.equ	M33_TRCPIDR4_SIZE_BITS, 0x000000f0
.equ	M33_TRCPIDR4_SIZE_MSB, 7
.equ	M33_TRCPIDR4_SIZE_LSB, 4
# -----------------------------------------------------------------------------
# Field       : M33_TRCPIDR4_DES_2
# Description : reads as `ImpDef
.equ	M33_TRCPIDR4_DES_2_RESET, 0x4
.equ	M33_TRCPIDR4_DES_2_BITS, 0x0000000f
.equ	M33_TRCPIDR4_DES_2_MSB, 3
.equ	M33_TRCPIDR4_DES_2_LSB, 0
# =============================================================================
# Register    : M33_TRCPIDR5
# Description : TRCPIDR5
.equ	M33_TRCPIDR5_OFFSET, 0x00041fd4
.equ	M33_TRCPIDR5_BITS, 0x00000000
.equ	M33_TRCPIDR5_RESET, 0x00000000
.equ	M33_TRCPIDR5_MSB, 31
.equ	M33_TRCPIDR5_LSB, 0
# =============================================================================
# Register    : M33_TRCPIDR6
# Description : TRCPIDR6
.equ	M33_TRCPIDR6_OFFSET, 0x00041fd8
.equ	M33_TRCPIDR6_BITS, 0x00000000
.equ	M33_TRCPIDR6_RESET, 0x00000000
.equ	M33_TRCPIDR6_MSB, 31
.equ	M33_TRCPIDR6_LSB, 0
# =============================================================================
# Register    : M33_TRCPIDR7
# Description : TRCPIDR7
.equ	M33_TRCPIDR7_OFFSET, 0x00041fdc
.equ	M33_TRCPIDR7_BITS, 0x00000000
.equ	M33_TRCPIDR7_RESET, 0x00000000
.equ	M33_TRCPIDR7_MSB, 31
.equ	M33_TRCPIDR7_LSB, 0
# =============================================================================
# Register    : M33_TRCPIDR0
# Description : TRCPIDR0
.equ	M33_TRCPIDR0_OFFSET, 0x00041fe0
.equ	M33_TRCPIDR0_BITS, 0x000000ff
.equ	M33_TRCPIDR0_RESET, 0x00000021
# -----------------------------------------------------------------------------
# Field       : M33_TRCPIDR0_PART_0
# Description : reads as `ImpDef
.equ	M33_TRCPIDR0_PART_0_RESET, 0x21
.equ	M33_TRCPIDR0_PART_0_BITS, 0x000000ff
.equ	M33_TRCPIDR0_PART_0_MSB, 7
.equ	M33_TRCPIDR0_PART_0_LSB, 0
# =============================================================================
# Register    : M33_TRCPIDR1
# Description : TRCPIDR1
.equ	M33_TRCPIDR1_OFFSET, 0x00041fe4
.equ	M33_TRCPIDR1_BITS, 0x000000ff
.equ	M33_TRCPIDR1_RESET, 0x000000bd
# -----------------------------------------------------------------------------
# Field       : M33_TRCPIDR1_DES_0
# Description : reads as `ImpDef
.equ	M33_TRCPIDR1_DES_0_RESET, 0xb
.equ	M33_TRCPIDR1_DES_0_BITS, 0x000000f0
.equ	M33_TRCPIDR1_DES_0_MSB, 7
.equ	M33_TRCPIDR1_DES_0_LSB, 4
# -----------------------------------------------------------------------------
# Field       : M33_TRCPIDR1_PART_0
# Description : reads as `ImpDef
.equ	M33_TRCPIDR1_PART_0_RESET, 0xd
.equ	M33_TRCPIDR1_PART_0_BITS, 0x0000000f
.equ	M33_TRCPIDR1_PART_0_MSB, 3
.equ	M33_TRCPIDR1_PART_0_LSB, 0
# =============================================================================
# Register    : M33_TRCPIDR2
# Description : TRCPIDR2
.equ	M33_TRCPIDR2_OFFSET, 0x00041fe8
.equ	M33_TRCPIDR2_BITS, 0x000000ff
.equ	M33_TRCPIDR2_RESET, 0x0000002b
# -----------------------------------------------------------------------------
# Field       : M33_TRCPIDR2_REVISION
# Description : reads as `ImpDef
.equ	M33_TRCPIDR2_REVISION_RESET, 0x2
.equ	M33_TRCPIDR2_REVISION_BITS, 0x000000f0
.equ	M33_TRCPIDR2_REVISION_MSB, 7
.equ	M33_TRCPIDR2_REVISION_LSB, 4
# -----------------------------------------------------------------------------
# Field       : M33_TRCPIDR2_JEDEC
# Description : reads as 0b1
.equ	M33_TRCPIDR2_JEDEC_RESET, 0x1
.equ	M33_TRCPIDR2_JEDEC_BITS, 0x00000008
.equ	M33_TRCPIDR2_JEDEC_MSB, 3
.equ	M33_TRCPIDR2_JEDEC_LSB, 3
# -----------------------------------------------------------------------------
# Field       : M33_TRCPIDR2_DES_0
# Description : reads as `ImpDef
.equ	M33_TRCPIDR2_DES_0_RESET, 0x3
.equ	M33_TRCPIDR2_DES_0_BITS, 0x00000007
.equ	M33_TRCPIDR2_DES_0_MSB, 2
.equ	M33_TRCPIDR2_DES_0_LSB, 0
# =============================================================================
# Register    : M33_TRCPIDR3
# Description : TRCPIDR3
.equ	M33_TRCPIDR3_OFFSET, 0x00041fec
.equ	M33_TRCPIDR3_BITS, 0x000000ff
.equ	M33_TRCPIDR3_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_TRCPIDR3_REVAND
# Description : reads as `ImpDef
.equ	M33_TRCPIDR3_REVAND_RESET, 0x0
.equ	M33_TRCPIDR3_REVAND_BITS, 0x000000f0
.equ	M33_TRCPIDR3_REVAND_MSB, 7
.equ	M33_TRCPIDR3_REVAND_LSB, 4
# -----------------------------------------------------------------------------
# Field       : M33_TRCPIDR3_CMOD
# Description : reads as `ImpDef
.equ	M33_TRCPIDR3_CMOD_RESET, 0x0
.equ	M33_TRCPIDR3_CMOD_BITS, 0x0000000f
.equ	M33_TRCPIDR3_CMOD_MSB, 3
.equ	M33_TRCPIDR3_CMOD_LSB, 0
# =============================================================================
# Register    : M33_TRCCIDR0
# Description : TRCCIDR0
.equ	M33_TRCCIDR0_OFFSET, 0x00041ff0
.equ	M33_TRCCIDR0_BITS, 0x000000ff
.equ	M33_TRCCIDR0_RESET, 0x0000000d
# -----------------------------------------------------------------------------
# Field       : M33_TRCCIDR0_PRMBL_0
# Description : reads as 0b00001101
.equ	M33_TRCCIDR0_PRMBL_0_RESET, 0x0d
.equ	M33_TRCCIDR0_PRMBL_0_BITS, 0x000000ff
.equ	M33_TRCCIDR0_PRMBL_0_MSB, 7
.equ	M33_TRCCIDR0_PRMBL_0_LSB, 0
# =============================================================================
# Register    : M33_TRCCIDR1
# Description : TRCCIDR1
.equ	M33_TRCCIDR1_OFFSET, 0x00041ff4
.equ	M33_TRCCIDR1_BITS, 0x000000ff
.equ	M33_TRCCIDR1_RESET, 0x00000090
# -----------------------------------------------------------------------------
# Field       : M33_TRCCIDR1_CLASS
# Description : reads as 0b1001
.equ	M33_TRCCIDR1_CLASS_RESET, 0x9
.equ	M33_TRCCIDR1_CLASS_BITS, 0x000000f0
.equ	M33_TRCCIDR1_CLASS_MSB, 7
.equ	M33_TRCCIDR1_CLASS_LSB, 4
# -----------------------------------------------------------------------------
# Field       : M33_TRCCIDR1_PRMBL_1
# Description : reads as 0b0000
.equ	M33_TRCCIDR1_PRMBL_1_RESET, 0x0
.equ	M33_TRCCIDR1_PRMBL_1_BITS, 0x0000000f
.equ	M33_TRCCIDR1_PRMBL_1_MSB, 3
.equ	M33_TRCCIDR1_PRMBL_1_LSB, 0
# =============================================================================
# Register    : M33_TRCCIDR2
# Description : TRCCIDR2
.equ	M33_TRCCIDR2_OFFSET, 0x00041ff8
.equ	M33_TRCCIDR2_BITS, 0x000000ff
.equ	M33_TRCCIDR2_RESET, 0x00000005
# -----------------------------------------------------------------------------
# Field       : M33_TRCCIDR2_PRMBL_2
# Description : reads as 0b00000101
.equ	M33_TRCCIDR2_PRMBL_2_RESET, 0x05
.equ	M33_TRCCIDR2_PRMBL_2_BITS, 0x000000ff
.equ	M33_TRCCIDR2_PRMBL_2_MSB, 7
.equ	M33_TRCCIDR2_PRMBL_2_LSB, 0
# =============================================================================
# Register    : M33_TRCCIDR3
# Description : TRCCIDR3
.equ	M33_TRCCIDR3_OFFSET, 0x00041ffc
.equ	M33_TRCCIDR3_BITS, 0x000000ff
.equ	M33_TRCCIDR3_RESET, 0x000000b1
# -----------------------------------------------------------------------------
# Field       : M33_TRCCIDR3_PRMBL_3
# Description : reads as 0b10110001
.equ	M33_TRCCIDR3_PRMBL_3_RESET, 0xb1
.equ	M33_TRCCIDR3_PRMBL_3_BITS, 0x000000ff
.equ	M33_TRCCIDR3_PRMBL_3_MSB, 7
.equ	M33_TRCCIDR3_PRMBL_3_LSB, 0
# =============================================================================
# Register    : M33_CTICONTROL
# Description : CTI Control Register
.equ	M33_CTICONTROL_OFFSET, 0x00042000
.equ	M33_CTICONTROL_BITS, 0x00000001
.equ	M33_CTICONTROL_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_CTICONTROL_GLBEN
# Description : Enables or disables the CTI
.equ	M33_CTICONTROL_GLBEN_RESET, 0x0
.equ	M33_CTICONTROL_GLBEN_BITS, 0x00000001
.equ	M33_CTICONTROL_GLBEN_MSB, 0
.equ	M33_CTICONTROL_GLBEN_LSB, 0
# =============================================================================
# Register    : M33_CTIINTACK
# Description : CTI Interrupt Acknowledge Register
.equ	M33_CTIINTACK_OFFSET, 0x00042010
.equ	M33_CTIINTACK_BITS, 0x000000ff
.equ	M33_CTIINTACK_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_CTIINTACK_INTACK
# Description : Acknowledges the corresponding ctitrigout output. There is one
#               bit of the register for each ctitrigout output. When a 1 is
#               written to a bit in this register, the corresponding ctitrigout
#               is acknowledged, causing it to be cleared.
.equ	M33_CTIINTACK_INTACK_RESET, 0x00
.equ	M33_CTIINTACK_INTACK_BITS, 0x000000ff
.equ	M33_CTIINTACK_INTACK_MSB, 7
.equ	M33_CTIINTACK_INTACK_LSB, 0
# =============================================================================
# Register    : M33_CTIAPPSET
# Description : CTI Application Trigger Set Register
.equ	M33_CTIAPPSET_OFFSET, 0x00042014
.equ	M33_CTIAPPSET_BITS, 0x0000000f
.equ	M33_CTIAPPSET_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_CTIAPPSET_APPSET
# Description : Setting a bit HIGH generates a channel event for the selected
#               channel. There is one bit of the register for each channel
.equ	M33_CTIAPPSET_APPSET_RESET, 0x0
.equ	M33_CTIAPPSET_APPSET_BITS, 0x0000000f
.equ	M33_CTIAPPSET_APPSET_MSB, 3
.equ	M33_CTIAPPSET_APPSET_LSB, 0
# =============================================================================
# Register    : M33_CTIAPPCLEAR
# Description : CTI Application Trigger Clear Register
.equ	M33_CTIAPPCLEAR_OFFSET, 0x00042018
.equ	M33_CTIAPPCLEAR_BITS, 0x0000000f
.equ	M33_CTIAPPCLEAR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_CTIAPPCLEAR_APPCLEAR
# Description : Sets the corresponding bits in the CTIAPPSET to 0. There is one
#               bit of the register for each channel.
.equ	M33_CTIAPPCLEAR_APPCLEAR_RESET, 0x0
.equ	M33_CTIAPPCLEAR_APPCLEAR_BITS, 0x0000000f
.equ	M33_CTIAPPCLEAR_APPCLEAR_MSB, 3
.equ	M33_CTIAPPCLEAR_APPCLEAR_LSB, 0
# =============================================================================
# Register    : M33_CTIAPPPULSE
# Description : CTI Application Pulse Register
.equ	M33_CTIAPPPULSE_OFFSET, 0x0004201c
.equ	M33_CTIAPPPULSE_BITS, 0x0000000f
.equ	M33_CTIAPPPULSE_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_CTIAPPPULSE_APPULSE
# Description : Setting a bit HIGH generates a channel event pulse for the
#               selected channel. There is one bit of the register for each
#               channel.
.equ	M33_CTIAPPPULSE_APPULSE_RESET, 0x0
.equ	M33_CTIAPPPULSE_APPULSE_BITS, 0x0000000f
.equ	M33_CTIAPPPULSE_APPULSE_MSB, 3
.equ	M33_CTIAPPPULSE_APPULSE_LSB, 0
# =============================================================================
# Register    : M33_CTIINEN0
# Description : CTI Trigger to Channel Enable Registers
.equ	M33_CTIINEN0_OFFSET, 0x00042020
.equ	M33_CTIINEN0_BITS, 0x0000000f
.equ	M33_CTIINEN0_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_CTIINEN0_TRIGINEN
# Description : Enables a cross trigger event to the corresponding channel when
#               a ctitrigin input is activated. There is one bit of the field
#               for each of the four channels
.equ	M33_CTIINEN0_TRIGINEN_RESET, 0x0
.equ	M33_CTIINEN0_TRIGINEN_BITS, 0x0000000f
.equ	M33_CTIINEN0_TRIGINEN_MSB, 3
.equ	M33_CTIINEN0_TRIGINEN_LSB, 0
# =============================================================================
# Register    : M33_CTIINEN1
# Description : CTI Trigger to Channel Enable Registers
.equ	M33_CTIINEN1_OFFSET, 0x00042024
.equ	M33_CTIINEN1_BITS, 0x0000000f
.equ	M33_CTIINEN1_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_CTIINEN1_TRIGINEN
# Description : Enables a cross trigger event to the corresponding channel when
#               a ctitrigin input is activated. There is one bit of the field
#               for each of the four channels
.equ	M33_CTIINEN1_TRIGINEN_RESET, 0x0
.equ	M33_CTIINEN1_TRIGINEN_BITS, 0x0000000f
.equ	M33_CTIINEN1_TRIGINEN_MSB, 3
.equ	M33_CTIINEN1_TRIGINEN_LSB, 0
# =============================================================================
# Register    : M33_CTIINEN2
# Description : CTI Trigger to Channel Enable Registers
.equ	M33_CTIINEN2_OFFSET, 0x00042028
.equ	M33_CTIINEN2_BITS, 0x0000000f
.equ	M33_CTIINEN2_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_CTIINEN2_TRIGINEN
# Description : Enables a cross trigger event to the corresponding channel when
#               a ctitrigin input is activated. There is one bit of the field
#               for each of the four channels
.equ	M33_CTIINEN2_TRIGINEN_RESET, 0x0
.equ	M33_CTIINEN2_TRIGINEN_BITS, 0x0000000f
.equ	M33_CTIINEN2_TRIGINEN_MSB, 3
.equ	M33_CTIINEN2_TRIGINEN_LSB, 0
# =============================================================================
# Register    : M33_CTIINEN3
# Description : CTI Trigger to Channel Enable Registers
.equ	M33_CTIINEN3_OFFSET, 0x0004202c
.equ	M33_CTIINEN3_BITS, 0x0000000f
.equ	M33_CTIINEN3_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_CTIINEN3_TRIGINEN
# Description : Enables a cross trigger event to the corresponding channel when
#               a ctitrigin input is activated. There is one bit of the field
#               for each of the four channels
.equ	M33_CTIINEN3_TRIGINEN_RESET, 0x0
.equ	M33_CTIINEN3_TRIGINEN_BITS, 0x0000000f
.equ	M33_CTIINEN3_TRIGINEN_MSB, 3
.equ	M33_CTIINEN3_TRIGINEN_LSB, 0
# =============================================================================
# Register    : M33_CTIINEN4
# Description : CTI Trigger to Channel Enable Registers
.equ	M33_CTIINEN4_OFFSET, 0x00042030
.equ	M33_CTIINEN4_BITS, 0x0000000f
.equ	M33_CTIINEN4_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_CTIINEN4_TRIGINEN
# Description : Enables a cross trigger event to the corresponding channel when
#               a ctitrigin input is activated. There is one bit of the field
#               for each of the four channels
.equ	M33_CTIINEN4_TRIGINEN_RESET, 0x0
.equ	M33_CTIINEN4_TRIGINEN_BITS, 0x0000000f
.equ	M33_CTIINEN4_TRIGINEN_MSB, 3
.equ	M33_CTIINEN4_TRIGINEN_LSB, 0
# =============================================================================
# Register    : M33_CTIINEN5
# Description : CTI Trigger to Channel Enable Registers
.equ	M33_CTIINEN5_OFFSET, 0x00042034
.equ	M33_CTIINEN5_BITS, 0x0000000f
.equ	M33_CTIINEN5_RESET, 0x00000000
