konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/m33.inc
# -----------------------------------------------------------------------------
# Field       : M33_CTIINEN5_TRIGINEN
# Description : Enables a cross trigger event to the corresponding channel when
#               a ctitrigin input is activated. There is one bit of the field
#               for each of the four channels
.equ	M33_CTIINEN5_TRIGINEN_RESET, 0x0
.equ	M33_CTIINEN5_TRIGINEN_BITS, 0x0000000f
.equ	M33_CTIINEN5_TRIGINEN_MSB, 3
.equ	M33_CTIINEN5_TRIGINEN_LSB, 0
# =============================================================================
# Register    : M33_CTIINEN6
# Description : CTI Trigger to Channel Enable Registers
.equ	M33_CTIINEN6_OFFSET, 0x00042038
.equ	M33_CTIINEN6_BITS, 0x0000000f
.equ	M33_CTIINEN6_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_CTIINEN6_TRIGINEN
# Description : Enables a cross trigger event to the corresponding channel when
#               a ctitrigin input is activated. There is one bit of the field
#               for each of the four channels
.equ	M33_CTIINEN6_TRIGINEN_RESET, 0x0
.equ	M33_CTIINEN6_TRIGINEN_BITS, 0x0000000f
.equ	M33_CTIINEN6_TRIGINEN_MSB, 3
.equ	M33_CTIINEN6_TRIGINEN_LSB, 0
# =============================================================================
# Register    : M33_CTIINEN7
# Description : CTI Trigger to Channel Enable Registers
.equ	M33_CTIINEN7_OFFSET, 0x0004203c
.equ	M33_CTIINEN7_BITS, 0x0000000f
.equ	M33_CTIINEN7_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_CTIINEN7_TRIGINEN
# Description : Enables a cross trigger event to the corresponding channel when
#               a ctitrigin input is activated. There is one bit of the field
#               for each of the four channels
.equ	M33_CTIINEN7_TRIGINEN_RESET, 0x0
.equ	M33_CTIINEN7_TRIGINEN_BITS, 0x0000000f
.equ	M33_CTIINEN7_TRIGINEN_MSB, 3
.equ	M33_CTIINEN7_TRIGINEN_LSB, 0
# =============================================================================
# Register    : M33_CTIOUTEN0
# Description : CTI Trigger to Channel Enable Registers
.equ	M33_CTIOUTEN0_OFFSET, 0x000420a0
.equ	M33_CTIOUTEN0_BITS, 0x0000000f
.equ	M33_CTIOUTEN0_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_CTIOUTEN0_TRIGOUTEN
# Description : Enables a cross trigger event to ctitrigout when the
#               corresponding channel is activated. There is one bit of the
#               field for each of the four channels.
.equ	M33_CTIOUTEN0_TRIGOUTEN_RESET, 0x0
.equ	M33_CTIOUTEN0_TRIGOUTEN_BITS, 0x0000000f
.equ	M33_CTIOUTEN0_TRIGOUTEN_MSB, 3
.equ	M33_CTIOUTEN0_TRIGOUTEN_LSB, 0
# =============================================================================
# Register    : M33_CTIOUTEN1
# Description : CTI Trigger to Channel Enable Registers
.equ	M33_CTIOUTEN1_OFFSET, 0x000420a4
.equ	M33_CTIOUTEN1_BITS, 0x0000000f
.equ	M33_CTIOUTEN1_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_CTIOUTEN1_TRIGOUTEN
# Description : Enables a cross trigger event to ctitrigout when the
#               corresponding channel is activated. There is one bit of the
#               field for each of the four channels.
.equ	M33_CTIOUTEN1_TRIGOUTEN_RESET, 0x0
.equ	M33_CTIOUTEN1_TRIGOUTEN_BITS, 0x0000000f
.equ	M33_CTIOUTEN1_TRIGOUTEN_MSB, 3
.equ	M33_CTIOUTEN1_TRIGOUTEN_LSB, 0
# =============================================================================
# Register    : M33_CTIOUTEN2
# Description : CTI Trigger to Channel Enable Registers
.equ	M33_CTIOUTEN2_OFFSET, 0x000420a8
.equ	M33_CTIOUTEN2_BITS, 0x0000000f
.equ	M33_CTIOUTEN2_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_CTIOUTEN2_TRIGOUTEN
# Description : Enables a cross trigger event to ctitrigout when the
#               corresponding channel is activated. There is one bit of the
#               field for each of the four channels.
.equ	M33_CTIOUTEN2_TRIGOUTEN_RESET, 0x0
.equ	M33_CTIOUTEN2_TRIGOUTEN_BITS, 0x0000000f
.equ	M33_CTIOUTEN2_TRIGOUTEN_MSB, 3
.equ	M33_CTIOUTEN2_TRIGOUTEN_LSB, 0
# =============================================================================
# Register    : M33_CTIOUTEN3
# Description : CTI Trigger to Channel Enable Registers
.equ	M33_CTIOUTEN3_OFFSET, 0x000420ac
.equ	M33_CTIOUTEN3_BITS, 0x0000000f
.equ	M33_CTIOUTEN3_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_CTIOUTEN3_TRIGOUTEN
# Description : Enables a cross trigger event to ctitrigout when the
#               corresponding channel is activated. There is one bit of the
#               field for each of the four channels.
.equ	M33_CTIOUTEN3_TRIGOUTEN_RESET, 0x0
.equ	M33_CTIOUTEN3_TRIGOUTEN_BITS, 0x0000000f
.equ	M33_CTIOUTEN3_TRIGOUTEN_MSB, 3
.equ	M33_CTIOUTEN3_TRIGOUTEN_LSB, 0
# =============================================================================
# Register    : M33_CTIOUTEN4
# Description : CTI Trigger to Channel Enable Registers
.equ	M33_CTIOUTEN4_OFFSET, 0x000420b0
.equ	M33_CTIOUTEN4_BITS, 0x0000000f
.equ	M33_CTIOUTEN4_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_CTIOUTEN4_TRIGOUTEN
# Description : Enables a cross trigger event to ctitrigout when the
#               corresponding channel is activated. There is one bit of the
#               field for each of the four channels.
.equ	M33_CTIOUTEN4_TRIGOUTEN_RESET, 0x0
.equ	M33_CTIOUTEN4_TRIGOUTEN_BITS, 0x0000000f
.equ	M33_CTIOUTEN4_TRIGOUTEN_MSB, 3
.equ	M33_CTIOUTEN4_TRIGOUTEN_LSB, 0
# =============================================================================
# Register    : M33_CTIOUTEN5
# Description : CTI Trigger to Channel Enable Registers
.equ	M33_CTIOUTEN5_OFFSET, 0x000420b4
.equ	M33_CTIOUTEN5_BITS, 0x0000000f
.equ	M33_CTIOUTEN5_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_CTIOUTEN5_TRIGOUTEN
# Description : Enables a cross trigger event to ctitrigout when the
#               corresponding channel is activated. There is one bit of the
#               field for each of the four channels.
.equ	M33_CTIOUTEN5_TRIGOUTEN_RESET, 0x0
.equ	M33_CTIOUTEN5_TRIGOUTEN_BITS, 0x0000000f
.equ	M33_CTIOUTEN5_TRIGOUTEN_MSB, 3
.equ	M33_CTIOUTEN5_TRIGOUTEN_LSB, 0
# =============================================================================
# Register    : M33_CTIOUTEN6
# Description : CTI Trigger to Channel Enable Registers
.equ	M33_CTIOUTEN6_OFFSET, 0x000420b8
.equ	M33_CTIOUTEN6_BITS, 0x0000000f
.equ	M33_CTIOUTEN6_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_CTIOUTEN6_TRIGOUTEN
# Description : Enables a cross trigger event to ctitrigout when the
#               corresponding channel is activated. There is one bit of the
#               field for each of the four channels.
.equ	M33_CTIOUTEN6_TRIGOUTEN_RESET, 0x0
.equ	M33_CTIOUTEN6_TRIGOUTEN_BITS, 0x0000000f
.equ	M33_CTIOUTEN6_TRIGOUTEN_MSB, 3
.equ	M33_CTIOUTEN6_TRIGOUTEN_LSB, 0
# =============================================================================
# Register    : M33_CTIOUTEN7
# Description : CTI Trigger to Channel Enable Registers
.equ	M33_CTIOUTEN7_OFFSET, 0x000420bc
.equ	M33_CTIOUTEN7_BITS, 0x0000000f
.equ	M33_CTIOUTEN7_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_CTIOUTEN7_TRIGOUTEN
# Description : Enables a cross trigger event to ctitrigout when the
#               corresponding channel is activated. There is one bit of the
#               field for each of the four channels.
.equ	M33_CTIOUTEN7_TRIGOUTEN_RESET, 0x0
.equ	M33_CTIOUTEN7_TRIGOUTEN_BITS, 0x0000000f
.equ	M33_CTIOUTEN7_TRIGOUTEN_MSB, 3
.equ	M33_CTIOUTEN7_TRIGOUTEN_LSB, 0
# =============================================================================
# Register    : M33_CTITRIGINSTATUS
# Description : CTI Trigger to Channel Enable Registers
.equ	M33_CTITRIGINSTATUS_OFFSET, 0x00042130
.equ	M33_CTITRIGINSTATUS_BITS, 0x000000ff
.equ	M33_CTITRIGINSTATUS_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_CTITRIGINSTATUS_TRIGINSTATUS
# Description : Shows the status of the ctitrigin inputs. There is one bit of
#               the field for each trigger input.Because the register provides
#               a view of the raw ctitrigin inputs, the reset value is UNKNOWN.
.equ	M33_CTITRIGINSTATUS_TRIGINSTATUS_RESET, 0x00
.equ	M33_CTITRIGINSTATUS_TRIGINSTATUS_BITS, 0x000000ff
.equ	M33_CTITRIGINSTATUS_TRIGINSTATUS_MSB, 7
.equ	M33_CTITRIGINSTATUS_TRIGINSTATUS_LSB, 0
# =============================================================================
# Register    : M33_CTITRIGOUTSTATUS
# Description : CTI Trigger In Status Register
.equ	M33_CTITRIGOUTSTATUS_OFFSET, 0x00042134
.equ	M33_CTITRIGOUTSTATUS_BITS, 0x000000ff
.equ	M33_CTITRIGOUTSTATUS_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_CTITRIGOUTSTATUS_TRIGOUTSTATUS
# Description : Shows the status of the ctitrigout outputs. There is one bit of
#               the field for each trigger output.
.equ	M33_CTITRIGOUTSTATUS_TRIGOUTSTATUS_RESET, 0x00
.equ	M33_CTITRIGOUTSTATUS_TRIGOUTSTATUS_BITS, 0x000000ff
.equ	M33_CTITRIGOUTSTATUS_TRIGOUTSTATUS_MSB, 7
.equ	M33_CTITRIGOUTSTATUS_TRIGOUTSTATUS_LSB, 0
# =============================================================================
# Register    : M33_CTICHINSTATUS
# Description : CTI Channel In Status Register
.equ	M33_CTICHINSTATUS_OFFSET, 0x00042138
.equ	M33_CTICHINSTATUS_BITS, 0x0000000f
.equ	M33_CTICHINSTATUS_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_CTICHINSTATUS_CTICHOUTSTATUS
# Description : Shows the status of the ctichout outputs. There is one bit of
#               the field for each channel output
.equ	M33_CTICHINSTATUS_CTICHOUTSTATUS_RESET, 0x0
.equ	M33_CTICHINSTATUS_CTICHOUTSTATUS_BITS, 0x0000000f
.equ	M33_CTICHINSTATUS_CTICHOUTSTATUS_MSB, 3
.equ	M33_CTICHINSTATUS_CTICHOUTSTATUS_LSB, 0
# =============================================================================
# Register    : M33_CTIGATE
# Description : Enable CTI Channel Gate register
.equ	M33_CTIGATE_OFFSET, 0x00042140
.equ	M33_CTIGATE_BITS, 0x0000000f
.equ	M33_CTIGATE_RESET, 0x0000000f
# -----------------------------------------------------------------------------
# Field       : M33_CTIGATE_CTIGATEEN3
# Description : Enable ctichout3. Set to 0 to disable channel propagation.
.equ	M33_CTIGATE_CTIGATEEN3_RESET, 0x1
.equ	M33_CTIGATE_CTIGATEEN3_BITS, 0x00000008
.equ	M33_CTIGATE_CTIGATEEN3_MSB, 3
.equ	M33_CTIGATE_CTIGATEEN3_LSB, 3
# -----------------------------------------------------------------------------
# Field       : M33_CTIGATE_CTIGATEEN2
# Description : Enable ctichout2. Set to 0 to disable channel propagation.
.equ	M33_CTIGATE_CTIGATEEN2_RESET, 0x1
.equ	M33_CTIGATE_CTIGATEEN2_BITS, 0x00000004
.equ	M33_CTIGATE_CTIGATEEN2_MSB, 2
.equ	M33_CTIGATE_CTIGATEEN2_LSB, 2
# -----------------------------------------------------------------------------
# Field       : M33_CTIGATE_CTIGATEEN1
# Description : Enable ctichout1. Set to 0 to disable channel propagation.
.equ	M33_CTIGATE_CTIGATEEN1_RESET, 0x1
.equ	M33_CTIGATE_CTIGATEEN1_BITS, 0x00000002
.equ	M33_CTIGATE_CTIGATEEN1_MSB, 1
.equ	M33_CTIGATE_CTIGATEEN1_LSB, 1
# -----------------------------------------------------------------------------
# Field       : M33_CTIGATE_CTIGATEEN0
# Description : Enable ctichout0. Set to 0 to disable channel propagation.
.equ	M33_CTIGATE_CTIGATEEN0_RESET, 0x1
.equ	M33_CTIGATE_CTIGATEEN0_BITS, 0x00000001
.equ	M33_CTIGATE_CTIGATEEN0_MSB, 0
.equ	M33_CTIGATE_CTIGATEEN0_LSB, 0
# =============================================================================
# Register    : M33_ASICCTL
# Description : External Multiplexer Control register
.equ	M33_ASICCTL_OFFSET, 0x00042144
.equ	M33_ASICCTL_BITS, 0x00000000
.equ	M33_ASICCTL_RESET, 0x00000000
.equ	M33_ASICCTL_MSB, 31
.equ	M33_ASICCTL_LSB, 0
# =============================================================================
# Register    : M33_ITCHOUT
# Description : Integration Test Channel Output register
.equ	M33_ITCHOUT_OFFSET, 0x00042ee4
.equ	M33_ITCHOUT_BITS, 0x0000000f
.equ	M33_ITCHOUT_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_ITCHOUT_CTCHOUT
# Description : Sets the value of the ctichout outputs
.equ	M33_ITCHOUT_CTCHOUT_RESET, 0x0
.equ	M33_ITCHOUT_CTCHOUT_BITS, 0x0000000f
.equ	M33_ITCHOUT_CTCHOUT_MSB, 3
.equ	M33_ITCHOUT_CTCHOUT_LSB, 0
# =============================================================================
# Register    : M33_ITTRIGOUT
# Description : Integration Test Trigger Output register
.equ	M33_ITTRIGOUT_OFFSET, 0x00042ee8
.equ	M33_ITTRIGOUT_BITS, 0x000000ff
.equ	M33_ITTRIGOUT_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_ITTRIGOUT_CTTRIGOUT
# Description : Sets the value of the ctitrigout outputs
.equ	M33_ITTRIGOUT_CTTRIGOUT_RESET, 0x00
.equ	M33_ITTRIGOUT_CTTRIGOUT_BITS, 0x000000ff
.equ	M33_ITTRIGOUT_CTTRIGOUT_MSB, 7
.equ	M33_ITTRIGOUT_CTTRIGOUT_LSB, 0
# =============================================================================
# Register    : M33_ITCHIN
# Description : Integration Test Channel Input register
.equ	M33_ITCHIN_OFFSET, 0x00042ef4
.equ	M33_ITCHIN_BITS, 0x0000000f
.equ	M33_ITCHIN_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_ITCHIN_CTCHIN
# Description : Reads the value of the ctichin inputs.
.equ	M33_ITCHIN_CTCHIN_RESET, 0x0
.equ	M33_ITCHIN_CTCHIN_BITS, 0x0000000f
.equ	M33_ITCHIN_CTCHIN_MSB, 3
.equ	M33_ITCHIN_CTCHIN_LSB, 0
# =============================================================================
# Register    : M33_ITCTRL
# Description : Integration Mode Control register
.equ	M33_ITCTRL_OFFSET, 0x00042f00
.equ	M33_ITCTRL_BITS, 0x00000001
.equ	M33_ITCTRL_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_ITCTRL_IME
# Description : Integration Mode Enable
.equ	M33_ITCTRL_IME_RESET, 0x0
.equ	M33_ITCTRL_IME_BITS, 0x00000001
.equ	M33_ITCTRL_IME_MSB, 0
.equ	M33_ITCTRL_IME_LSB, 0
# =============================================================================
# Register    : M33_DEVARCH
# Description : Device Architecture register
.equ	M33_DEVARCH_OFFSET, 0x00042fbc
.equ	M33_DEVARCH_BITS, 0xffffffff
.equ	M33_DEVARCH_RESET, 0x47701a14
# -----------------------------------------------------------------------------
# Field       : M33_DEVARCH_ARCHITECT
# Description : Indicates the component architect
.equ	M33_DEVARCH_ARCHITECT_RESET, 0x23b
.equ	M33_DEVARCH_ARCHITECT_BITS, 0xffe00000
.equ	M33_DEVARCH_ARCHITECT_MSB, 31
.equ	M33_DEVARCH_ARCHITECT_LSB, 21
# -----------------------------------------------------------------------------
# Field       : M33_DEVARCH_PRESENT
# Description : Indicates whether the DEVARCH register is present
.equ	M33_DEVARCH_PRESENT_RESET, 0x1
.equ	M33_DEVARCH_PRESENT_BITS, 0x00100000
.equ	M33_DEVARCH_PRESENT_MSB, 20
.equ	M33_DEVARCH_PRESENT_LSB, 20
# -----------------------------------------------------------------------------
# Field       : M33_DEVARCH_REVISION
# Description : Indicates the architecture revision
.equ	M33_DEVARCH_REVISION_RESET, 0x0
.equ	M33_DEVARCH_REVISION_BITS, 0x000f0000
.equ	M33_DEVARCH_REVISION_MSB, 19
.equ	M33_DEVARCH_REVISION_LSB, 16
# -----------------------------------------------------------------------------
# Field       : M33_DEVARCH_ARCHID
# Description : Indicates the component
.equ	M33_DEVARCH_ARCHID_RESET, 0x1a14
.equ	M33_DEVARCH_ARCHID_BITS, 0x0000ffff
.equ	M33_DEVARCH_ARCHID_MSB, 15
.equ	M33_DEVARCH_ARCHID_LSB, 0
# =============================================================================
# Register    : M33_DEVID
# Description : Device Configuration register
.equ	M33_DEVID_OFFSET, 0x00042fc8
.equ	M33_DEVID_BITS, 0x000fff1f
.equ	M33_DEVID_RESET, 0x00040800
# -----------------------------------------------------------------------------
# Field       : M33_DEVID_NUMCH
# Description : Number of ECT channels available
.equ	M33_DEVID_NUMCH_RESET, 0x4
.equ	M33_DEVID_NUMCH_BITS, 0x000f0000
.equ	M33_DEVID_NUMCH_MSB, 19
.equ	M33_DEVID_NUMCH_LSB, 16
# -----------------------------------------------------------------------------
# Field       : M33_DEVID_NUMTRIG
# Description : Number of ECT triggers available.
.equ	M33_DEVID_NUMTRIG_RESET, 0x08
.equ	M33_DEVID_NUMTRIG_BITS, 0x0000ff00
.equ	M33_DEVID_NUMTRIG_MSB, 15
.equ	M33_DEVID_NUMTRIG_LSB, 8
# -----------------------------------------------------------------------------
# Field       : M33_DEVID_EXTMUXNUM
# Description : Indicates the number of multiplexers available on Trigger
#               Inputs and Trigger Outputs that are using asicctl. The default
#               value of 0b00000 indicates that no multiplexing is present.
#               This value of this bit depends on the Verilog define EXTMUXNUM
#               that you must change accordingly.
.equ	M33_DEVID_EXTMUXNUM_RESET, 0x00
.equ	M33_DEVID_EXTMUXNUM_BITS, 0x0000001f
.equ	M33_DEVID_EXTMUXNUM_MSB, 4
.equ	M33_DEVID_EXTMUXNUM_LSB, 0
# =============================================================================
# Register    : M33_DEVTYPE
# Description : Device Type Identifier register
.equ	M33_DEVTYPE_OFFSET, 0x00042fcc
.equ	M33_DEVTYPE_BITS, 0x000000ff
.equ	M33_DEVTYPE_RESET, 0x00000014
# -----------------------------------------------------------------------------
# Field       : M33_DEVTYPE_SUB
# Description : Sub-classification of the type of the debug component as
#               specified in the ARM Architecture Specification within the
#               major classification as specified in the MAJOR field.
.equ	M33_DEVTYPE_SUB_RESET, 0x1
.equ	M33_DEVTYPE_SUB_BITS, 0x000000f0
.equ	M33_DEVTYPE_SUB_MSB, 7
.equ	M33_DEVTYPE_SUB_LSB, 4
# -----------------------------------------------------------------------------
# Field       : M33_DEVTYPE_MAJOR
# Description : Major classification of the type of the debug component as
#               specified in the ARM Architecture Specification for this debug
#               and trace component.
.equ	M33_DEVTYPE_MAJOR_RESET, 0x4
.equ	M33_DEVTYPE_MAJOR_BITS, 0x0000000f
.equ	M33_DEVTYPE_MAJOR_MSB, 3
.equ	M33_DEVTYPE_MAJOR_LSB, 0
# =============================================================================
# Register    : M33_PIDR4
# Description : CoreSight Peripheral ID4
.equ	M33_PIDR4_OFFSET, 0x00042fd0
.equ	M33_PIDR4_BITS, 0x000000ff
.equ	M33_PIDR4_RESET, 0x00000004
# -----------------------------------------------------------------------------
# Field       : M33_PIDR4_SIZE
# Description : Always 0b0000. Indicates that the device only occupies 4KB of
#               memory
.equ	M33_PIDR4_SIZE_RESET, 0x0
.equ	M33_PIDR4_SIZE_BITS, 0x000000f0
.equ	M33_PIDR4_SIZE_MSB, 7
.equ	M33_PIDR4_SIZE_LSB, 4
# -----------------------------------------------------------------------------
# Field       : M33_PIDR4_DES_2
# Description : Together, PIDR1.DES_0, PIDR2.DES_1, and PIDR4.DES_2 identify
#               the designer of the component.
.equ	M33_PIDR4_DES_2_RESET, 0x4
.equ	M33_PIDR4_DES_2_BITS, 0x0000000f
.equ	M33_PIDR4_DES_2_MSB, 3
.equ	M33_PIDR4_DES_2_LSB, 0
# =============================================================================
# Register    : M33_PIDR5
# Description : CoreSight Peripheral ID5
.equ	M33_PIDR5_OFFSET, 0x00042fd4
.equ	M33_PIDR5_BITS, 0x00000000
.equ	M33_PIDR5_RESET, 0x00000000
.equ	M33_PIDR5_MSB, 31
.equ	M33_PIDR5_LSB, 0
# =============================================================================
# Register    : M33_PIDR6
# Description : CoreSight Peripheral ID6
.equ	M33_PIDR6_OFFSET, 0x00042fd8
.equ	M33_PIDR6_BITS, 0x00000000
.equ	M33_PIDR6_RESET, 0x00000000
.equ	M33_PIDR6_MSB, 31
.equ	M33_PIDR6_LSB, 0
# =============================================================================
# Register    : M33_PIDR7
# Description : CoreSight Peripheral ID7
.equ	M33_PIDR7_OFFSET, 0x00042fdc
.equ	M33_PIDR7_BITS, 0x00000000
.equ	M33_PIDR7_RESET, 0x00000000
.equ	M33_PIDR7_MSB, 31
.equ	M33_PIDR7_LSB, 0
# =============================================================================
# Register    : M33_PIDR0
# Description : CoreSight Peripheral ID0
.equ	M33_PIDR0_OFFSET, 0x00042fe0
.equ	M33_PIDR0_BITS, 0x000000ff
.equ	M33_PIDR0_RESET, 0x00000021
# -----------------------------------------------------------------------------
# Field       : M33_PIDR0_PART_0
# Description : Bits[7:0] of the 12-bit part number of the component. The
#               designer of the component assigns this part number.
.equ	M33_PIDR0_PART_0_RESET, 0x21
.equ	M33_PIDR0_PART_0_BITS, 0x000000ff
.equ	M33_PIDR0_PART_0_MSB, 7
.equ	M33_PIDR0_PART_0_LSB, 0
# =============================================================================
# Register    : M33_PIDR1
# Description : CoreSight Peripheral ID1
.equ	M33_PIDR1_OFFSET, 0x00042fe4
.equ	M33_PIDR1_BITS, 0x000000ff
.equ	M33_PIDR1_RESET, 0x000000bd
# -----------------------------------------------------------------------------
# Field       : M33_PIDR1_DES_0
# Description : Together, PIDR1.DES_0, PIDR2.DES_1, and PIDR4.DES_2 identify
#               the designer of the component.
.equ	M33_PIDR1_DES_0_RESET, 0xb
.equ	M33_PIDR1_DES_0_BITS, 0x000000f0
.equ	M33_PIDR1_DES_0_MSB, 7
.equ	M33_PIDR1_DES_0_LSB, 4
# -----------------------------------------------------------------------------
# Field       : M33_PIDR1_PART_1
# Description : Bits[11:8] of the 12-bit part number of the component. The
#               designer of the component assigns this part number.
.equ	M33_PIDR1_PART_1_RESET, 0xd
.equ	M33_PIDR1_PART_1_BITS, 0x0000000f
.equ	M33_PIDR1_PART_1_MSB, 3
.equ	M33_PIDR1_PART_1_LSB, 0
# =============================================================================
# Register    : M33_PIDR2
# Description : CoreSight Peripheral ID2
.equ	M33_PIDR2_OFFSET, 0x00042fe8
.equ	M33_PIDR2_BITS, 0x000000ff
.equ	M33_PIDR2_RESET, 0x0000000b
# -----------------------------------------------------------------------------
# Field       : M33_PIDR2_REVISION
# Description : This device is at r1p0
.equ	M33_PIDR2_REVISION_RESET, 0x0
.equ	M33_PIDR2_REVISION_BITS, 0x000000f0
.equ	M33_PIDR2_REVISION_MSB, 7
.equ	M33_PIDR2_REVISION_LSB, 4
# -----------------------------------------------------------------------------
# Field       : M33_PIDR2_JEDEC
# Description : Always 1. Indicates that the JEDEC-assigned designer ID is
#               used.
.equ	M33_PIDR2_JEDEC_RESET, 0x1
.equ	M33_PIDR2_JEDEC_BITS, 0x00000008
.equ	M33_PIDR2_JEDEC_MSB, 3
.equ	M33_PIDR2_JEDEC_LSB, 3
# -----------------------------------------------------------------------------
# Field       : M33_PIDR2_DES_1
# Description : Together, PIDR1.DES_0, PIDR2.DES_1, and PIDR4.DES_2 identify
#               the designer of the component.
.equ	M33_PIDR2_DES_1_RESET, 0x3
.equ	M33_PIDR2_DES_1_BITS, 0x00000007
.equ	M33_PIDR2_DES_1_MSB, 2
.equ	M33_PIDR2_DES_1_LSB, 0
# =============================================================================
# Register    : M33_PIDR3
# Description : CoreSight Peripheral ID3
.equ	M33_PIDR3_OFFSET, 0x00042fec
.equ	M33_PIDR3_BITS, 0x000000ff
.equ	M33_PIDR3_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : M33_PIDR3_REVAND
# Description : Indicates minor errata fixes specific to the revision of the
#               component being used, for example metal fixes after
#               implementation. In most cases, this field is 0b0000. ARM
