konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/m33.inc
#               recommends that the component designers ensure that a metal fix
#               can change this field if required, for example, by driving it
#               from registers that reset to 0b0000.
.equ	M33_PIDR3_REVAND_RESET, 0x0
.equ	M33_PIDR3_REVAND_BITS, 0x000000f0
.equ	M33_PIDR3_REVAND_MSB, 7
.equ	M33_PIDR3_REVAND_LSB, 4
# -----------------------------------------------------------------------------
# Field       : M33_PIDR3_CMOD
# Description : Customer Modified. Indicates whether the customer has modified
#               the behavior of the component. In most cases, this field is
#               0b0000. Customers change this value when they make authorized
#               modifications to this component.
.equ	M33_PIDR3_CMOD_RESET, 0x0
.equ	M33_PIDR3_CMOD_BITS, 0x0000000f
.equ	M33_PIDR3_CMOD_MSB, 3
.equ	M33_PIDR3_CMOD_LSB, 0
# =============================================================================
# Register    : M33_CIDR0
# Description : CoreSight Component ID0
.equ	M33_CIDR0_OFFSET, 0x00042ff0
.equ	M33_CIDR0_BITS, 0x000000ff
.equ	M33_CIDR0_RESET, 0x0000000d
# -----------------------------------------------------------------------------
# Field       : M33_CIDR0_PRMBL_0
# Description : Preamble[0]. Contains bits[7:0] of the component identification
#               code
.equ	M33_CIDR0_PRMBL_0_RESET, 0x0d
.equ	M33_CIDR0_PRMBL_0_BITS, 0x000000ff
.equ	M33_CIDR0_PRMBL_0_MSB, 7
.equ	M33_CIDR0_PRMBL_0_LSB, 0
# =============================================================================
# Register    : M33_CIDR1
# Description : CoreSight Component ID1
.equ	M33_CIDR1_OFFSET, 0x00042ff4
.equ	M33_CIDR1_BITS, 0x000000ff
.equ	M33_CIDR1_RESET, 0x00000090
# -----------------------------------------------------------------------------
# Field       : M33_CIDR1_CLASS
# Description : Class of the component, for example, whether the component is a
#               ROM table or a generic CoreSight component. Contains
#               bits[15:12] of the component identification code.
.equ	M33_CIDR1_CLASS_RESET, 0x9
.equ	M33_CIDR1_CLASS_BITS, 0x000000f0
.equ	M33_CIDR1_CLASS_MSB, 7
.equ	M33_CIDR1_CLASS_LSB, 4
# -----------------------------------------------------------------------------
# Field       : M33_CIDR1_PRMBL_1
# Description : Preamble[1]. Contains bits[11:8] of the component
#               identification code.
.equ	M33_CIDR1_PRMBL_1_RESET, 0x0
.equ	M33_CIDR1_PRMBL_1_BITS, 0x0000000f
.equ	M33_CIDR1_PRMBL_1_MSB, 3
.equ	M33_CIDR1_PRMBL_1_LSB, 0
# =============================================================================
# Register    : M33_CIDR2
# Description : CoreSight Component ID2
.equ	M33_CIDR2_OFFSET, 0x00042ff8
.equ	M33_CIDR2_BITS, 0x000000ff
.equ	M33_CIDR2_RESET, 0x00000005
# -----------------------------------------------------------------------------
# Field       : M33_CIDR2_PRMBL_2
# Description : Preamble[2]. Contains bits[23:16] of the component
#               identification code.
.equ	M33_CIDR2_PRMBL_2_RESET, 0x05
.equ	M33_CIDR2_PRMBL_2_BITS, 0x000000ff
.equ	M33_CIDR2_PRMBL_2_MSB, 7
.equ	M33_CIDR2_PRMBL_2_LSB, 0
# =============================================================================
# Register    : M33_CIDR3
# Description : CoreSight Component ID3
.equ	M33_CIDR3_OFFSET, 0x00042ffc
.equ	M33_CIDR3_BITS, 0x000000ff
.equ	M33_CIDR3_RESET, 0x000000b1
# -----------------------------------------------------------------------------
# Field       : M33_CIDR3_PRMBL_3
# Description : Preamble[3]. Contains bits[31:24] of the component
#               identification code.
.equ	M33_CIDR3_PRMBL_3_RESET, 0xb1
.equ	M33_CIDR3_PRMBL_3_BITS, 0x000000ff
.equ	M33_CIDR3_PRMBL_3_MSB, 7
.equ	M33_CIDR3_PRMBL_3_LSB, 0
# =============================================================================
.endif # _HARDWARE_REGS_M33_H
